{"posts": [{"thread": {"uuid": "6772ca956c41f63513bda879d7488fa7759abad3", "url": "http://www.fool.com/earnings/call-transcripts/2019/04/02/lamb-weston-holdings-inc-lw-q3-2019-earnings-confe.aspx", "site_full": "www.fool.com", "site": "fool.com", "site_section": "http://www.fool.com/investing-news/", "site_categories": ["investing", "finance"], "section_title": "Motley Fool News &amp; Analysis -- The Motley Fool ", "title": "Lamb Weston Holdings, Inc. (LW) Q3 2019 Earnings Conference Call Transcript", "title_full": "Lamb Weston Holdings, Inc. (LW) Q3 2019 Earnings Conference Call Transcript -- The Motley Fool", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.025, "main_image": "https://g.foolcdn.com/editorial/images/517966/featured-transcript-logo.png", "performance_score": 0, "domain_rank": 1336, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "6772ca956c41f63513bda879d7488fa7759abad3", "url": "http://www.fool.com/earnings/call-transcripts/2019/04/02/lamb-weston-holdings-inc-lw-q3-2019-earnings-confe.aspx", "ord_in_thread": 0, "author": "Motley Fool Transcribers", "published": "2019-04-02T03:00:00.000+03:00", "title": "Lamb Weston Holdings, Inc. (LW) Q3 2019 Earnings Conference Call Transcript", "text": "Image source: The Motley Fool.\nLamb Weston Holdings, Inc. ( NYSE:LW )\nQ3 2019 Earnings Conference Call\nApril 02, 2019 , 10:00 a.m. ET\nContents: Prepared Remarks Questions and Answers Call Participants Prepared Remarks: Operator\nGood day, everyone. Thank you for standing by. Welcome to the Lamb Weston Third Quarter 2019 Earnings Call. Today's conference is being recorded.\nAt this time, I would like to turn the conference over to Dexter Congbalay, VP Investor Relations at Lamb Weston. Please go ahead, sir.\nDexter Congbalay -- Vice President, Investor Relations\nGood morning, and thank you for joining us for Lamb Weston's third quarter earnings call. This morning we issued our earnings press release, which is available on our website lambweston.com. Please note that during our remarks, we will make some forward-looking statements about the company's performance. These statements are based on how we see things today. Actual results may differ materially due to risks and uncertainties. Please refer to the cautionary statements and risk factors contained in our filings with the SEC for more details on our forward-looking statements. Some of today's remarks include non-GAAP financial measures. These non-GAAP financial measures should not be considered a replacement for, and should be read together with, our GAAP results. You can find the GAAP to non-GAAP reconciliations in our earnings release.\nWith me today are Tom Werner, our President and Chief Executive Officer; and Rob McNutt, our Chief Financial Officer. Tom will provide an overview of our performance and some updates on the operating environments in North America and Europe. Rob will then provide the details on our third quarter results and our updated fiscal 2019 outlook.\nWith that, let me now turn the call over the Tom.\nTom Werner -- President and Chief Executive Officer\nThank you, Dexter. Good morning, everyone, and thank you for joining our call today. I'm pleased to say that we're continuing to successfully execute on our strategies as we leverage our advantage global platform to serve our chain restaurant, foodservice and retail customers. We have a good operating momentum in each of our channels and remain committed to investing back in our business to support long-term growth and create value for all our stakeholders.\nIn the third quarter, we delivered solid results, despite facing difficult year ago comparisons and a challenging operating environment in Europe. Our top line growth of 7% was driven by a solid mix of volume and price mix in our global and foodservice segments. Adjusted EBITDA including unconsolidated joint ventures was also up 7%, and through the first nine months of the year we generated about $445 million of cash flow from operations. Because we delivered another solid quarter in a built good operating momentum, we've again raised our fiscal 2019 outlook. We now expect sales to increase high single digits and EBITDA, including unconsolidated joint ventures to be $895 million to $905 million.\nOur third quarter results reflect the continued strong execution and focus by our commercial supply chain and functional teams. Our global team continued to work closely with our large chain customers to drive growth across our key markets. This included driving incremental growth from limited time offers both in the US and Asia, winning new business from a fast growing regional quick serve restaurant chain and supporting customers affected by the short crop in Europe.\nOur foodservice direct sales team has been improving mix by increasing sales of Lamb Weston branded products. As part of that, the team has been working with a number of small and regional chain customers on trials for Crispy on Delivery, a unique fry that we created specifically for restaurant delivery.\nCustomer trials so far have been very successful with sales volumes greater than expected along with strong consumer response. We're looking to expand these trials and leverage our new direct sales force to broaden our Crispy on Delivery footprint. In fact, we're gaining traction on expanding our Crispy on Delivery customer base beyond traditional burger and chicken QSRs to include movie theaters and lodging for room service.\nOur retail team continued to build momentum with a strong increase in shipments of branded retail products, including Grown in Idaho. It continues to gain distribution and we're increasing support with the national advertising campaign and targeted digital marketing efforts.\nIn supply chain, our teams overcame extreme weather challenges in the Pacific Northwest, as well as disruption to some key inputs. The teams delivered strong performances in our manufacturing plants and implemented transportation workarounds to minimize supply interruptions to customers, all while continuing to drive cost and productivity savings. In addition, the team has our new 300 million pound production line in Hermiston, Oregon, on track to be operational this May.\nOur functional (ph) teams also continued to execute well. Our investments to upgrade our IT, sales, marketing and operating capabilities also remain on schedule as does the integration of Marvel Packers, the Australian potato processor we acquired in December.\nNow turning to our operating environment. In North America, we expect their environment to remain generally favorable through the rest of fiscal 2019 as demand growth continues to be solid. In addition, as Rob will discuss later, despite higher potato costs, we expect inflation will remain modest as a result of lower-than-anticipated production and logistics costs.\nIn Europe, the effect of the historically poor potato crop on the operating environment is playing out largely as we expected. The short crop has resulted in sharply higher potato costs for Lamb Weston/Meijer joint venture and for the industry, and that will persist through fiscal 2019 and the first half of fiscal 2020. While the effect of these higher potato costs was pronounced in Lamb Weston/Meijer's third quarter results, they were in line with our expectations. We continue to anticipate that higher prices and cost savings initiatives should steadily begin to offset the effect of higher potato costs over the next couple of quarters.\nIn addition, our teams in Europe and the US will continue to work closely to leverage our global capabilities to serve existing customers affected by the short crop, as well as to evaluate and support potential opportunities as they arise over the coming months. So as you can see, we delivered another quarter of solid results by focusing on our strategies, executing well across the organization and working through some near-term challenges. We feel good about our performance and the operating momentum we built, and it has enabled us to once again raise our financial targets.\nNow let me turn the call over to Rob to provide the details on our results and our updated outlook.\nRobert McNutt -- Senior Vice President and Chief Financial Officer\nThanks, Tom. Good morning, everyone. As Tom noted, we're pleased with our results for the quarter, as solid results in our base business more than offset softness in Europe. Specifically in the quarter, net sales increased 7% to $927 million, driven by a good balance of favorable volume and price mix. Volume increased 4%, led by growth in our Global segment. Price mix was up 3%, due to both pricing actions and improved mix. Some of our growth reflects the impact of a new accounting standard that we adopted at the beginning of this fiscal year. Specifically, the new standard effects when we recognize sales of customized products, which we define as products that we manufacture using a customer's unique recipe, such as a McDonald's french fry or a limited time offering product that's made for a single customer.\nUnder the new standard, we recognize revenue for customized products at the time we have a legally enforceable right payment, which is once we've manufactured the product and have received a customer purchase order. Since sales of customized products are generally recurring, there hasn't been much of an impact on a quarter-to-quarter basis, however, in the third quarter, we received a higher number of purchase orders for customized products. In short, the effect of the new standard is all timing, which may create incremental quarter-to-quarter volatility.\nGross profit increased $31 million, or 13% to $273 million. Overall higher prices, favorable mix from increased LTO activity, volume growth and supply chain efficiency savings drove the increase more than offsetting the impact of relatively modest material input, manufacturing and transportation cost inflation. The increase in gross profit also reflects a $4 million gain in unrealized mark-to-market adjustments related to hedging contracts. This compares to a $1.3 million loss in the prior year period. Our gross margin percentage expanded 140 basis points to more than 29%, excluding the mark-to-market adjustments, gross margin expanded by 90 basis points.\nAs you may recall, when we updated guidance after the second quarter, we indicated that there could be some pressure on gross margin percentage in the back half of this fiscal year due in part to accelerating cost inflation coupled with more modest pricing. However, despite low to mid single digit increase in raw potato costs, overall cost inflation was lower than we had anticipated in the third quarter. This was a result of very strong execution by our supply chain teams coupled with prices of some key inputs breaking our way. Specifically, we capitalized on contract structures for edible oils, that allowed us to enjoy the benefits of falling prices during the quarter, while limiting exposure to price increases. As oil prices dropped during the quarter, we'd realize the benefit, including the unrealized mark-to-market impact contracts that will settle in future period. We mitigated transportation cost inflation in part by implementing new software tools that helped us more efficiently optimize the mix between rail and trucking. And we continue to leverage our Lamb Weston operating culture to drive efficiencies at our manufacturing facilities. As a result of these supply chain initiatives, we expect cost inflation will remain relatively modest in the fourth quarter.\nSG&A expense excluding items impacting comparability increased about $8 million to $80 million. The increase in SG&A was due to investments in our sales, marketing, operating and information technology capabilities to support growth and drive operating efficiencies. In addition advertising and promotional expense was up about $1 million. IT cost continue to build in the third quarter and we expect them to rise further in the fourth quarter and into fiscal 2020 as we build and implement a new ERP system. Adjusted operating income increased $23 million, or 13% to $194 million. As I've just outlined, this was driven by strong sales and gross profit growth.\nEquity method investment earnings from our unconsolidated joint ventures, which include Lamb Weston/Meijer in Europe and Lamb Weston/RDO in Minnesota were $14 million, excluding mark-to-market adjustments related to hedging contracts, equity earnings were down about $9 million, largely due to higher raw potato costs and lower sales volumes in Europe associated with the poor crop. So putting it all together, adjusted EBITDA, including the proportional EBITDA from our two unconsolidated joint ventures, increased $16 million, or 7% to $253 million. Simply put about $26 million of our EBITDA growth was driven by operating gains in our base business, plus another $4 million from the acquisition of the remaining interest in our Lamb Weston/BSW joint venture. This was partially offset by a $14 million decline in EBITDA from an unconsolidated joint ventures.\nMoving down the income statement, interest expense was about $27 million, which is a decline of more than $1 million due to lower average total debt. Our effective tax rate, excluding the impact of comparability items was about 22%, up from about 19% last year. As you may recall, our relatively low tax rate in Q3 last year was related to the timing of implementing US tax reform.\nTurning to earnings per share, adjusted diluted EPS was up $0.04 to $0.95. The increase was driven by operating gains in our base business, which included a $0.02 benefit related to additional sales of customized products under the new revenue standard partially offset by lower equity earnings and higher taxes.\nNow let's review the results for each of our business segments. Sales for our Global segment, which includes top 100 US-based chains, as well as all sales outside of North America were up 11%. Price mix rose 2%, primarily reflecting pricing adjustments associated with multi-year contracts. Volume grew 9% with about 4 points related to the additional sales of customized products under the new revenue standard. As Tom mentioned, we delivered the remaining 5 points of volume growth by driving increased sales of limited time product offerings in both Asia and the US. Sales to new chain restaurant customers and increased sales to strategic customers in the US and key international markets, including to customers affected by the short crop in Europe. We're very pleased with Global's high quality volume growth in the quarter, especially as we lapped the 6% volume growth that we delivered in the prior year.\nGlobal's product contribution margin, which is gross profit plus advertising and promotional expense increased $15 million, or 13%. Its product -- its contribution margin percentage expanded by 50 basis points. Favorable price mix, volume growth, including the benefit of additional sales of customized products under the new revenue standard as well as supply chain efficiency savings drove the increase which was partially offset by modest cost inflation.\nSales for our Foodservice segment, which services North American food distributors and restaurant chains outside the top 100 North American restaurant customers, increased 5%. Price mix increased 4%, reflecting the benefit of pricing actions initiated in fall 2018, as well as improved mix. Volume increased 1%, led by growth of Lamb Weston branded products. Foodservices product contribution margin increased $5 million, or 6% and contribution margin percentage expanded by 40 basis points. The increases were driven by favorable price mix and supply chain efficiency savings and were partially offset by modest cost inflation.\nSales in our Retail segment fell 1%. Price mix increased 1%, largely due to improved mix. As expected volume declined 2% as we lapped the 22% volume growth that we delivered in the third quarter of fiscal 2018. As you may recall, Q3 last year benefited from the timing of private label product shipments from the second quarter, as well as distribution gains of Grown in Idaho and other branded products. In the current quarter, we continue to improve mix by driving mid-teens growth in our branded products led by Grown in Idaho. Retails product contribution margin declined $1 million, or 4% as input, manufacturing, transportation cost inflation, along with lower volumes and modestly higher advertising promotional expense more than offset favorable price mix. As a result, product contribution margin percentage fell 70 basis points.\nMoving to our balance sheet and cash flow, our total debt at the end of the quarter was about $2.5 billion. This puts our net debt-to-adjusted EBITDA ratio at 3 times. We continue to target a leverage ratio of 3.5 times to 4 times and remain comfortable being below that range as we continue to explore potential acquisition opportunities. With respect to cash flow, in the first nine months cash from operations, which was driven by the strong earnings growth, that's up from $310 million during the first nine months of fiscal 2018. Our priorities in deploying that cash remain the same. Our top priority is to continue to invest in our business, and we spent about $245 million so far this year on capital expenditures, including the construction of our new fry line in Hermiston, Oregon. As Tom mentioned, the Hermiston line is on track to be operational in May.\nAnother top priority is acquisitions. This year, we've expanded our global footprint with the acquisition of Marvel Packers for about US$89 million and completed the purchase of the remaining interest in Lamb Weston/BSW for $78 million. Finally, we're returning cash to shareholders, including paying over $84 million in dividends in the first nine months and repurchasing nearly 110,000 shares for about $8 million.\nTurning to our updated fiscal 2019 outlook. We're confident in our ability to continue our good operating momentum as we close out the year. As a result, we've raised our sales and earnings outlook for fiscal 2019. After posting strong results in the third quarter, we now expect sales to grow at high single-digit rate, up from our previous estimate of mid to high single-digits. This implies mid to high single-digit sales growth in the fourth quarter.\nFor earnings, we've raised our target for adjusted EBITDA, including unconsolidated joint ventures to a range of $895 million to $905 million, up from a range of $870 million to $880 million. Versus last year, that's an increase of about $80 million, or nearly 10% at the midpoint of the new range. Sales and gross profit growth are driving the increase. For the full year, we're still targeting gross profit growing, at least in line with sales, with favorable price mix and productivity more than offsetting higher transportation, input and manufacturing cost inflation, as well as higher depreciation expense.\nPreviously, we anticipated that gross profit growth may lag sales growth in the second half of the year due to increased inflation and the potential for unfavorable mix. However, as I described earlier, the impact of input and transportation inflation has been lighter than expected, and our manufacturing facilities have been performing well. This, along with solid top line growth, enable us to grow to drive strong gross margin expansion in the third quarter. For the fourth quarter, we expect inflation to remain relatively modest in our manufacturing facilities to continue to deliver operating efficiencies. As a result, we expect gross profit growth will likely be at least in line with sales growth even after absorbing around $3 million of start-up costs associated with our Hermiston production line.\nRegarding SG&A in the fourth quarter, we anticipate investments in our sales, marketing, innovation, operations and IT capabilities will continue to build, especially as we begin to step up spending behind our ERP system. As we previously noted, we expect spending behind these investments will continue to be elevated for a couple of years. We continue to target total SG&A, excluding advertising and promotional expense, to return to a range of 8% to 8.5% of sales over the long-term.\nFor equity earnings, as Tom mentioned, the effect of the short crop in Europe is playing out largely as we had anticipated. In the fourth quarter, we expect equity earnings will decline versus a prior year, largely due to higher potato costs and lower sales volumes. So looking at our updated outlook at a high level, we're targeting high single-digit sales growth for the full year. In the fourth quarter, we expect to drive mid to high single-digit sales growth with a good overall balance of volume growth and improved price mix.\nFor earnings, we expect to deliver adjusted EBITDA, including unconsolidated joint ventures of $895 million to $905 million for the year. In fourth quarter, sales and gross profit growth in our base business will drive the increase and will be tempered by higher investments in SG&A and softer results in Europe. We also expect to have about a $4 million benefit from the acquisition of the other half of our BSW joint venture.\nWe also made changes to a couple of our other financial targets. For taxes, we now expect an effective tax rate for the full year of 22% to 23%. That's down from our previous estimate of 23%. For the fourth quarter, we continue to anticipate it will be about 24%. For capital expenditures, we're now targeting it to be around $350 million, down slightly from our previous estimate of about $360 million. Our other financial targets for the full year remain the same, including total interest expense of around $110 million, total depreciation and amortization spend -- expense of approximately $150 million.\nLet me turn the call back over to Tom for closing comments.\nTom Werner -- President and Chief Executive Officer\nThanks, Rob. Let me quickly sum up by saying we're pleased with our results in the quarter and are confident that we'll finish the year on a strong note. We're executing well across the organization and have built good operating momentum in each of our core segments. We remain laser-focused on executing on our strategies of investing to support long-term growth and create value for all our stakeholders.\nI want to thank you for your interest in Lamb Weston, and we're now happy to take your questions.\nQuestions and Answers: Operator\nThank you. (Operator Instructions) And we'll go first to Bryan Spillane with Bank of America.\nBryan Spillane -- Bank of America -- Analyst\nHey, good morning, everybody.\nTom Werner -- President and Chief Executive Officer\nGood morning, Bryan.\nRobert McNutt -- Senior Vice President and Chief Financial Officer\nGood morning, Bryan.\nBryan Spillane -- Bank of America -- Analyst\nJust two questions for me. I guess, first, as we're kind of looking at the situation in Europe and thinking about it, I guess, for 2020, can you elaborate a little bit more on just how you see sort of the potential kind of crop conditions or plantings? Are there enough seed potatoes? Is there anything else that might sort of drag this supply issue into 2020? And then also, if you could talk a little bit about the opportunity to fill some of the supply gaps in Europe out of North America, how that's progressed?\nTom Werner -- President and Chief Executive Officer\nBryan, it's Tom. In terms of seed, potato seed and crop and planting, all the -- those kind of things, it's no concern about seed. I would say, -- excuse me, we're early in the planting, so we feel good about our growers and how that's progressing. And as I do every year, further down the year, we'll give an update on how the crop is progressing, not only in Europe, but across North America. I think the -- to your other question, in terms of how this is going to play out, it's going to pressure the business as we've stated. Obviously, we've seen the results in Q3. We expected -- they're in line with our expectations. It's going to continue in Q4 and through the first half, but will progressively improve based on cost initiatives and pricing that will start flowing through the P&L, but it's definitely going to be impactful through the first half of 2020, as we've stated. And the last part to your question, we've got ourselves positioned with our book of business between Europe and US, supporting some of the European customers out of our US operations. And right now, I've stated I think there's going to be some opportunities, and it's still early, and this still have to play out. I believe we may get some opportunities. But right now, we've had nothing material that's been brought to our attention.\nBryan Spillane -- Bank of America -- Analyst\nOkay. Thanks for that. And then just as a follow-up. One of the questions we've got a lot in the last few weeks has been just concerned with the capacity coming into North America that it is maybe got to put some pressure on prices and potentially margins. So I guess as you've kind of looking at the landscape, as it sits right now, is that something that, that you're concerned about at this point, or, has anything really changed in terms of the environment?\nTom Werner -- President and Chief Executive Officer\nAs of right now, there's been some capacity come on that has not materially impacted our business. We are obviously monitoring it. We've got capacity coming on in May. And a part of this too, again it's going to normalize run rates back to a more sustainable level. And I suspect, this fall, we may have pressure in pockets, but we're going to continue to execute pricing discipline in the market and let things play out. But I think it will be immaterially impactful in the near term.\nBryan Spillane -- Bank of America -- Analyst\nOkay, great. Thank you.\nOperator\nWe'll go next to Chris Growe with Stifel.\nChristopher Growe -- Stifel, Nicolaus & Company -- Analyst\nHi, good morning.\nTom Werner -- President and Chief Executive Officer\nChris...\nRobert McNutt -- Senior Vice President and Chief Financial Officer\nGood morning, Chris.\nTom Werner -- President and Chief Executive Officer\nGood morning, Chris.\nChristopher Growe -- Stifel, Nicolaus & Company -- Analyst\nHi, good morning. I just had a question for you. I want to better understand the limited-time offering performance in the quarter and the mix effect. It sounds like that was positive year-over-year against successfully tough comparisons. I wanted just to understand kind of how that played out and what the event to your -- to mix, maybe just to a degree to margins. And then can that continue in the fourth quarter? Are you seeing a continuation of the strong LTO performance? Do you think it will continue into Q4?\nTom Werner -- President and Chief Executive Officer\nWe had several -- Chris, this is Tom. We had several LTOs that were planned in the quarter. And as we always do, we take a conservative view of how those are going to perform. Had a couple of domestically and international LTO that, that exceeded our expectations. We will get into how things are shaping up in the next quarter. But again, the LTOs performed better than we expected. And every year, we're going to have LTOs in our business periodically. So -- and we always take a conservative view.\nChristopher Growe -- Stifel, Nicolaus & Company -- Analyst\nOkay. And then just a question for you on the gross margin, somewhat following on that question, I guess. The gross margin was a little stronger than I expected in the quarter. You had a favorable mix performance as well. You indicated that you expect it to be about -- or at least in line with sales for the year -- I'm sorry, sales growth for the year. But given the performance to date, is there anything unique to the fourth quarter we should be aware of or anything that could be pressuring the gross margin in the fourth quarter that could keep the expectation for the year down a bit?\nRobert McNutt -- Senior Vice President and Chief Financial Officer\nChris, it's Rob. Typically, as that fourth quarter, the raw costs tend to be higher than in the third quarter. Third quarter tends to be our most attractive, just because of storage costs and the aging of the raws. But beyond that normal seasonality, we don't see anything in the fourth quarter that's going to pressure margins.\nChristopher Growe -- Stifel, Nicolaus & Company -- Analyst\nOkay. Thank you for the time.\nDexter Congbalay -- Vice President, Investor Relations\nHey, Chris, I mean, we have said we're going to have about $3 million as start-up costs related to Hermiston in our prepared remarks, so something else just to remember.\nChristopher Growe -- Stifel, Nicolaus & Company -- Analyst\nOkay. That's helpful. Thank you, Dexter.\nOperator\nWe'll go next to Adam Samuelson with Goldman Sachs.\nAdam Samuelson -- Goldman Sachs -- Analyst\nYes, thanks. Good morning, everyone.\nTom Werner -- President and Chief Executive Officer\nGood morning, Adam.\nAdam Samuelson -- Goldman Sachs -- Analyst\nI was hoping to go back, Tom, to something that you said in response to Bryan's question on the impact of capacity, and you kind of -- your word was pockets of pressure. And just maybe elaborate on where and how that would really manifest itself based on kind of your historical experience in the industry when you've had bigger incremental capacity come on, just category customer type? Is it something that you would actually see with your bigger global customers, especially as we look to 2020 -- calendar 2020 when you've got a bigger part of that business up for renewal?\nTom Werner -- President and Chief Executive Officer\nSure, Adam. The -- a couple of things to the -- to your question is as the category we -- it is -- we expect the category to have a 1.5% to 2.5% growth, so there's always going to be an organic component that's going to need capacity support. That's first thing. The second thing, that we'll have to monitor closely is some of the contracts that are coming up for renewal with a few bigger customers. And that's where we may see some pressure on pricing, but we'll deal with that as those contracts come up for bid.\nAdam Samuelson -- Goldman Sachs -- Analyst\nOkay. And then just on the performance kind of in the quarter and just try to think about the implications. I mean, do you think that -- has your view of market growth changed in a material way? I mean, I think we've kind of always been operating under the assumption this is a kind of 2%, 2.5% growth business from the North American industry? Do you think that did the market has been kind of meaningfully outperforming that? And if so, is that just new use occasions and different channels? Just elaborate on that, the Crispy on Delivery just being more incremental to demand than you might have thought potentially?\nTom Werner -- President and Chief Executive Officer\nYeah, right now, I don't have a different point of view on the overall category growth based on all of the data and how we analyze, not only North America, but international markets in total. So, I would say, the 1.5%, 2.5%, we feel pretty good about over the long-term. That's where it's going to shake out at. And some of the incremental, Crispy on Delivery, for example, that's really -- I don't view it as a new occasion, but that's meeting an occasion with a better quality fry that travels better. And that's how I view that product.\nAdam Samuelson -- Goldman Sachs -- Analyst\nOkay. And then just lastly, just quickly. It seems like the potato crop in the Pacific Northwest, the planting might have gotten started a little bit later than normal. Is that something that would materially impact you as you move into kind of the August through October time frame or not enough deviation from history to matter?\nTom Werner -- President and Chief Executive Officer\nNo, Adam. It's -- you know, right now, the plant, the crop is two weeks late planting in the Pacific Northwest. We had a point of view that 30 days, 45 days ago, and took actions to ensure that we were balance on our raw. And again, it's early planning. I've been around this business a long time to know that at times we always tend to catch up, but we got to let it play out. And we'll provide more context on crop in a couple of calls as we always do.\nAdam Samuelson -- Goldman Sachs -- Analyst\nOkay. Really appreciate the color. I'll pass it on. Thanks.\nOperator\nAnd we'll go next to David Mandel with Consumer Edge Research.\nDavid Mandel -- Consumer Edge Research -- Analyst\nHey, guys. Thanks for taking my question.\nTom Werner -- President and Chief Executive Officer\nHi.\nDavid Mandel -- Consumer Edge Research -- Analyst\nFirst, how would you rate the state of your plants given the high utilization rates? Will they get the necessary arrest with the oncoming capacity, or does the year of shortage preclude that? How should we think about that?\nRobert McNutt -- Senior Vice President and Chief Financial Officer\nYeah. This is Rob, David. The -- as you recall, we started up a new line in Richland here in the last year or so, and that's allowed us to take capacity to more normalized levels in our plants, and so we are able to get caught up on the maintenance that we may have deferred over the prior few years. And then we'll have the new line coming on in Hermiston, which will give us further capacity to help support the continued growth in the business.\nDavid Mandel -- Consumer Edge Research -- Analyst\nThat's great. Thanks. And my last question, we've covered a lot of ground, so I just want to ask a higher-level question. The faster-growing markets, I assume that they're not all created equally. You have China, Mexico, Middle East, Russia. I assume some processing plants might be turnkey and some might be fixer-uppers. How can I think about that in terms of those four markets?\nTom Werner -- President and Chief Executive Officer\nWell, I think, that's exactly right that the growth rates aren't all created equal. And you also have to think through the overall market size. So some of those markets are -- I'll give you directional 500 million pounds, 600 million pounds, some of over 1 billion pounds, which is very different than North America and Europe, so they're not all created equal. In terms of your second question, capacity is not all created equal as well. So as you look at capacity in China, those plants have different capabilities versus our plan, not only in China, but in North America. So you are right, they are not all created equal.\nDavid Mandel -- Consumer Edge Research -- Analyst\nGreat. Thank you very much.\nOperator\nAnd we'll go next to Carla Casella with JP Morgan.\nSarah Manzone -- JP Morgan -- Analyst\nHey, guys. This is Sarah on for Carla. We just want an update on your capital allocation priorities in regards to shareholder activities versus delevering and then also maybe an update on your M&A?\nTom Werner -- President and Chief Executive Officer\nOkay, Sarah. It's Tom. Very consistent on our capital allocation. We're going to continue to invest in our business as we have in the past and this year well in the future to drive growth. We're going to support a dividend. We've implemented a share repurchase, which we've been active in the market recently. So we're committed to -- as we've been very consistent, since the spin, that's our capital allocation strategy. In terms of M&A, that's part of the strategy as well. I can't get into specifics about where we're at and what we actually have going on, but we are committed to pursue M&A, targeted M&A where it makes sense for us.\nSarah Manzone -- JP Morgan -- Analyst\nOkay, great. Thanks.\nOperator\nAnd there are no further questions in queue.\nDexter Congbalay -- Vice President, Investor Relations\nThanks, everyone, for joining the call. I'll be available for any follow-up questions, either via phone or via email, and look forward to speak with you later. Thank you.\nOperator\nAnd that concludes today's conference. Thank you for your participation. You may now disconnect.\nDuration: 39 minutes\nCall participants: Dexter Congbalay -- Vice President, Investor Relations\nTom Werner -- President and Chief Executive Officer\nRobert McNutt -- Senior Vice President and Chief Financial Officer\nBryan Spillane -- Bank of America -- Analyst\nChristopher Growe -- Stifel, Nicolaus & Company -- Analyst\nAdam Samuelson -- Goldman Sachs -- Analyst\nDavid Mandel -- Consumer Edge Research -- Analyst\nSarah Manzone -- JP Morgan -- Analyst\nMore LW analysis\nTranscript powered by AlphaStreet\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://www.alphastreet.com"], "entities": {"persons": [{"name": "dexter congbalay", "sentiment": "none"}], "organizations": [{"name": "lamb weston holdings, inc.", "sentiment": "neutral"}, {"name": "sec", "sentiment": "none"}, {"name": "lamb weston", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T01:03:14.002+03:00"}, {"thread": {"uuid": "2bf5ebcfb7a9b6f4cab48c2547d2458d003c67c8", "url": "https://www.kitco.com/news/2019-04-02/Apple-luxury-brands-drop-prices-in-China-on-VAT-cut.html", "site_full": "www.kitco.com", "site": "kitco.com", "site_section": "", "site_categories": ["investing", "finance"], "section_title": "", "title": "Apple, luxury brands drop prices in China on VAT cut | Kitco News", "title_full": "Apple, luxury brands drop prices in China on VAT cut | Kitco News", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "http://www.kitco.com/images/kitco-news-social-share-logo.jpg", "performance_score": 0, "domain_rank": 7841, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "2bf5ebcfb7a9b6f4cab48c2547d2458d003c67c8", "url": "https://www.kitco.com/news/2019-04-02/Apple-luxury-brands-drop-prices-in-China-on-VAT-cut.html", "ord_in_thread": 0, "author": "Http", "published": "2019-04-02T03:00:00.000+03:00", "title": "Apple, luxury brands drop prices in China on VAT cut | Kitco News", "text": "Apple, luxury brands drop prices in China on VAT cut Reuters Tuesday April 02, 2019 13:04\nKitco News\nShare this article:\nBEIJING (Reuters) - Apple and luxury labels such as Gucci have lowered their prices in China after a cut in its value-added tax (VAT) rate came into effect from April 1.\nBeijing said last month that it would cut taxes and fees for all companies by nearly 2 trillion yuan in 2019, with the manufacturing, transportation and construction sectors set to benefit as it looks to stimulate a slowing economy.\nPrice tags for products listed on Apple’s China website were lowered on Monday, including a discount of up to 500 yuan ($74.44) for some of its latest iPhone models.\nApple declined to comment on its prices.\nBut French luxury goods group Kering said on Tuesday that its Italian Gucci brand had cut prices by 3 percent, while a spokeswoman for LVMH’s Louis Vuitton confirmed its China business had adjusted prices on Friday.\nLouis Vuitton was “fully supportive of the Chinese government’s ongoing efforts to narrow the price gap between China and overseas,” she said.\nBirkin-bag maker Hermes also said it had passed on the VAT cuts to customers in China, with price drops of 3 percent from the beginning of April.\nLuxury brands have in recent years gradually narrowed the price gap between Europe and China - where their wares could often be 50 percent more expensive - including following a cut in import taxes brought in by the Chinese government last year.\nThe latest price moves follow carmakers BMW and Daimler’s Mercedes-Benz which both said last month that prices for several car models would drop following the Chinese tax changes.\nSeveral Chinese electronics retailers lowered prices for iPhones in January, discounting latest models by up to $118, after weaker-than-expected sales at end-2018.\nThe world’s second-largest economy is growing at its weakest pace in almost three decades amid lower domestic demand and a trade war with the United States.\nHigh-end fashion and handbag brands are increasingly looking to woo Chinese clients on their home turf, even though most of the spending by these consumers still takes place in the shopping capitals like Paris, Milan or Hong Kong.\n“Long term, luxury consumption will happen incrementally at home,” analysts at HSBC said in a note on Tuesday. “A few years ago, 75 percent of Chinese luxury sales happened outside of China. We see that moving to 50-50 either this year or next.”\nReporting by Cate Cadell; Additional reporting by Sarah White in Paris, Editing by Himani Sarkar and Muralikumar Anantharaman Disclaimer: The views expressed in this article are those of the author and may not reflect those of Kitco Metals Inc. The author has made every effort to ensure accuracy of information provided; however, neither Kitco Metals Inc. nor the author can guarantee such accuracy. This article is strictly for informational purposes only. It is not a solicitation to make any exchange in commodities, securities or other financial instruments. Kitco Metals Inc. and the author of this article do not accept culpability for losses and/ or damages arising from the use of this publication. Latest Articles ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "louis vuitton", "sentiment": "none"}], "organizations": [{"name": "kitco news apple", "sentiment": "negative"}, {"name": "apple", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "gucci", "sentiment": "none"}, {"name": "lvmh", "sentiment": "none"}, {"name": "louis vuitton", "sentiment": "none"}, {"name": "kering", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T01:06:35.012+03:00"}, {"thread": {"uuid": "a94c2e51eae0b63705d14c69f6dc1404ee9a470e", "url": "https://www.fool.com/investing/2019/04/02/apple-earnings-mark-your-calendar.aspx", "site_full": "www.fool.com", "site": "fool.com", "site_section": "", "site_categories": ["investing", "finance"], "section_title": "", "title": "Apple Earnings: Mark Your Calendar -- The Motley Fool", "title_full": "Apple Earnings: Mark Your Calendar -- The Motley Fool", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://g.foolcdn.com/editorial/images/517959/apple-earnings.jpg", "performance_score": 0, "domain_rank": 1336, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "a94c2e51eae0b63705d14c69f6dc1404ee9a470e", "url": "https://www.fool.com/investing/2019/04/02/apple-earnings-mark-your-calendar.aspx", "ord_in_thread": 0, "author": "Daniel Sparks", "published": "2019-04-02T03:00:00.000+03:00", "title": "Apple Earnings: Mark Your Calendar -- The Motley Fool", "text": "Apple Earnings: Mark Your Calendar The company's iPhone and services results, and its total revenue will all come into focus. Daniel Sparks ( TMFDanielSparks ) Apr 2, 2019 at 5:01PM\nInvestors will get a timely update on Apple ( NASDAQ:AAPL ) later this month. The company just scheduled a date for its fiscal second-quarter report: April 30. The update will not only reveal whether Apple's iPhone business continues to struggle to live up to last year's tough comparisons, but will also provide an important view into the tech giant's invigorated effort to bulk up its services business.\nHere's an overview of some of the key areas investors will want to watch when Apple reports its fiscal second-quarter earnings. Apple CEO Tim Cook. Image source: Apple. Total revenue\nThe Street will undoubtedly be watching Apple's top-line growth closely. CEO Tim Cook shocked investors earlier this year when he said the company would miss its initial revenue guidance for its fiscal first quarter by a whopping $7 billion . The news sent shares tumbling. When Apple announces its fiscal second-quarter results, therefore, it will need to report revenue within its guidance range for the period in order to regain investor confidence in its guidance methodology.\nAnd considering that Apple's revenue fell 5% year over year in fiscal Q1, investors will likely be looking for signs that the company can make progress on mitigating its declining revenue\nUnfortunately, any sign of improving revenue likely won't come from Apple's fiscal second quarter, as management guided for revenue between $55 billion and $59 billion during the period. The midpoint of this guidance range represents a 7% year-over-year decline. But this doesn't mean investors shouldn't look for a sign of improving top-line trends; management's fiscal third-quarter revenue guidance will hopefully call for a narrower year-over-year decline. iPhone revenue\nApple's iPhone revenue will obviously be a hot topic for fiscal Q2. It fell 15% year over year in Q1 -- a stark contrast from the 29% iPhone revenue growth in the prior quarter.\nIf you combine management's guidance for total revenue to fall 7% year over year in fiscal Q2 with the fact that the iPhone accounts for over half of Apple's total revenue, it means that management almost certainly anticipated another meaningful decline in iPhone revenue during the quarter. Indeed, this segment likely saw another double-digit year-over-year decrease. The big question, therefore, is whether the decline was even worse in fiscal Q2 than it was in fiscal Q1. Services revenue\nFinally, investors will want to check on Apple's services business , which represents the company's second-largest segment. The iPhone's recent troubles have prompted management to double-down on efforts to diversify beyond smartphones. Indeed, just last week it announced four new services to bolster the segment.\nServices revenue has been rising sharply, up 27% year over year in calendar 2018. Without a reason to expect a slowdown, investors should look for similarly strong growth from the segment in fiscal Q2.\nApple will report its fiscal second-quarter results after market close on Tuesday, April 30. Author", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "tim cook", "sentiment": "none"}, {"name": "daniel sparks", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T01:07:03.001+03:00"}, {"thread": {"uuid": "9764f4f2780744aeae1d2ec20a3f9f563d256530", "url": "https://kprcradio.iheart.com/featured/geek-therapy-radio/content/2019-04-02-apple-airpower-cancelled-heres-why-thats-good/", "site_full": "kprcradio.iheart.com", "site": "iheart.com", "site_section": "", "site_categories": ["media", "non_standard_content"], "section_title": "", "title": "Apple AirPower Cancelled. Here's why that's GOOD! | Geek Therapy Radio | KPRC AM 950", "title_full": "Apple AirPower Cancelled. Here's why that's GOOD! | Geek Therapy Radio | KPRC AM 950", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://i.ytimg.com/vi/V_kdcO3O4YA/hqdefault.jpg", "performance_score": 0, "domain_rank": 1524, "social": {"facebook": {"likes": 7, "comments": 2, "shares": 3}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "9764f4f2780744aeae1d2ec20a3f9f563d256530", "url": "https://kprcradio.iheart.com/featured/geek-therapy-radio/content/2019-04-02-apple-airpower-cancelled-heres-why-thats-good/", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "Apple AirPower Cancelled. Here's why that's GOOD! | Geek Therapy Radio | KPRC AM 950", "text": "Apple AirPower Cancelled. Here's why that's GOOD! Apr 2, 2019 Geek Therapy Radio Geek Therapy airs 12a Sundays on KPRC 950AM in Houston, TX and globally on the iHeartRadio app. Grab the podcast on iHeartRadio! Social ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "kprc", "sentiment": "negative"}, {"name": "geek therapy radio", "sentiment": "negative"}, {"name": "geek therapy radio geek therapy", "sentiment": "negative"}], "locations": [{"name": "tx", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T01:08:39.010+03:00"}, {"thread": {"uuid": "22f9fa61d0825f2b80a2879317a4cd08340b1591", "url": "http://feedproxy.google.com/~r/techcrunch/iphone/~3/RNJO5UQJc30/", "site_full": "feedproxy.google.com", "site": "google.com", "site_section": "", "site_categories": ["advertising", "business"], "section_title": "", "title": "iPhones get a price drop in China | Apple Byte Crunch", "title_full": "iPhones get a price drop in China | Apple Byte Crunch", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "DE", "spam_score": 1.0, "main_image": "https://i0.wp.com/applebytecrunch.com/wp-content/uploads/iphones-get-a-price-drop-in-china.jpg", "performance_score": 0, "domain_rank": 1, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "22f9fa61d0825f2b80a2879317a4cd08340b1591", "url": "http://feedproxy.google.com/~r/techcrunch/iphone/~3/RNJO5UQJc30/", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "iPhones get a price drop in China | Apple Byte Crunch", "text": "iPhones get a price drop in China By 0 Apple this week lowered the value on a quantity key strains in China, together with AirPods, Macs, iPads and, most notably, the iPhone. The transfer, famous by CNBC, is believed to be the direct outcomes of a three p.c tax minimize that took impact within the nation yesterday.\nIn many circumstances, nonetheless, the impacted merchandise have dropped by much more, together with a 500 yuan ($74) value minimize to the iPhone XS, marking a virtually 6 p.c drop for the corporate’s newest flagship.\nAlong with an adjustment for tax charges, the drop is probably going additionally due, partially, to a lagging demand for merchandise just like the iPhone on the earth’s largest smartphone market. Early this yr, Apple blamed decrease than anticipated earnings on weak demand for the iPhone in China.\nThe handset’s income dropped 15 p.c year-over-year in Q1, with China taking heart stage. Among the elements are slowed financial development within the nation and flagging world smartphone gross sales, as customers improve their gadgets much less continuously.\nApple can be dealing with elevated world competitors from Chinese producers like Huawei, which has rapidly been rising the gross sales ranks to be a high competitor alongside the iPhone and Samsung gadgets. ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T01:58:04.016+03:00"}, {"thread": {"uuid": "b62f20b24e173386b3205eae72e30e1c22f23feb", "url": "https://finance.yahoo.com/news/apple-shows-signs-weakness-canceling-194226501.html", "site_full": "finance.yahoo.com", "site": "yahoo.com", "site_section": "", "site_categories": ["investing", "financial_news", "finance"], "section_title": "", "title": "Apple Shows Signs of Weakness After Canceling AirPower Wireless Charger", "title_full": "Apple Shows Signs of Weakness After Canceling AirPower Wireless Charger", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://s.yimg.com/uu/api/res/1.2/jB6mpWf_hxZ2e4VA.Byw7w--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/2d8c2bdd3c9c522e5bec43109cb7292a", "performance_score": 0, "domain_rank": 5, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "b62f20b24e173386b3205eae72e30e1c22f23feb", "url": "https://finance.yahoo.com/news/apple-shows-signs-weakness-canceling-194226501.html", "ord_in_thread": 0, "author": "Brad Moon", "published": "2019-04-01T03:00:00.000+03:00", "title": "Apple Shows Signs of Weakness After Canceling AirPower Wireless Charger", "text": "Reblog On Friday afternoon, Apple (NASDAQ: AAPL ) did something unusual, but not entirely unexpected. The company officially canceled the AirPower. The company’s wireless charger was not a rumor — AAPL announced the product on stage at its 2017 iPhone event. However, after a year and a half of delays and quietly scrubbing AirPower references from its website, Apple threw in the towel. The company released a statement saying the wireless charge mat has been canceled, apologizing to the customers who have been waiting for it. Apple Shows Signs of Weakness After Canceling AirPower Wireless Charger More Source: Apple Given that wireless charging is a prominent feature of recent Apple products, including all new iPhones, the Apple Watch and the AirPods, the misstep is not only embarrassing, but it’s also leaving money on the table. Despite the bad PR, Apple stock actually saw a slight rise for Friday afternoon’s close. It’s Official: The Apple AirPower Is Dead On Friday afternoon, Apple sent an e-mailed statement to TechCrunch , finally conceding defeat on the AirPower wireless charger. InvestorPlace - Stock Market News, Stock Advice & Trading Tips “After much effort, we’ve concluded AirPower will not achieve our high standards and we have cancelled the project. We apologize to those customers who were looking forward to this launch. We continue to believe that the future is wireless and are committed to push the wireless experience forward.” That puts an end to the product that AAPL first announced at its 2017 iPhone event . What Was the AirPower and Why Was It Important? Apple has been moving its mobile products toward wireless charging capability, but it has been several years behind rivals like Samsung in supporting the technology in the iPhone. And while the Apple Watch charges wirelessly, it does so with proprietary magnetic induction technology — not the Qi standard that smartphones (including the iPhone) use. 10 Tech Stocks That Transformed Their Business With no wireless charger of its own, Apple was leaving money on the table with every iPhone sold. Customers who wanted to use the convenient feature had to buy a third-party charger. With Apple stock feeling the pressure from slowing iPhone revenue, these add-on sales become even more important. Apple decided to release its own wireless charger, but wanted its version to charge everything — iPhone, Apple Watch and AirPods. The company also wanted to set the bar high for ease of use, so products could be set anywhere on the mat (not in designated locations) and they would just start charging. Immediately after the announcement, the AirPower was featured on Apple’s website, but the delivery date soon changed to read “coming in 2018” and then “currently unavailable.” After the 2018 iPhone event, the AirPower disappeared from Apple’s website altogether, even as AAPL continued to promote the wireless charging capability of its devices. When the second-generation AirPods wireless earbuds were released several weeks ago, the retail box had a picture of the AirPower charging mat . An Embarrassing Debacle for AAPL Like any tech company, Apple has products it works on sometimes right up to the prototype stage and then abandons. That is expected. The difference with the AirPower is that the company actually announced the product (at its biggest event of the year), showed off pictures of it, put it on its website, kept people guessing for a year and a half and then cancelled it. Making the situation far worse is the fact that wireless chargers are mainstream. There are hundreds of them on the market. Samsung offers its own version for the Galaxy smartphones, and Alphabet’s (NASDAQ: GOOG , NASDAQ: GOOGL ) Google sells one for the Pixel. Third-party companies are in on the action as well. I recently reviewed a Nomad Base Station that will wirelessly charge an iPhone and AirPods, plus an Apple Watch simultaneously. It works flawlessly, although the Apple Watch charger is physically separate from the charge mat. Apple apparently ran into a wall by trying to be too ambitious. The company wanted the AirPower to charge multiple devices simultaneously when placed anywhere on its surface while displaying real-time charge levels of each on a iPhone. That approach reportedly resulted in overheating issues that Apple engineers were unable to overcome. 7 ETFs to Buy for Serious Diversification Unfortunately, the public perception is that Apple took a year and a half to try to make a wireless charger — a commodity product — and failed. And it made a big deal about a new product, then killed it. Add to that the fact that it has been trumpeting the wireless charging capability of its products, but has no wireless charger to go with them. The AirPower episode has eroded the public’s perception of Apple’s design prowess. However, of more immediate concern to AAPL investors is that the lack of a wireless charger means every time the company sells an iPhone or set of AirPods, customers who want the convenience will add a third-party wireless charger to their cart. That’s anywhere from $50 to $150 in potential revenue that could have gone toward helping Apple stock weather the iPhone sales decline. As of this writing, Brad Moon did not hold a position in any of the aforementioned securitie s. More From InvestorPlace ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "apple shows signs of weakness after canceling airpower wireless", "sentiment": "negative"}, {"name": "apple", "sentiment": "negative"}, {"name": "aapl", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T02:18:44.013+03:00"}, {"thread": {"uuid": "8e3a5f7b43986b3df558904f3396d29c12de9ee6", "url": "https://gulfnews.com/business/energy/saudi-aramcos-mega-2018-profits-eclipse-earnings-of-apple-firm-named-worlds-most-profitable-company-in-2018-1.1554099897786", "site_full": "gulfnews.com", "site": "gulfnews.com", "site_section": "https://gulfnews.com/sitemaps/business.xml", "site_categories": ["media", "car_culture", "vehicles"], "section_title": "", "title": "Saudi Aramco's mega 2018 profits eclipse earnings of Apple; firm named world's most profitable company in 2018", "title_full": "Saudi Aramco's mega 2018 profits eclipse earnings of Apple; firm named world's most profitable company in 2018", "published": "2019-04-01T09:17:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://images.gulfnews.com/201904/Saudi%20Aramco_resources1-medium.jpg", "performance_score": 0, "domain_rank": 5247, "social": {"facebook": {"likes": 64, "comments": 3, "shares": 12}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "8e3a5f7b43986b3df558904f3396d29c12de9ee6", "url": "https://gulfnews.com/business/energy/saudi-aramcos-mega-2018-profits-eclipse-earnings-of-apple-firm-named-worlds-most-profitable-company-in-2018-1.1554099897786", "ord_in_thread": 0, "author": "gulfnews.com", "published": "2019-04-01T09:17:00.000+03:00", "title": "Saudi Aramco's mega 2018 profits eclipse earnings of Apple; firm named world's most profitable company in 2018", "text": "The North Pier Terminal, operated by Saudi Aramco, in Ras Tanura, Saudi Arabia. The planned bond deal is Aramco’s inaugural transaction in international markets. Image Credit: Bloomberg Saudi Aramco was the world’s most profitable company in 2018, easily surpassing US behemoths including Apple Inc. and Exxon Mobil Corp., according to accounts published by ratings agencies before the firm’s debut in the international bond market.\nYet the Saudi kingdom’s influence on the state oil producer via high taxation is also denting its profitability and credit-worthiness, with cash generated per barrel below that of Big Oil companies such as Royal Dutch Shell Plc. That’s getting in the way of Aramco achieving a much higher credit rating.\nAramco generated net income of $111.1 billion in 2018, Moody’s Investor Service said Monday, after Fitch Ratings said the company had earnings before interest, tax and depreciation of $224 billion last year - significantly above figures for Apple and Exxon Mobil. Both agencies gave the Saudi company’s debt their fifth-highest investment grade level.\nThe group has 257 billion barrels of oil equivalent, representing over 50 years of reserves based on current production levels. - The credit ratings, a first for Aramco, offer a glimpse into the accounts of the company, which have remained secret since its nationalization in the late 1970s. The information will help investors assess the possible value of a once-in-a-generation deal for financial markets: the firm’s proposed initial public offering, originally targeted for 2018 but last year delayed until 2021.\nThe company is preparing to raise debt in part to pay for the acquisition of a majority stake in domestic petro-chemical group Sabic, worth about $69 billion. The deal is a Plan B to generate money for Saudi Arabia’s economic agenda after the IPO was postponed. In effect, Crown Prince Mohammed bin Salman is using the firm’s pristine balance sheet to finance his ambitions.\nHeavy burden Dependence on the company to finance social and military spending, as well as the lavish lifestyles of hundreds of princes, places a heavy burden on its cash flow. Aramco pays 50 percent of its profit on income tax, plus a sliding royalty scale that starts at 20 percent of the company’s revenue.\n$ 224 b Saudi Aramco’s core earnings last year Aramco reported cash flow from operations of $121 billion and $35.1 billion in capital spending, and paid $58.2 billion in dividends to the Saudi government in 2018, according to Moody’s. The company had $48.8 billion of cash relative to $27 billion of reported group debt at the end of last year, said the agency, which gave the firm an A1 rating.\nFitch said its A+ rating reflects the “strong links” between the company and the kingdom, and the influence the state has on Aramco through regulating the level of production, taxation and dividends.\n“Over time, a low oil price environment could cause a sustained fiscal deficit for Saudi Arabia that could result in changes down the line for Aramco’s fiscal regime,” said Neil Beveridge, an energy analyst with Sanford C. Bernstein & Co. in Hong Kong. “You can’t disassociate the sovereign government from Aramco given the very close relationship and the contribution Aramco makes to the overall funding for Saudi Arabia.”\nAramco reported funds flow from operations - a measure closely watched by investors and similar to cash flow from operations - of $26 per barrel equivalent of oil last year, according to Fitch. That’s below what Big Oil companies such as Shell and Total SA enjoy, at $38 and $31 per barrel, respectively.\n$ 86 b Saudi Aramco’s free cash flow at the end of 2018 “Funds from operations, which is operation cash flows before working capital changes, is the best measure to compare oil companies profitability, since Ebitda does not take into account taxation,” Dmitry Marinchenko, senior director at Fitch in London, said in an interview.\nUsing data provided by Fitch about the company’s total oil and gas production last year and the cash flow per barrel, Bloomberg estimates that Aramco reported total fund flow from operations of about $130 billion last year. Although that’s significantly higher than what Big Oil produces, the difference isn’t a large as the Ebitda. Shell, for example, reported cash flow of $53 billion. Exxon reported cash flow last year of $36 billion.\nFitch’s A+ rating for Aramco is one level below the AA- for both Shell and Total. The Moody’s rating is well behind Exxon’s top Aaa level.\nThe oil giant has mandated banks to hold a roadshow for dollar-denominated notes from April 1, potentially including tranches from three to 30 years, according to a person familiar with the matter. Fitch said that Aramco planned to pay for the 70 percent stake in Sabic “in installments over 2019-21.”\nThe company will hold meetings with investors in coming days in cities including London, New York, Boston, Singapore, Hong Kong, Tokyo, Los Angeles and Chicago. Aramco picked banks including JPMorgan Chase & Co. and Morgan Stanley to manage the debt offering.\nThe bond plan, credit rating and the publication of the first extracts of Aramco’s accounts are all part of the ambitions of Prince Mohammed, who controls most of the levers of power in the kingdom, wants to pursue an IPO as part of his ambitions to ready the country for the post-oil age. Yet his ambition to secure a $2 trillion valuation has faced push back from global investors, prompting a delay in the IPO.\nIf he achieves the target, the offering will raise a record $100 billion by selling a 5 percent stake, dwarfing the record $25 billion raised by Chinese internet retailer Alibaba Group Holding Ltd. in 2014.\n“Saudi Aramco has many characteristics of a Aaa-rated corporate, with minimal debt relative to cash flows, large scale of production, market leadership and access in Saudi Arabia to one of the world’s largest hydrocarbon reserves,” said Rehan Akbar of Moody’s. “The final rating is however constrained by the government of Saudi Arabia’s A1 rating because of the close interlinkages between the sovereign and the company.”\nMore From Energy Abu Dhabi's GDP hits Dh931 billion Russia short of Opec+ oil cuts target in March Energy minister said April would be first month this year Russia to reach full compliance\nADFD facilitates Dh16.5b worth of deals for UAE firms UAE companies have been partners in 20 ADFD projects world wide\nNPCC profit up 27% to Dh891m on back of higher revenue Abu Dhabi-based firm ramps up turnover by 7% to Dh5.3b in ‘highly competitive market’\n ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "saudi aramco", "sentiment": "negative"}, {"name": "moody’s investor service", "sentiment": "none"}, {"name": "exxon mobil corp.", "sentiment": "none"}, {"name": "aramco", "sentiment": "none"}, {"name": "exxon mobil", "sentiment": "none"}, {"name": "fitch ratings", "sentiment": "none"}, {"name": "apple inc.", "sentiment": "none"}, {"name": "bloomberg saudi aramco", "sentiment": "none"}, {"name": "royal dutch shell plc", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "ras tanura", "sentiment": "none"}, {"name": "us", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T02:19:26.020+03:00"}, {"thread": {"uuid": "5221bb3ec96ccb34c2fbb9c1d7de8d65c1dfc321", "url": "https://www.inc.com/scott-mautz/a-stanford-psychologist-says-feeling-like-youre-not-enough-rips-these-5-things-away-from-you.html", "site_full": "www.inc.com", "site": "inc.com", "site_section": "", "site_categories": ["media", "business_software", "business", "marketing"], "section_title": "", "title": "A Stanford Psychologist Says Feeling Like You're Not Enough Rips These 5 Things Away From You | Inc.com", "title_full": "A Stanford Psychologist Says Feeling Like You're Not Enough Rips These 5 Things Away From You | Inc.com", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://www.incimages.com/uploaded_files/image/970x450/not-enough-1046877342_387291.jpg", "performance_score": 1, "domain_rank": 1265, "social": {"facebook": {"likes": 264, "comments": 10, "shares": 165}, "gplus": {"shares": 0}, "pinterest": {"shares": 3}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "5221bb3ec96ccb34c2fbb9c1d7de8d65c1dfc321", "url": "https://www.inc.com/scott-mautz/a-stanford-psychologist-says-feeling-like-youre-not-enough-rips-these-5-things-away-from-you.html", "ord_in_thread": 0, "author": "Scott Mautzkeynote Speaker", "published": "2019-04-02T03:00:00.000+03:00", "title": "A Stanford Psychologist Says Feeling Like You're Not Enough Rips These 5 Things Away From You | Inc.com", "text": "Health Happiness\nThat's a brutal, truthful list--so I say enough with not feeling like enough. I've blended O'Reilly's wisdom with my years of experience and research to give you a six-step \"power plan\" for taking back your power and elevating your self-worth: 1. Assign yourself a baseline of inherent value.\nMany start at the bottom, assuming they're fairly worthless, which creates tremendous headwinds for self-belief. Instead, O'Reilly encourages us to start by realizing that we're inherently valuable. Period.\nThere's no, \"I'll feel better about myself if I get to the next thing.\" It's a non-negotiable baseline value you set for yourself.\nThen, don't let your self-perceived worth ever, ever , dip below that baseline threshold. Even a nemesis who constantly belittles you shouldn't make your self-worth drop below the baseline.\nBut how can you take it to heart while dealing with self-belief bullies? Remember this: Those who defy your worth don't define you. 2. Live by the 90/10 rule.\nI've been sharing this with audiences, readers , and coachees for years. It's a simple formula for how to calculate your self-worth: 90 percent from your self-acceptance and self-appreciation, and only 10 percent from others (assigned worth).\nIt's unrealistic to not have at least some slice of worth come from the external validation of others. That's human nature. We get into trouble when the 10 percent migrates up and the 90 percent derails down.\nTo help you hold true to the 90/10 rule, strive for authenticity, not approval. Choose joy over judgment and appreciation over expectations. If someone tells you you're not meeting their standards in the face of these choices, ask yourself if they even get a vote. 3. Stop waging \"worth wars.\"\nEven with how much research I've done on this topic, and the fact that I help others to stop doing this, I still catch myself comparing to others. It's such an easy trap. The truth? The only comparison that matters is to who you were yesterday.\nEasier said than done, I know. O'Reilly reminds us that the work of bolstering one's self-worth is a process, what she calls \"lifespan work.\" 4. Know that it's the small moments (not the big ones) that erode our self-worth.\nBig letdowns don't help feelings of self-value. But it's actually life's daily little attacks that add up and create patterns of destructive thinking. The little jab about how you're not great at presenting, about you not being good with numbers--they create an unhealthy expectation that more cracks in the armor will keep appearing.\nCatch yourself in these small moments and thrust them into perspective. And by the way, when you're in those big moments that challenge your self-confidence, shut down your nuclear reactor and stop catastrophizing. Remind yourself that you've been through worse and came out stronger, and that you'll do so again. 5. It came from somewhere so send it back.\nOf some of the small, confidence eroding moments, O'Reilly says in her TEDx talk:\nThese encounters echo earlier occasions in our lives when we felt like our value as a person was determined by other people, usually adults, and fluctuated depending on what they thought of our latest grade, game, performance or accomplishment. What were some of the early messages you received about who you needed to be to show up in the world as meaningful?\nNote the similarity between those \"old tapes\" and similar messages you receive now. Recognize them for what they are--misplaced, irrelevant judgments. Strip them of their truth and release their hold on you. 6. Think of what will change if you believe you're already enough.\nImagine if you really believed this. Seriously, I mean stop and complete this sentence: \"If I believed I were already enough, I'd .\"\nIt's a powerful exercise. Brooklyn Nine-Nine star Terry Crews says the single biggest driver of his multi-varied success has been his belief that he is already enough.\nAnd guess what? Your enough is enough too. Published on: Apr 2, 2019 Like this column? Sign up to subscribe to email alerts and you'll never miss a post. More from Inc. ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "o'reilly", "sentiment": "none"}], "organizations": [{"name": "stanford", "sentiment": "negative"}], "locations": []}, "rating": null, "crawled": "2019-04-03T02:21:41.016+03:00"}, {"thread": {"uuid": "749c7644ada49aa4a804b07108248637e215e01d", "url": "https://corporate.discovery.com/discovery-newsroom/hgtv-delivered-strong-monday-night-performance-with-help-from-home-town-and-new-series-one-of-a-kind/", "site_full": "corporate.discovery.com", "site": "discovery.com", "site_section": "", "site_categories": ["real_estate", "apartments"], "section_title": "", "title": "HGTV DELIVERED STRONG MONDAY NIGHT PERFORMANCE WITH HELP FROM ‘HOME TOWN’ AND NEW SERIES ‘ONE OF A KIND’ – Discovery, Inc.", "title_full": "HGTV DELIVERED STRONG MONDAY NIGHT PERFORMANCE WITH HELP FROM ‘HOME TOWN’ AND NEW SERIES ‘ONE OF A KIND’ – Discovery, Inc.", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "", "performance_score": 0, "domain_rank": 3847, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "749c7644ada49aa4a804b07108248637e215e01d", "url": "https://corporate.discovery.com/discovery-newsroom/hgtv-delivered-strong-monday-night-performance-with-help-from-home-town-and-new-series-one-of-a-kind/", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "HGTV DELIVERED STRONG MONDAY NIGHT PERFORMANCE WITH HELP FROM ‘HOME TOWN’ AND NEW SERIES ‘ONE OF A KIND’ – Discovery, Inc.", "text": "Interior design couple @ NateBerkus and @ JeremiahBrent and their adorable family return to @ TLC on April 13! In the… https://t.co/e99VLiNIKn RT @ Discovery : “Family on the rocks.” 🐅 📸 + caption by Ajit Kulkarni for #TigerTuesday 🐅 https://t.co/YTPM3wF5hO The cult classic ‘Ghost Bait’ has been lured back to TV and premieres on @ travelchannel on April 4! This radical ex… https://t.co/32OdPDZpGb This World Autism Month, we are taking the pledge to #LightItUpBlue with @ autismspeaks to help increase understandi… https://t.co/DbbF0e6ZTH RT @ joshuagates : I'm hooked on a feeling! @ Discovery @ DiscoveryIncTV https://t.co/X36it36MhQ Could’ve fooled me with these tricky @ FoodNetwork treats. Don’t be so quick to judge, for these snacks are not what… https://t.co/P0YQOfuhN4 RT @ BenMullin : New: In an interview, Discovery CEO David Zaslav acknowledged he was basically operating two companies. One traditional cabl… RT @ realscreen : Discovery, BBC confirm SVOD content partnership, UKTV plans https://t.co/fEJvRq3zej RT @ marksweney : The BBC natural history/wildlife/factual content deal for Discovery's (mostly) global streaming service coming in 2020 is w… RT @ Adweek : Discovery will create its own global streaming service as part of new BBC content partnership: https://t.co/EDkf7viBqi https://… RT @ TechCrunch : BBC and Discovery team up on a new streaming service focused on factual programming https://t.co/Mnt4GQwW7C by @ sarahintamp … RT @ engadget : Discovery streaming service will be the sole home for BBC nature shows https://t.co/h8mSD7Zhee https://t.co/z5Kttv0B9w RT @ THR : BBC and Discovery Strike Global Content Partnership, Agree to Split up the Channels in Their UKTV Joint Venture https://t.co/d0lMz … RT @ AhHorta : One more thing...a new chapter for factual content! https://t.co/aHXUU8NjZH RT @ Jimmy_Hillier : The big ambition and bold vision of @ DiscoveryIncTV . New global streaming service announced today, powered by new @ bbc … RT @ TheWrap : .@ DiscoveryIncTV and @ BBCStudios Form 10-Year Pact for Content, Including #PlanetEarth https://t.co/zJ4SClJB28 https://t.co/c9 … Part of the new Discovery and @ bbcstudios deal is an incredible series by American Idol creator, Simon Fuller and w… https://t.co/AuxPafdsxG Discovery and BBC sign major global content partnership and agree on future of UKTV channels. This landmark deal in… https://t.co/AkwGJPD1G3 We are excited to announce a landmark deal with @ bbcstudios for a content partnership spanning a library of premium… https://t.co/4UmgJ3E7sd ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "david zaslav", "sentiment": "none"}, {"name": "ajit kulkarni", "sentiment": "none"}], "organizations": [{"name": "hgtv", "sentiment": "negative"}, {"name": "inc", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "uktv", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T03:17:45.011+03:00"}, {"thread": {"uuid": "ea8a00185e7ac3e463f9e490b06a7c6987be4151", "url": "https://corporate.discovery.com/discovery-newsroom/take-a-virtual-tour-of-hgtv-smart-home-2019-located-in-the-dallas-fort-worth-suburb-of-roanoke-texas/", "site_full": "corporate.discovery.com", "site": "discovery.com", "site_section": "", "site_categories": ["real_estate", "apartments"], "section_title": "", "title": "Take a Virtual Tour of HGTV Smart Home 2019 located in the Dallas-Fort Worth suburb of Roanoke, Texas – Discovery, Inc.", "title_full": "Take a Virtual Tour of HGTV Smart Home 2019 located in the Dallas-Fort Worth suburb of Roanoke, Texas – Discovery, Inc.", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "", "performance_score": 0, "domain_rank": 3847, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "ea8a00185e7ac3e463f9e490b06a7c6987be4151", "url": "https://corporate.discovery.com/discovery-newsroom/take-a-virtual-tour-of-hgtv-smart-home-2019-located-in-the-dallas-fort-worth-suburb-of-roanoke-texas/", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "Take a Virtual Tour of HGTV Smart Home 2019 located in the Dallas-Fort Worth suburb of Roanoke, Texas – Discovery, Inc.", "text": "Facebook Take a Virtual Tour of HGTV Smart Home 2019 located in the Dallas-Fort Worth suburb of Roanoke, Texas\nKNOXVILLE, Tenn. [April 2, 2019 – For Immediate Release] This year’s newly built, fully furnished HGTV® Smart Home is a Texas bold contemporary located in the Dallas-Fort Worth suburb of Roanoke, Texas.\nEarning accolades as a top market for family life, job seekers, technology, and exciting cuisine, this area is a booming business hub and cultural scene. From its origins as a railroad and cattle center to the unique dining, shopping and entertainment destination it is today, the City of Roanoke offers a charming, small-town atmosphere with the best in amenities and opportunities. Fans can now visit HGTV.com/Smart to take a virtual tour of every room.\nPlanned and built by local firm Highland Homes , this Texas stunner is part of a grand prize package valued at more than $1.2 million that will be awarded this summer. In addition to the residence and all its furnishings, the winner will receive a 2020 Mercedes-Benz GLE and $100,000 from LendingTree.\nThe modern, custom home is nestled in the Fairway Ranch development, a sustainable community with panoramic views, walking trails, expansive greenbelts, a community pool and parks. The home spans approximately 3,400 square feet and has three bedrooms and three-and-a-half baths with an aesthetic best described as an Old-World retreat. It features smart technology, clever design solutions and energy-efficient materials throughout.\nHGTV Smart Home 2019 host and interior designer Tiffany Brooks took cues from her surroundings to infuse the home with big Texas style. “I utilized a mix of modern elements and subtle ranching touches, giving the home a unique style that breaks from tradition,” she explained. “I believe fans will be inspired by the use of unexpected colors and texture throughout each space, as well as all the ideas to enhance everyday living with clever solutions.”\nA gem of smart living in America’s heartland, this single-level abode features a media room with 3D movie theatre, a home office, cozy library, playroom, sophisticated master suite, butler’s pantry, laundry room with dog washing station, and beautiful yet casual outdoor patio complete with grilling and gaming area, movie screen, and covered spaces for dining and relaxing.\nDuring the sweepstakes period for the HGTV Smart Home Giveaway 2019, which begins at 9 a.m. ET on Wednesday, April 24 and runs through 5 p.m. ET on Friday, June 14, eligible viewers can enter twice per day at HGTV.com and sign up for daily email reminders. Fans can also visit HGTV’s Facebook , Instagram and Twitter pages for updates and new details (#HGTVSmart).\nViewers can catch the DIY Behind the Build: HGTV Smart Home 2019 special chronicling the construction process, which premieres Thursday, April 25 at 11 p.m. ET on DIY Network, along with the HGTV Smart Home 2019 Special , which premieres Friday, April 26 at 7 p.m. ET on HGTV.\nSponsors of HGTV Smart Home 2019 include Bassett Home Furnishings; Mercedes-Benz USA; Keurig®; LendingTree; BISSELL®; The Sherwin-Williams Company; Lennox Industries, Inc.; SimpliSafe Home Security; Sleep Number; Talon Hardwood Floors; VELUX® No Leak Skylights; Kohler Co.; OxiClean™; and Trex®. To learn more about the giveaway, visit HGTV.com/Smart .\nABOUT HGTV\nHGTV delivers the superstar experts, fascinating families, compelling renovations and stunning transformations that make all things home fun. America’s favorite way to get entertaining, relatable and inspirational home and lifestyle content, HGTV offers: a top 10 cable network that is distributed to more than 90 million U.S. households; a website, HGTV.com , that attracts an average of 9.7 million people each month; a social footprint of 16.8 million; HGTV Magazine, a monthly publication that reaches more than one million readers and exclusive collections of home-oriented products through the HGTV HOME™ consumer products line. Viewers can become fans of HGTV and interact with other home improvement enthusiasts through Facebook , Twitter , Pinterest and Instagram . HGTV is operated by Discovery, Inc., a global leader in real life entertainment spanning 220 countries and territories, whose portfolio also includes Discovery Channel, Food Network, TLC, Investigation Discovery, and OWN: Oprah Winfrey Network. ### ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "hgtv", "sentiment": "none"}, {"name": "highland homes", "sentiment": "none"}, {"name": "lendingtree", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "dallas-fort worth", "sentiment": "none"}, {"name": "roanoke", "sentiment": "none"}, {"name": "tenn.", "sentiment": "none"}, {"name": "texas knoxville", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T03:17:47.123+03:00"}, {"thread": {"uuid": "a03c2c01cc94895fba6596ce31a0b59e415c43af", "url": "https://www.msn.com/en-sg/money/personalfinance/6-things-you-should-know-about-the-new-apple-card/ar-BBVyi3s", "site_full": "www.msn.com", "site": "msn.com", "site_section": "https://www.msn.com/en-sg/money", "site_categories": ["tech", "email"], "section_title": "Stock quotes, financial tools, news and analysis - MSN Singapore Money", "title": "6 things you should know about the new Apple Card", "title_full": "6 things you should know about the new Apple Card", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.02, "main_image": "", "performance_score": 0, "domain_rank": 13, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "a03c2c01cc94895fba6596ce31a0b59e415c43af", "url": "https://www.msn.com/en-sg/money/personalfinance/6-things-you-should-know-about-the-new-apple-card/ar-BBVyi3s", "ord_in_thread": 0, "author": "Zack", "published": "2019-04-01T03:00:00.000+03:00", "title": "6 things you should know about the new Apple Card", "text": "6 things you should know about the new Apple Card Free Malaysia Today 3 days ago Zack © Provided by FMT MEDIA SDN BHD Apple fans, rejoice! The Apple Card is coming to the US this summer (and more than 40 countries by the end of the year), bringing with it a slew of benefits, especially for those who own an iPhone.\nYou can use the app version of the card, and it will work in tandem with Apple Pay.\nThere will also be a physical, titanium card you can own, which will bear only your name, Apple’s logo, and a chip.\nThe sleek looking card will sure to turn heads, but as of now, there is no information on how Malaysian residents can get their hands on it.\nHere are six things you should know about the Apple Card.\nGetting the Apple Card is expected to be simple; just sign up in the Apple Pay app. There will be no cash-advance fees, over-the-limit fees, late fees, annual fees, and even foreign transaction fees.\nThis is certainly an advantage the Apple Card has over many traditional credit cards.\nNote that late or missed payments will still result in additional interest accumulating towards your balance.\n© Provided by FMT MEDIA SDN BHD\nEveryone loves getting rewards, and with the Apple Card it is a daily event. You get a certain percentage in cashback daily when making transactions with the Apple Card.\nPurchases from Apple (whether Apple store or iTunes): 3% cashback Purchases from merchants that support Apple Pay: 2% cashback Purchases from merchants that do not have Apple Pay (use your Apple Card like a regular credit card): 1% cashback\nIf there is one thing Apple knows how to do, it is to make beautiful, intuitive apps.\nThe Apple Card app showcased in the presentation was all about ease of use, with detailed information at your fingertips.\nTransactions are no more garbled machine speak, but rather detailed information with Maps integration.\nExpenses are automatically categorised and you can schedule auto payments and notifications via the Apple Card app.\nThis means you no longer have to use a separate app or website to track your spending, and have easier ways of visualising expenses that would in turn, help improve spending habits.\n© Provided by FMT MEDIA SDN BHD\nApple has partnered with Goldman Sachs and MasterCard on the creation of this card. This likely increases customer confidence in using the Apple Card.\nTop that off with the integration of Apple Pay, which has already seen strong growth in the number of merchants using it (70% adoption rate by businesses in the US, 99% adoption rate by businesses in Australia), and the arrival of Apple Card is expected to be smooth sailing as it grows with Apple Pay adoption.\nIt should be noted that in Malaysia, most merchants are yet to eagerly embrace Apple Pay as a form of payment and the Goldman Sachs brand has left a less than stellar impression due to past actions.\nBasically, your iPhone will be an integral part of the Apple Card experience. Utilising similar features found in the Apple Pay app, you will have real-time fraud protection by being notified of unusual activities right on your app.\nSupport is available via text around the clock. Although these features are not ground-breaking, they provide the level of ease and accessibility that most Apple customers have become accustomed to.\nThe iPhone is often touted as having some of the best security a mobile phone has to offer, although recent high publicity cases have highlighted that even these phones are not immune to exploits.\n© Provided by FMT MEDIA SDN BHD\nAlthough there is not much information surrounding this topic, the fine print found in Apple’s site states that “variable APRs range from 13.24% to 24.24% based on creditworthiness. Rates as of March 2019.”\nHow this translates to the Malaysian market is yet unknown at this point, but most critics say that at 24%, Apple’s claim of low interest rates does not seem to jive with the facts.\nTo summarise, Apple’s latest offering is meant to appeal to a wide array of audiences, especially those who already own an iPhone.\nIt has features that will entice first-time credit card owners, or those who have held back from getting one.\nFor the credit card-savvy, it does seem that there are other cards in the market that give better rewards.\nApple will most likely publish more information on their credit card offering as the launch date draws nearer.", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["http://www.freemalaysiatoday.com/"], "entities": {"persons": [], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "fmt media sdn bhd apple", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T04:06:41.002+03:00"}, {"thread": {"uuid": "5d2a8109db575239e4da0508a2a9026cde3d9612", "url": "http://www.fool.com/earnings/call-transcripts/2019/04/02/dave-busters-entertainment-inc-play-q4-2018-earnin.aspx", "site_full": "www.fool.com", "site": "fool.com", "site_section": "http://www.fool.com/investing-news/", "site_categories": ["investing", "finance"], "section_title": "Motley Fool News &amp; Analysis -- The Motley Fool ", "title": "Dave & Buster's Entertainment Inc (PLAY) Q4 2018 Earnings Conference Call Transcript", "title_full": "Dave & Buster's Entertainment Inc (PLAY) Q4 2018 Earnings Conference Call Transcript -- The Motley Fool", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://g.foolcdn.com/editorial/images/517998/featured-transcript-logo.png", "performance_score": 0, "domain_rank": 1336, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "5d2a8109db575239e4da0508a2a9026cde3d9612", "url": "http://www.fool.com/earnings/call-transcripts/2019/04/02/dave-busters-entertainment-inc-play-q4-2018-earnin.aspx", "ord_in_thread": 0, "author": "Motley Fool Transcribers", "published": "2019-04-02T03:00:00.000+03:00", "title": "Dave & Buster's Entertainment Inc (PLAY) Q4 2018 Earnings Conference Call Transcript", "text": "Image source: The Motley Fool.\nDave & Buster's Entertainment Inc ( NASDAQ:PLAY )\nQ4 2018 Earnings Conference Call\nApril 02, 2019 , 5:00 p.m. ET\nContents: Prepared Remarks Questions and Answers Call Participants Prepared Remarks: Operator\nGood afternoon, everyone. Welcome to the Dave & Buster's Entertainment, Inc. Fourth Quarter 2018 Earnings Results Conference Call. Today's call is being hosted by Brian Jenkins, Chief Executive Officer. I would like to remind everybody that this call is being recorded and will be available for replay beginning later today.\nNow, I would like to turn the conference over to Arvind Bhatia, Senior Director of Investor Relations, for opening remarks.\nArvind Bhatia -- Senior Director of Investor Relations\nThank you, James, and thank you all for joining us. On the call today are Brian Jenkins, Chief Executive Officer; and Joe DeProspero, Interim Chief Financial Officer. After comments from Mr. Jenkins and Mr. DeProspero, we will be happy to take your questions. This call is being recorded on behalf of Dave & Buster's Entertainment, Inc. and is copyrighted.\nBefore we begin our discussion of the company's results, I would like to call your attention to the fact that in our remarks and our responses to your questions, certain items may be discussed, which are not based entirely on historical facts. Any such items should be considered forward-looking statements and relating to future events within the meaning of the Private Securities Litigation Reform Act of 1995. All such forward-looking statements are subject to risks and uncertainties, which could cause actual results to differ from those anticipated. Information on the various risk factors and uncertainties has been published in our filings with the SEC, which are available on our website at www.daveandbusters.com under the Investor Relations section.\nIn addition, our remarks today will include references to EBITDA, adjusted EBITDA and store operating income before depreciation and amortization, which are financial measures that are not defined under Generally Accepted Accounting Principles. Investors should review the reconciliation of these non-GAAP measures to the comparable GAAP results contained in our earnings announcement released this afternoon, which is also available on our website.\nNow, I will turn the call over to Brian.\nBrian Jenkins -- Chief Executive Officer\nThank you, Arvind. Good afternoon, everyone, and thank you for joining our call today. Well, 2018 marks the year of meaningful progress on our strategic priority. We delivered sequential improvement in comp sales throughout the year and drove strong new store performance leading to our eighth consecutive year of record sales and EBITDA. We also returned significant value to our shareholders in 2018 through nearly $150 million in share repurchases and by instituting a quarterly cash dividend. And, today, we also announced that our Board has authorized to expand our share repurchase program by an additional $200 million.\nWith respect to the fourth quarter, I'm pleased with our performance, including the return to positive comp sales. Comparable store sales increased 2.9%, which was ahead of our casual dining benchmark by 70 basis points. We believe an increased focus on value, a favorable holiday calendar, better weather and the ongoing improvement in our core offering were the key drivers of this growth. On a comparable week basis, we grow overall revenue by nearly 16% and EBITDA by approximately 6% during the quarter.\nWe continued to drive four strategic priorities to grow our brand. First, we remained focused on evolving our offering in Amusements, we are providing our guests with the most compelling games in the industry, we continue to have access to the best of what the industry has to offer often on a limited time exclusive basis. This access is due to our size, our scale and our ability to promote games on national TV.\nIn addition, our Amusements team is driving the creation of new proprietary games, a key differentiator for us, as evidenced by the successful launch of our virtual reality platform in 2018. Our ability to efficiently execute such a large scale national rollout is unmatched in the industry.\nLooking at Q4, our new release, Dragonfrost VR was an excellent addition to our VR offerings and has performed well for us, at the same time Jurassic World VR Expedition, Halo, Connect 4 Hoops also remains strong. Our Q1 2019 slate includes several new proprietary titles available only at D&B in mid-February, ahead of the release of the Captain Marvel movie, we launched Marvel: Contest of Champions, featuring highly popular characters from the Marvel Universe. This title includes collectable cards designed really to foster repeat play. And then just last week we introduced Star Trek: Dark Remnant, our third VR title, further strengthening our library of VR attraction.\nFinally, we're excited to announce today our fourth VR title, a game based on the Men in Black film series. We plan to introduce the title in Q2 around the June release of the Men in Black: International movie. This is the next movie in this popular franchise. And based on the strength of our VR offering, in early 2019, we implemented a price increase on our VR games in just over half of our stores.\nTurning now to food and beverage, you may recall the underpinnings of our F&B evolution include a focus on simplification, quality and accessibility. Our simplification efforts allowed us to reduce the size of our February menu by another 15% on top of 20% reduction implemented a year ago. Our menu is now appropriately streamlined and still offers a great variety with approximately 40 food items and over 20 different handcrafted cocktail.\nAs for quality, we're not only focused on sourcing better raw ingredients, but also on improving techniques that create craveable flavors combined with excellent presentation. This is the foundation of our new food mantra, Crafting Craveability. To help bring that to life, we rolled out premium choice steaks in February in conjunction with the launch of our new menu. This rollout followed last year's burger and chicken upgrades. We have recrafted or rebranded some of our all-time favorites such as the new super stacked burger replacing Dave's double cheeseburger and Tuscan Chicken Alfredo replacing our Parmesan Chicken Alfredo.\nWe've also introduced healthier offerings such as an on trend simply grilled chicken with noodles or zucchini-based noodle that guest can substitute and process for alcoholic beverages. We added fresh juices and puree systemwide to further enhance flavor. All told, we've replaced or recrafted about three quarters of our menu over the past year and we will continue to innovate and evolve with the changing tastes of our guests. At the same time, we recognize that games are the primary driver guest visitation and expect it will take some time to build awareness for a new improved offering and enhance the S&P attachment rate. One of the ways, we are increasing the awareness is through improved messaging and quality callouts on our menu. And over time, we will look to feature food more prominently in our marketing campaign.\nTo improve accessibility, we recently launched a quick casual tenants in our drive (ph) store, we talked about that on the last call, really to gauge the potential demand for a more convenient and accessible food option. The offering has been well received by those who have experienced it. Initial demand has not been as strong as we anticipated, and we are working to improve in-store awareness, utilization and remain optimistic about this opportunity.\nOur second strategic priority is to enhance our guest experience by improving service and reducing friction. We are putting greater emphasis on providing guest service that is friendly, available and memorable. To reduce friction, we are embracing new technologies, we kicked off 2019 with the national rollout of our new RFID Tap-and-Play Power Cards, which really enables our guests to experience an easier, faster and more accurate game activation. Our new cards are priced a little higher than our older cards, but also include more value through additional gameplay chip.\nIn our back office, we have completed the systemwide rollout of our new labor management system. And as we climb the learning curve, we expect to improve our scheduling efficiency with a primary goal of enhancing gesture. In the back half of 2019, we look forward to launching our new and improved mobile app, the new app has really been designed to offer greater functionality to our guests and ultimately drive better guest connection and engagement with our brand.\nOur third strategic priority is to effectively communicate our offering and value. During the first half of the quarter, we focused on our value message through the Unlimited Wings, unlimited video game promotion on Game Day, an offer that clearly resonated with our guests later in the quarter. We highlighted the release of Dragonfrost, our new game news for the quarter.\nAnd finally, toward the end of the quarter, we reintroduced Unlimited Wings game promotion, really focused on building traffic on Thursday. Now, beyond honing our promotions, we are also evolving our media mix and increasing our digital spend with more emphasis on programmatic, social media, search engine marketing and optimization. We are funding our digital media investment primarily by shifting dollars away from our national cable TV, but also through some incremental spending. Just to be clear here, this shift is the digital is gradual for us and national cable TV continues to represent the margin -- the majority of our media allocation.\nFinally, I'll highlight our fourth and biggest long term driver of shareholder value, that is to expand our brand geographically, with 125 stores we are a clear leader in the combined entertainment and dining space. We remain confident in our long term target of 231 to 251 stores about two times our current size. This confidence is predicated on our track record of delivering excellent new store returns, even in the face of heightened competition by 2017 class of stores generated year one, cash-on-cash returns of over 60%, really one of the best in recent history.\nAnd we plan to continue to grow our store base at a pace of 10% or more annually and are confident in our ability to capitalize on the board opportunity in front of us. During the fourth quarter, we opened three new stores. The first store was in Milford, Connecticut, an existing market for us. In addition, we opened a store in Birmingham, Alabama, and a store in Corpus Christi, Texas. Both new markets for our brand, the Corpus Christi store location is our second 17,000 square foot location while still early on here. We are very pleased with the performance of the 17K. And are excited about our ability to access smaller D&B in smaller markets with this format. For the full year, we added 15 new stores representing 14% unit growth, a new high watermark for new store openings, a great accomplishment for our team.\nDuring fiscal 2019, we plan to open 15 to 16 new stores representing 12% unit growth net of a store closing, our 2019 directions (ph) was large format stores and new markets for our brand, really similar to last year, although we will be going to some smaller D&Bs this year. We've opened five new stores in Q1 so far, one in Louisville, Kentucky; North Hills, Pennsylvania; northern suburb of Pittsburgh; One in Thousand Oaks, California; Store in Daytona Beach, Florida. And most recently, Fairfax, Virginia. We plan to open two more stores this quarter; one in Fort Myers, Florida, and one in Sevierville, Tennessee for a total of seven new stores in the quarter with fully executed commitments, now 22 new sites, including nine stores under construction. Our confidence in our ability to execute our store expansion strategy remains high.\nWith that, I'll turn it over to Joe to discuss our financial performance and 2019 guidance. Joe?\nJoe DeProspero -- Vice President of Finance and Interim Chief Financial Officer\nThank you, Brian, and good afternoon, everyone. Before I discuss our Q4 financial results, let me once again remind you that 2017 was a 53 week year. As a result, our fiscal year 2018 calendar shifted by one week and had one less week. In Q4 of this year, the unfavorable impact of one less week was $18.3 million on revenue, $2.5 million on EBITDA, and $3.3 million on adjusted EBITDA, but it had a 60 basis points favorable impact on EBITDA margins.\nAlso, to provide a more meaningful picture of our performance, I'll be pointing our comp sales on a comparable week basis adjusting for the calendar shift.\nTurning now to some of the highlights during the fourth quarter. Total revenues increased 8.8% to $331.8 million versus $304.9 million reported in Q4 of last year. On a comparable 13-week basis, revenue was up 15.7%. This increase in revenue was driven by strong contribution from our 35 non-comparable stores, which represented 29% of our store base during the quarter and a 2.9% increase in comparable store sales. Non-comp store sales increased to $91.9 million, up from $53.4 million in the prior year on a comparable 13-week basis. Revenues from our 86 comparable stores increased to $243.3 million, up from $236.4 million in the prior year on a comparable 13-week basis.\nLooking at overall reported sales by category, we grew Amusements and Other sales by 10.7% and Food and Beverage sales by 6.5%. During the quarter, Amusements and Other represented 55.5% of total revenues, a 100 basis points increase in mix from the prior year period continuing a long-term trend.\nBreaking down comp sales in a comparable week basis, our walk-in sales were up 3.7%, while our special event sales were down 1.4%. In terms of category comp sales, Amusements was up 4.4%, and F&B was up 1.1%. Within F&B, food and bar business were up 1.3% and 0.9%, respectively. The gap between Amusements and F&B narrowed in the fourth quarter relative to the trend in Q3. The increase in F&B comps and reduced gap with Amusements was driven in part by the favorable impact of the All You Can Eat Wings promotion, partially offset by the unfavorable impact of a slight decline in special events, which has a higher mix of F&B.\nThe calendar shifts resulting from Christmas and New Year is moving from the weekend last year to weekday this year was a positive for us. Also, the impact of weather was positive for the full quarter as favorable weather in November, December was partially offset by the unfavorable impact of the polar vortex in late January. On the other hand, the combination of competitive intrusion and cannibalization continue to be a greater headwind compared to the same period last year, but sequentially the impact was flat.\nTotal cost of sales was $58.8 million in the quarter and as a percentage of sales with 20 basis points better versus the same period last year, reflecting improvement in SMB margins partially offset by lower amusement margins. Food and beverage cost as a percentage of food and beverage sales was 30 basis points favorable compared to last year as the impact of 2% in food pricing and 1.1% in bev pricing was partially offset by the unfavorable impact of slight commodity inflation. The impact at All You Can Eat Wings promotion and investment in our new burger and chicken.\nCost of amusement and other as a percentage of amusement and other sales was 10 basis points worse compared to last year. Amusement margins were favorably impacted by the ongoing shift toward simulation games, including our virtual reality games, but were offset by used tax on redemption items. Our operating payroll and benefits cost as a percentage of sales was 23.8% or 110 basis points worse year-over-year due to higher incentive compensation expense, the unfavorable impact of nearly 5% wage inflation, incremental investment and labor related to virtual reality, higher medical insurance claims compared to last year and the impact of non-comp stores.\nOther store operating expenses were up 160 basis points year-over-year, primarily driven by higher occupancy costs and increased claims expense for Workers Comp and general liability, partially offset by leverage on our marketing expenses. G&A expenses were $16.1 million, up from $14.4 million in the prior year, reflecting higher bonus expense, increased headcount to support a growing store base, greater medical insurance claims and higher ICN legal expenses, partially offset by lower share based compensation expense.\nAs a percentage of revenues, G&A expenses were 10 basis points unfavorable versus the prior year. Pre-opening costs were $6 million versus $9.1 million in the fourth quarter of 2017. This decrease reflected fewer store openings in the quarter, as well as the timing of future store openings compared to last year. As a percentage of revenue, pre-opening costs were 1.8% or 120 basis points better compared to the prior year. EBITDA was $72.1 million, up 1.9% and EBITDA margins were 21.7%, down 150 basis points versus the prior year. On a comparable week basis, EBITDA was up 5.6% year-over-year and EBITDA margins were down 210 basis points.\nAdjusted EBITDA of $80.2 million was down 2.8%, but on a comparable week basis was up 1.2%. Net interest expense for the quarter increased to $3.7 million, up from $2.6 million in the prior year, driven by increases in the underlying LIBOR rate and higher average debt levels resulting from our capital allocation initiatives, including share repurchases and the quarterly cash dividends.\nEffective tax rate for the quarter was 21.1% compared to 10.6% in the year ago period. The year ago period included an $8 million non-recurring one-time favorable impact of our evaluation of our deferred tax positions under the Tax Cuts and Jobs Act.\nWe generated net income of $29.4 million or $0.75 per share on a diluted share base of $39.1 million compared to net income of $35.6 million or $0.85 per share on a diluted share base of $41.7 million in the fourth quarter of last year. Net income for the fourth quarter of 2017, exclusive of the beneficial impact of certain tax adjustments related to tax reform and an additional week in the quarter, was $27.3 million or $0.66 per diluted share.\nShifting to the balance sheet. At the end of the quarter, we had $394 million of outstanding debt, resulting in leverage of approximately 1.4 times EBITDA. In Q1 2019, we implemented an interest rate swap, which essentially fixes our interest rate on $350 million of debt until August 2022 at LIBOR of 2.5% plus an applicable margin. Given our current leverage ratio, the fixed rate is approximately 3.7%.\nDuring the quarter, we've repurchased approximately 1.3 million shares of our common stock for $63 million. The inception-to-date total as of March 26, 2019, is 7.2 million shares for $375 million. We paid our second quarterly cash dividend of $0.15 per share during Q4.\nTurning now to our outlook for fiscal year 2019. Total revenues are expected to range from $1.37 billion to $1.4 billion, up 8% to 11%. Comp store sales are expected to be flat to up to 1.5%. From a development perspective, we are targeting 15 to 16 new stores this year. In March, we closed our Duluth, Georgia store, which was at the end of its lease term. Net of Duluth store closing, we are planning on unit growth of approximately 12% consistent with our target of 10% or more annual unit growth.\nIn terms of store opening cadence, we plan to open 10 new stores in the first half this year versus 11 new stores on the first half of last year. We are projecting net income of $105 million to $117 million. Net income is based on an effective tax rate of 22% to 22.5%. Please note, this guidance reflects the new lease accounting standards, which we anticipate will have an immaterial impact on our net income. We estimate a diluted share count of approximately $37 million. We are projecting EBITDA of $285 million to $300 million for the fiscal year. We are expecting margin compression, primarily resulting from continued wage pressure and a rising mix of new stores that although have strong returns are modeled to have lower AUVs and margins compared to our existing stores. Net capital additions after tenant allowances and other landlord payments is projected to be between $190 million and $200 million, and will support our strong new store pipeline.\nThank you for your interest in Dave & Buster's. Now, I'll turn the call back over to Brian.\nBrian Jenkins -- Chief Executive Officer\nThank you, Joe. I want to emphasize as an organization, we remain focused on four strategic priorities, which include evolving our offerings, improving our guest experience, effectively communicating our offering in value, and expanding our great brand.\nLooking forward, we're poised to deliver yet another year of record revenue and EBITDA performance, our proven business model, strong team, robust real estate pipeline and financial flexibility, our competitive advantages that position us well for the future.\nWe're excited about the proprietary games we're launching this year, as well as our new menu that underscores our mantra of Crafting Craveability. Our operating team is putting greater intensity into the delivering service that is even more friendly, available and memorable. Our marketing team is focused on driving traffic by ensuring our message is resonating with guests and by selectively leaning in on value. We remain the leader in a large and growing market and are well positioned to capitalize on the unique growth opportunity ahead.\nFinally, I want to take a minute to thank our entire D&B team for helping deliver another record year in 2018. The team continues to work hard to strengthen our foundation and position our brand for a vibrant future. I had the privilege, the opportunity to see many of our team members at our recent National General Managers Conference in Dallas, and I couldn't be more delighted with the talent we have been able to attract and the energy and passion they have for this great brand. As always, we appreciate the continued support of our shareholders and your interest in Dave & Buster's.\nJames, please open the lines for Q&A.\nQuestions and Answers: Operator\nThank you, sir. (Operator Instructions) And we'll take our first question today from Andy Barish with Jefferies.\nAndy Barish -- Jefferies -- Analyst\nYes. Good afternoon, guys. Just maybe peeling few layers on the same-store sales guide, why you are not expecting a little bit more when the comparisons are still relatively easy? You're building the VR library and how much pricing did you take on VR in terms of that material to 2019 comps?\nBrian Jenkins -- Chief Executive Officer\nWell, I think I'll backup, just a minute, Andy. First of all, we couldn't be more pleased with Q4 right now. The return to positive comps after five quarters, it was a big success for us passing casual dining benchmarks for the first time in quite some time. So, clearly, we focused on things around value with our Unlimited Wings video promotion. That was helpful to us in Q4. We estimate the wing promotion helped us in the neighborhood of 100 bps for the quarter. I talked a little bit about the calendar shift, the holiday shift, as well as weather in the quarter. We estimate that to be about 50 bps lift in our 2019 (ph) performance this quarter.\nAnd then the improvement in the offering which you speak, you talk a little bit about VR. Obviously, that's an attraction we have this year that wasn't in place in 2017. So first of all, we're really excited to be in positive comp territory in Q4. And as we look to 2019, we're guiding comps to flat to up 15. We think that is a strong pursuit for this brand in the face of the competitive environment we face today. It's early in the year. We're excited about the lineup we have. As you mentioned, of our VR games, we announced -- we just launched Star Wars, we have Men in Black coming. We think it's going to be a broadly appealing IP for us.\nWe like our evolution in food. We think some of that -- it's going to take some time. It's not the primary reason for the visit at Dave & Busters, and we're going to continue to lean in on value, the unlimited wing combination with games and video, it's telling and we're going to pivot more toward digital. All those things, and we did take some price. And on the game side, we haven't done that in some time. We're doing all those things to drive positive costs, and we think we have to place up to do that. I think it's a prudent guide. I'll give you a little color and we don't typically do this, but I'm just going to get it out of the way. We -- Q1 is a very volatile quarter for this Company in that spring break at Easter shifts are significant. In past lives, we've hesitated to really talk about performance in the quarter. But I do want to share with you that through seven weeks before we started to hit that Easter's shift, we were off about 1%. We view that as good news. We are in positive land in a difficult environment. There's a lot of runway in here left to go and we're pursuing positive comps being flat to up and that's what our team is raking up every day trying to drive in 2019.\nAndy Barish -- Jefferies -- Analyst\nThanks. And then just quickly on the games, I mean, was that Amusements, was that pricing broader than just VR or just the VR price increase that you mentioned?\nBrian Jenkins -- Chief Executive Officer\nThere's really two aspects. With VR thing is relatively small, we did two things. We took a price increase -- as I said, a subset of our stores -- over half of our stores, not all incremental. You do get an impact on demand for the product and utilization rate. When you do that, it's not all incremental at price. But we did take a price, as I said in my prepared remarks on our Power Card, we launched our new RFID Power Card, tap and play. So you're able to just tap -- like -- better hotel room, definitely an easier, more accurate activation of the games. We did take a price increase related to that on the card. So an activation fee price increase that you will see as we move into next into 2019. And that's how we have done that in the past, but I think it will be additive to come.\nAndy Barish -- Jefferies -- Analyst\nThanks for the clarification.\nBrian Jenkins -- Chief Executive Officer\nThank you.\nOperator\nNext, we'll hear from Nicole Miller with Piper Jaffrey.\nNicole Miller Regan -- Piper Jaffray -- Analyst\nThank you. Good afternoon. I want to ask about strategy point number two and the guest experience, and I would imagine technology and the app and things that you were talking about, I believe you set to fall into that. What I'm curious about is, what kind of data are you able to get from your customer tune into the app or anywhere else for that matter, and how you're translating that into the strategy? And then just separate quick modeling question. What's a good share counts for 1Q, please? I just don't know the progression of the share repurchase in 4Q, so I want to make sure we get that right? Thank you very much.\nJoe DeProspero -- Vice President of Finance and Interim Chief Financial Officer\nWell, I mean, clearly, we are focused on driving improved service. Our service scores, I mean, we've been measuring service scores for a long time and we perform well, but our research back in 2017 suggested that we could be better and we know we can be better. So our team is working on being more friendly, more available and delivering a more memorable experience when guests come into our stores. We are, in general, a low frequent use and we need to drive frequency and drive repeat visitation. So that was a big part of our GM conference to really energize the team and they are working hard on trying to bring that to light every day in our stores. In terms of technology, we are working on mobile app that in our view would -- it will be a tool that will allow us to really Nicole, create a guest count that we don't have in a large way today. Our loyalty program does allow us to reach our guest and see some behaviors, but it is not broad. An\nSo this is an initiative by our team, our new CIO, JP Hurtado, who we brought from Royal Caribbean, who has much experience in guest spacing technologies and we're looking to launch the first version of that in the latter part of this year, in the second half this year. And I said this before, I think this is a journey for our brand. This is a place where we need to -- we need to get better and we're for investing more money in technology, in our capital guide as Joe mentioned, this year, than we have ever in my 12 years with this brand.\nNicole Miller Regan -- Piper Jaffray -- Analyst\nShare count?\nJoe DeProspero -- Vice President of Finance and Interim Chief Financial Officer\nYes, share count is projected to be 38 change, 38 and a little.\nNicole Miller Regan -- Piper Jaffray -- Analyst\nHelpful, and very excited about that creation of that guest count data, eventually. Thank you very much.\nArvind Bhatia -- Senior Director of Investor Relations\nThank you, Nicole. You have a good evening.\nOperator\nAndrew Strelzik with BMO Capital Markets, has our next question.\nAndrew Strelzik -- BMO Capital Markets -- Analyst\nHey, good afternoon. I have a question on the guidance relative to what you provided last quarter. So it sounds like the revenue growth implied by the new numbers is a little bit above where you had previously guided it, but the EBITDA growth is maybe a touch below prior. So I guess I'm just wondering what changed. Is that more value orientation? Is it the composition of the size units that you're thinking about, maybe the ad spend? What's changed into -- to lower the EBITDA growth relative to the revenue growth that's moved higher?\nBrian Jenkins -- Chief Executive Officer\nWell, first of all, Andrew, in my view, we issued strong guidance today. We're optimistic about our 2019 year. We are focused on delivering 12% net unit growth, net of a store closing. We're looking for costs to be up 1.5 at the high end, flat at the low end. And we believe we're well positioned to really set revenue and EBITDA high for next year in a very competitive environment. We are looking to continue to build stores which have great returns. We mentioned, when we issued that preliminary high level guidance last time, that we are entering the international (ph) markets that are smaller and our mix are smaller units relative to our current legacy base. It's going to be high going forward, even though we're building stores that are SKU large as a percent of total. There's many more smalls in the new store count this year than our legacy. So that's going to put some downward pressure as we have said on AUVs and pressure on margin as it relates to occupancy. We're definitely seeing labor headwinds. We don't anticipate, that's really going to subside and we're investing in this business.\nWe're going to -- we're playing the long ball here. We're a leader in this space and we're going to work hard to stay there and we're going to be investing in some places, particularly around IT and in terms of, is the guy better or worse in my view. The high-end of our guide is in and around, a little above of what we said, EBITDA at the high-end is about what we said. If you picked the low-end, yeah, a little lower, we're driving store growth here. This team is working very hard to continue to propel this brand forward.\nAndrew Strelzik -- BMO Capital Markets -- Analyst\nI appreciate the comments. Thank you very much. And I just have one quick follow-up on that. With respect to the labor management tool that you've implemented, you mentioned -- it sounds like that's going to be primarily to enhance the guest experience rather than some sort of cost savings opportunity. Can you just talk about maybe what the plans are to enhance the guest experience through that tool? Is there -- Is that part of the reinvestment, maybe, from a labor perspective?\nBrian Jenkins -- Chief Executive Officer\nYeah. We've had a long history of labor improvement in my decade plus with the brand and we have indicated, I think, that with the labor pressure, particularly on wage rates, that for investors not to think about that continuing. There's some real headwinds there and we don't think it's correct and the right strategy long term to turn the needle down on labor. So our view of the labor, the new labor tool is to really try to match demand and peak labor needs and make sure we have the right number of people at the right time and we scale down at the appropriate time and we think the new tool is more nimble than our old one. We've had a tool for a long time. It actually help us a lot back in 2010, I think it was and this one is more nimble and I think there's a learning curve here. We completed the launch in -- somewhere in Q4, I can't remember the exact date, but that takes time to figure that out. So I would be thinking about it, more about delivering a better guest experience by matching labor with demand.\nAndrew Strelzik -- BMO Capital Markets -- Analyst\nGreat. Thank you very much.\nBrian Jenkins -- Chief Executive Officer\nThank you.\nOperator\nWe'll now hear from Jake Bartlett with SunTrust.\nJake Bartlett -- SunTrust Robinson Humphrey, Inc. -- Analyst\nGreat. Thanks for taking the question. Brian, you opened up the box here, the bag in terms of the kind of the current trends in the first quarter here. So I wanted just to ask a couple of -- one question about that. And that is, I think you said 1% comps for seven weeks for the quarter, how does the weather affect you? I know it's been affecting restaurants. I would have actually thought that some of the rainy weather in California and in Florida would have helped you, but maybe if you can just help us understand that 1% and what were some of the factors in that?\nBrian Jenkins -- Chief Executive Officer\nYeah. Actually, we -- I don't want to dissect too much. The first seven weeks, I've done enough by -- I'm being really transparent here with you guys on where we're at through the first seven weeks. We don't really show any weather tailwind in the first seven weeks, but I'll say that, Andrew. I will -- what I didn't say and I probably should have is Q1 volatile through seven weeks, we think pretty comparable here. We are in Easter shift time right now where Easter and spring breaks are shifting out really to week 11 and 12 for us. So we have big, big weeks to go, particularly in the northeast, and how this quarter ends up, and our guidance for zero to flat to up one and a half is full year guide. So I'm not trying to guide quarter here, but how this quarter goes will depend a lot on how the weather flows will be later in the quarter, which is in front of it. We've got some big, big weeks with this big ship.\nJake Bartlett -- SunTrust Robinson Humphrey, Inc. -- Analyst\nGot it. That makes a lot of sense.\nBrian Jenkins -- Chief Executive Officer\nI'm sorry, did I say Andrew there? I'm sorry, Jake.\nJake Bartlett -- SunTrust Robinson Humphrey, Inc. -- Analyst\nThat's all right. That's all right. That's fine.\nBrian Jenkins -- Chief Executive Officer\nYou can be here Andrew, if you'd like to.\nJake Bartlett -- SunTrust Robinson Humphrey, Inc. -- Analyst\nI'll be Andrew. Just in terms of kind of thinking about the attractions there on the VR as you roll out throughout the year, would it be right to assume that the Dragonfrost -- I think it's been, you mentioned it's been successful, but it's not as your name that the consumers recognize on television and may be potentially less of a draw than something like Star Trek and Men in Black. Is that a correct assumption or did you find that that Dragonfrost was kind of had a similar impact that Jurassic Park might have had earlier in the year.\nBrian Jenkins -- Chief Executive Officer\nWell, there's no doubt, the launch of our VR platform that we've failed nationally, we're proud of that as a brand, national brand that scale 120 units across this country with Jurassic World. That is strong IP, it's broad -- has broad appeal, it's an experiential title, a little less interactive gameplay, more experiential. It was a great launch. Dragonfrost, in our view, appeals really a little bit more toward the younger audience. The gameplay is a little more -- it's much more dynamic. Star Trek is sort of a flip of that directive, it flips back, in my view, toward a little bit of an older audience. In Men in Black, we're going to come back with a -- I do, a very broad appeal with Men in Back. So I think we're developing a very good mix of offerings here for consumer groups and we've got a really good attraction list growing. So Jurassic World is still the number one game and I think it is because of the appeal. But we've got a good nucleus we're going right now and we're going to lean into this platform. It's one of the avenues that we have as a brand to introduce proprietary content, something that others don't -- the industry produces what they produce and -- but we can actually control our destiny a little more with this particular platform. So, we decided that we're going to wait and see.\nJake Bartlett -- SunTrust Robinson Humphrey, Inc. -- Analyst\nGreat. And then last question real quick. Would you describe your -- how you look for the pipeline of Amusements content throughout '19 as -- how do you -- how would you compare that to what you did in an '18? Lot of new things happen in '18, but did you feel like the 2019 you could have more games more frequently or maybe more impactful games less recently, or how would you tend to describe on a year-over-year basis?\nBrian Jenkins -- Chief Executive Officer\nSo, as we said before, our overall game strategy is looking for compelling game content. We really want games that keep -- obviously people can't have a home that are larger than life, but that has pushed us toward bigger, better, more marquee titles. We definitely want a nice mix of proprietary games or an exclusive launches where we can -- we -- as I said before, our VR platform I think is the best vehicle for introduction of proprietary platform. So in terms of the 2019 game lineup, we've announced what we're going to announce right now, you know Marvel that we already launched, we just released Star Trek, and we announced Men in Black. And again we're continuing to work, the team is continuing to work on securing other titles that really fit that strategy, and I don't really have anything further I want to announce on the 2019 game lineup today.\nJake Bartlett -- SunTrust Robinson Humphrey, Inc. -- Analyst\nGreat. Thanks a lot. I appreciate it.\nBrian Jenkins -- Chief Executive Officer\nThank you.\nJoe DeProspero -- Vice President of Finance and Interim Chief Financial Officer\nThank you.\nOperator\nNext, we'll hear from Brian Vaccaro with Raymond James.\nBrian Vaccaro -- Raymond James -- Analyst\nThanks, and good evening. I want to start with two quick clarifications, if I could. Back on the Amusements pricing that you took on VR and the RFID cards, what does that equate to in terms of effective year-on-year pricing within that segment?\nBrian Jenkins -- Chief Executive Officer\nI'd say, it's a long year to go and we're measuring that right now. But I would be thinking in the kind of mid 1% range, 1.5% or so on on on games right now. And what will see -- what happens with any impact, but right now we're not thinking that we have a lot of impact relates to Power Cards in terms of what we've seen so far, but it's a long year, so...\nJoe DeProspero -- Vice President of Finance and Interim Chief Financial Officer\nWe expect it to be additive and accretive to comp.\nBrian Vaccaro -- Raymond James -- Analyst\nOkay. That's helpful. And on the EBITDA guidance, Joe, I know you said lease accounting is immaterial of net income, but was there any geography changes due to lease accounting that might have had an impact on EBITDA, I just wanted to check on that?\nJoe DeProspero -- Vice President of Finance and Interim Chief Financial Officer\nNo material geography changes. It results in a immaterial increase in some expense, but once again that's immaterial.\nBrian Vaccaro -- Raymond James -- Analyst\nOkay. And then just on the topic of cannibalization and competition, can you comment on how you expect each dynamic to play out in 2019 maybe compared relative to what you saw in '18?\nJoe DeProspero -- Vice President of Finance and Interim Chief Financial Officer\nSure. We think the combined impact of competitive intrusion and cannibalization will remain a headwind for us for the foreseeable future. I will say, in 2018, it was a part of incremental headwind relative to 2017. Given what we see with some of the units of our competitors and we do know what our new store pipeline looks like, we think that that impact in 2019 will be relatively flat to 2018. We are in attractive space, we're generating strong returns, we continue to attract some competitors, but once again we expect the impact in 2019 to be similar for the full-year to 2018.\nBrian Jenkins -- Chief Executive Officer\nI just -- just to add, that doesn't mean that it's not a significant headwind for us. We talked about this -- we are talking about it a couple of years ago. It shows that it has accelerated over the past couple of years and it is a meaningful headwind in our stores that are not impacted by competitive entrants or ourselves or perform very well. This is it -- it's a drag on our comps and it's something that we are working very hard to offset with our initiatives. So, it is a meaningful number.\nBrian Vaccaro -- Raymond James -- Analyst\nAll right. I appreciate that color. And last one for me. Just thinking about that 2019 guidance, what are you seeing or expecting in terms of the food cost inflation outlook, commodity inflation? And did I hear correctly, marketing spend as a percent of sales might go up a little bit or I think you said spending might be up a little bit on marketing in 2019, Brian?\nBrian Jenkins -- Chief Executive Officer\nYeah. We're -- food inflation is up a little bit.\nJoe DeProspero -- Vice President of Finance and Interim Chief Financial Officer\nYeah. So first of all, food inflation for Q4 and for next year is, we expect some moderate inflation. But keep in mind, food costs for us is only about 8% of our sales, so it's less important for us. It's less of a factor for us as it is for casual dining, but once again relatively low inflation, as I'll call it, very low single digit in both Q4 and next year as well.\nBrian Vaccaro -- Raymond James -- Analyst\nMarketing?\nBrian Jenkins -- Chief Executive Officer\nYeah, marketing, I don't want to give the exact marketing number. We expect at the high-end of our range that we will still leverage a little bit, but, yeah, we will be increasing our marketing above kind of inflationary kind of pressures here, partly due to some incremental spend in digital, partly just to the environment in general and the marketing there in terms of pricing. So a little bit of leverage at the high-end. We're in the low 3% of overall as a percent of sales right now, and we're not really trying to produce that here too much right now. We've got some investments we're going to make in the digital space and we've had some success there and we think that's a good credit for our brand.\nOperator\n(Operator Instructions) We'll hear from Jeff Farmer with Gordon Haskett.\nJeffrey Farmer -- Gordon Haskett Research Advisors -- Analyst\nThank you. Just diving deeper into the Q4 numbers, what did same-store sales look like both during and after that six-week run of unlimited wings and games? And I guess just looking for how aggressive can you be with running that type of promotion in the future?\nBrian Jenkins -- Chief Executive Officer\nWell, I pretty much gave you the pickup that we got -- that we estimate the rise for unlimited wings by 100 bps. That promotion ran early in the quarter, Jeff, so clearly the first part of the quarter was strong. I indicated actually on our year-end call and now confirmed again today that weather and the calendar is a net positive and that too was in and around, let's call it, the December holiday period. So we were stronger in the front, that's what that says. The positive strength was in the front, the polar vortex in January that hit around Martin Luther King, that was a net negative force, so we gave back a little there. So that's a little -- give you a little color on the cadence, and, as I said, before we get into the spring break Easter shift here, we're pleased to be in positive comp territory at 1% to kick off this year as we shoot and move toward 0 to 1.5 to the full year. So...\nJeffrey Farmer -- Gordon Haskett Research Advisors -- Analyst\nOkay. That's helpful. And then it sounds like MENA (ph) productivity for that class of 2017 was greater than you had expected, assuming that's what I heard and heard that correctly, what's driving that strength?\nBrian Jenkins -- Chief Executive Officer\nWell, we had some stories on some pretty big DMA with big potential. And it was a great line of the store for us, no doubt. Our target -- our internal target is 35% year one, which we think is very, very strong target. I wouldn't condition yourself to a 60 plus, where we could be more happy with that class. But we think we had a great pipeline and we're targeting 35%. So...\nJeffrey Farmer -- Gordon Haskett Research Advisors -- Analyst\nOkay. And then just last question related again to some of the other MENA productivity, but as relates to competitive encroachment how has that impacted your site selection, your market selection strategy? Have you pivoted in any way so I get to help to offset some of that MENA productivity -- or those competitive encroachment headwinds, anything you can do on that front in terms of either what market you go to or where you open sites in any certain market?\nBrian Jenkins -- Chief Executive Officer\nWell, our view -- as I said, we're the leader in the space, we are a traffic donor to our landlords when we come into a space we are helpful. So we continue to get the first call. So our view is to continue to payoff (technical difficulty) is on our total addressable market list, which we've mapped out and continue to update each year and it is on our list. We're going to seize the day and we want to be on offense as it relates to the site and not give it over to a competitor. It doesn't mean we're going to prevent them from getting into a space and clearly they're coming up -- they're opening in and around our stores every day, but we, in our view, are getting the prime site, we get the first call and our view is that we're not going to slow down, we're not going to dial back, slow down and let a competitor take a swipe at that we want to open.\nJeffrey Farmer -- Gordon Haskett Research Advisors -- Analyst\nAll right. Thank you.\nBrian Jenkins -- Chief Executive Officer\nThank you.\nOperator\nOur next question comes from Jon Tower with Wells Fargo.\nJon Tower -- Wells Fargo Securities -- Analyst\nThere we going. Take it off mute. Thanks for taking the question.\nBrian Jenkins -- Chief Executive Officer\n(technical difficulty)\nJon Tower -- Wells Fargo Securities -- Analyst\nHere we go. On the marketing side of the equation, just going back to your spend on television, can you just talk about the evolution of your TV marketing spend? Your dollars have obviously grown over the past few years if that percentage -- that low percentage, 3% or so, the state-and-play (ph), so are you hitting the market or television airwaves with more effective TRPs than in the past or are you guys at similar level? And then thinking about the digital side, how should we think about your digital marketing presence? Will it be more of a call to action on social media or some of these platforms through either -- some offers on food or on Amusement? And then how should we think about your digital presence with it integrating into your mobile app relaunch in the latter half of this year?\nBrian Jenkins -- Chief Executive Officer\nThat's a lot of questions. Well, I did say pivot to digital. We have consistently advertised on national cable TV, moved it up over the years, and so historically the TRPs are pretty consistent. And if anything we've added on a week or two here or there over time, and we are pretty well covered in terms of media weeks as a brand, today -- as we sit here today. And my view is still that if we have a strong message, whether it be capital or games and/or value message, that can move the needle and drive traffic. So, we are not abandoning our TV -- national cable TV.\nWhat we are doing is, in a test and measure kind of environment, definitely leaning more into the digital environment. And I'm not going to -- for competitive reasons, I'm not going to give you our mix, but we are pivoting a meaningful amount away from TV into digital, but we want to make sure that it is paying back and we are -- our tendency is and what we've seen were tends to revolve around promotional messages more so than just content. And we've got probably the most success on our social media of work and problematic over the TV top (inaudible). So, if that's an evolving effort by our Head of Marketing and Marketing team, and I think we learn more each day on what works and what doesn't here and that's probably going to be measured in how we pivot and make sure we're investing in things that make sense for us.\nJon Tower -- Wells Fargo Securities -- Analyst\nOkay. And then just earlier, I think you'd mentioned in the call and maybe I misheard that that you're doing Unlimited Wing promotion again right now, is that correct?\nBrian Jenkins -- Chief Executive Officer\nYeah, we are doing really two elements of the Unlimited Wing video. Obviously, it was impactful. Our value message one is driven by the offering, if we can change the numerator, have a better offering, better guest experience and deliver that piece of the equation, we're definitely focused on that. Here the wing thing -- the wing offer shows that price can make a difference as well. And so -- and I think we need to do those things to drive people in and we were successful so -- with that promotion. So what we are doing right now is using that promotion to drive and try to build our Thursday Day, that day part, we have half price games on Wednesday, that's the biggest day of week day that we have. So we are looking to see if we can build back day of week with this combined offer and we are running that offer right now around March Madness on Monday's and Thursday's. I'm sorry, Sunday. We have two more days here coming up.\nJon Tower -- Wells Fargo Securities -- Analyst\nThank you. Appreciate it.\nBrian Jenkins -- Chief Executive Officer\nThank you.\nOperator\nWe'll now hear from Stephen Anderson with Maxim Group.\nStephen Anderson -- Maxim Group -- Analyst\nYes. Good afternoon.\nBrian Jenkins -- Chief Executive Officer\nGood afternoon.\nJoe DeProspero -- Vice President of Finance and Interim Chief Financial Officer\nHey, Stephen.\nStephen Anderson -- Maxim Group -- Analyst\nJust a quick question. I wondering -- have you talked about a potential for international expansion and I just wanted to ask about the progress on the location Middle East?\nBrian Jenkins -- Chief Executive Officer\nWell, candidly, I hope to have some news to report. Look, we still view International as a good long-term opportunity for our brand. We think it will translate very well. We are in discussions with a number of partners. We have a partner in the Middle East that's been going slower than we expected. So we're excited about the opportunity. Clearly, near-term, we're much more focused on our domestic business right now. We think it's a long term opportunity. It is going slower than we would hope right now.\nStephen Anderson -- Maxim Group -- Analyst\nThank you.\nBrian Jenkins -- Chief Executive Officer\nThank you.\nOperator\nThat will conclude today's question-and-answer session. I will now turn the conference over to Brian Jenkins for any additional or closing remarks.\nBrian Jenkins -- Chief Executive Officer\nWell, thank you for your time this afternoon. We look forward to reviewing our first quarter results with you in June. Guys, have a good night.\nJoe DeProspero -- Vice President of Finance and Interim Chief Financial Officer\nThank you.\nOperator\nThat will conclude today's conference call. Thank you for your participation. You may now disconnect.\nDuration: 59 minutes\nCall participants: Arvind Bhatia -- Senior Director of Investor Relations\nBrian Jenkins -- Chief Executive Officer\nJoe DeProspero -- Vice President of Finance and Interim Chief Financial Officer\nAndy Barish -- Jefferies -- Analyst\nNicole Miller Regan -- Piper Jaffray -- Analyst\nAndrew Strelzik -- BMO Capital Markets -- Analyst\nJake Bartlett -- SunTrust Robinson Humphrey, Inc. -- Analyst\nBrian Vaccaro -- Raymond James -- Analyst\nJeffrey Farmer -- Gordon Haskett Research Advisors -- Analyst\nJon Tower -- Wells Fargo Securities -- Analyst\nStephen Anderson -- Maxim Group -- Analyst\nMore PLAY analysis\nTranscript powered by AlphaStreet\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://www.alphastreet.com"], "entities": {"persons": [{"name": "jenkins", "sentiment": "none"}, {"name": "deprospero", "sentiment": "none"}, {"name": "arvind bhatia", "sentiment": "none"}, {"name": "brian jenkins", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "joe deprospero", "sentiment": "none"}], "organizations": [{"name": "dave & buster's entertainment inc", "sentiment": "neutral"}, {"name": "dave & buster's entertainment, inc.", "sentiment": "none"}, {"name": "dave & buster's entertainment, inc", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T06:06:35.004+03:00"}, {"thread": {"uuid": "5f45d950cba9e80d7f887050ae87dfe892d9eea7", "url": "https://www.businesswire.com/news/home/20190402006102/en/", "site_full": "www.businesswire.com", "site": "businesswire.com", "site_section": "", "site_categories": ["jewelry_making", "media", "hobbies_and_interests", "finance", "financial_news"], "section_title": "", "title": "RiverNorth Opportunistic Municipal Income Fund, Inc. Declares Monthly Distributions of $0.0917 Per Share | Business & Finance | manchestertimes.com", "title_full": "RiverNorth Opportunistic Municipal Income Fund, Inc. Declares Monthly Distributions of $0.0917 Per Share | Business & Finance | manchestertimes.com", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://bloximages.newyork1.vip.townnews.com/manchestertimes.com/content/tncms/custom/image/3fe49e04-4339-11e8-8636-b3accfd19e22.jpg", "performance_score": 0, "domain_rank": 5013, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "5f45d950cba9e80d7f887050ae87dfe892d9eea7", "url": "https://www.businesswire.com/news/home/20190402006102/en/", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "RiverNorth Opportunistic Municipal Income Fund, Inc. Declares Monthly Distributions of $0.0917 Per Share | Business & Finance | manchestertimes.com", "text": "RiverNorth Opportunistic Municipal Income Fund, Inc. Declares Monthly Distributions of $0.0917 Per Share 10 hrs ago Save\nCHICAGO--(BUSINESS WIRE)--Apr 2, 2019--RiverNorth Opportunistic Municipal Income Fund, Inc. (the “Fund”) (NYSE: RMI) announced the declaration of monthly distributions of $0.0917 per common share for the months of April, May and June 2019, payable on the dates noted below. In accordance with the level distribution policy, the rate has been set equal to 5.50% based on the Fund’s initial public offering price of $20.00 per share (as of market close on October 26, 2018), the distributions represent an annualized distribution rate of 5.50%.\nThe following dates apply to the distributions declared: $0.0917\nWith each distribution that does not consist solely of net investment income, the Fund will issue a notice to shareholders and an accompanying press release that will provide detailed information regarding the amount and composition of the distribution and other related information. The amounts and sources of distributions reported in the notice to shareholders are only estimates and are not being provided for tax reporting purposes. The actual amounts and sources of the amounts for tax reporting purposes will depend upon the Fund’s investment experience during its full fiscal year and may be subject to changes based on tax regulations. The Fund will send shareholders a Form 1099-DIV for the calendar year that will tell them how to report these distributions for federal income tax purposes.\nThe Fund may at times distribute more than its net investment income and net realized capital gains; therefore, a portion of the distribution may result in a return of capital. A return of capital occurs when some or all of the money that shareholders invested in the Fund is paid back to them. A return of capital does not necessarily reflect the Fund’s investment performance and should not be confused with ‘yield’ or ‘income.’ Any such returns of capital will decrease the Fund’s total assets and, therefore, could have the effect of increasing the Fund’s expense ratio. In addition, in order to make the level of distributions called for under its plan, the Fund may have to sell its portfolio securities at a less than opportune time.\nAbout RiverNorth\nRiverNorth Capital Management, LLC is an investment management firm founded in 2000. With $3.5 billion 1 in assets under management as of February 28, 2019, RiverNorth specializes in opportunistic investment strategies in niche markets where the potential to exploit inefficiencies is greatest. RiverNorth is an institutional investment manager to registered funds, private funds and separately managed accounts.\n1 Firm AUM reflects Managed Assets, which includes assets attributable to leverage.\nThis data is for information only and should not be construed as an official tax form, nor should it be considered tax or investment advice. RiverNorth is not a tax advisor and investors should consult a tax professional for guidance regarding their specific tax situation. When preparing your tax return, please refer to your Form 1099-DIV and consult your legal or tax advisor.\nA portion of the distribution may be treated as paid from sources other than net income, including but not limited to short‐term capital gain, long‐term capital gain and return of capital.\nPast performance is no guarantee of future results.\nInvestors should consider the Fund's investment objective, risks, charges and expenses carefully before investing. The prospectus should be read carefully before investing. For more information, please read the prospectus, call your financial professional or call 844.569.4750.\nThe Fund is a closed-end fund, and closed-end funds do not continuously issue shares for sale as open-end mutual funds do. Since the initial public offering has closed, the Fund now trades in the secondary market. Investors wishing to buy or sell shares need to place orders through an intermediary or broker. The share price of a closed-end fund is based on the market's value.\nShares of closed-end investment companies frequently trade at a discount to their net asset value and initial offering price. The risk of loss due to this discount may be greater for initial investors expecting to sell their shares in a relatively short period after completion of the initial public offering.\nAn investment in the Fund is not appropriate for all investors and is not intended to be a complete investment program. The Fund is designed as a long-term investment and not as a trading vehicle.\nRisk is inherent in all investing. Investing in any investment company security involves risk, including the risk that you may receive little or no return on your investment or even that you may lose part or all of your investment. Therefore, before investing in the common shares of the Fund, you should consider the risks as well as the other information in the prospectus.\n1 Firm AUM reflects Managed Assets, which includes assets attributable to leverage.\nNot FDIC Insured | May Lose Value | No Bank Guarantee\nRiverNorth® is a registered trademark of RiverNorth Capital Management, LLC.\n©2000-2019 RiverNorth Capital Management, LLC. All rights reserved.\nView source version on businesswire.com : https://www.businesswire.com/news/home/20190402006102/en/\nCONTACT: Investor Contact ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "rivernorth opportunistic municipal income fund, inc", "sentiment": "neutral"}, {"name": "rmi", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T06:20:15.006+03:00"}, {"thread": {"uuid": "62aaca494d1a46938ce28f658ae13cf4402e22ad", "url": "https://www.businesswire.com/news/home/20190402006100/en/", "site_full": "www.businesswire.com", "site": "businesswire.com", "site_section": "", "site_categories": ["jewelry_making", "media", "hobbies_and_interests", "finance", "financial_news"], "section_title": "", "title": "AT&T INVESTOR REMINDER: Rosen Law Firm Reminds AT&T Inc. Investors of Important May 31st Deadline in Securities Class Action Lawsuit; Investors with Losses in Excess of $100K are Encouraged to Contact the Firm – T | Business & Finance | manchestertimes.com", "title_full": "AT&T INVESTOR REMINDER: Rosen Law Firm Reminds AT&T Inc. Investors of Important May 31st Deadline in Securities Class Action Lawsuit; Investors with Losses in Excess of $100K are Encouraged to Contact the Firm – T | Business & Finance | manchestertimes.com", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://bloximages.newyork1.vip.townnews.com/manchestertimes.com/content/tncms/custom/image/3fe49e04-4339-11e8-8636-b3accfd19e22.jpg", "performance_score": 0, "domain_rank": 5013, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "62aaca494d1a46938ce28f658ae13cf4402e22ad", "url": "https://www.businesswire.com/news/home/20190402006100/en/", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "AT&T INVESTOR REMINDER: Rosen Law Firm Reminds AT&T Inc. Investors of Important May 31st Deadline in Securities Class Action Lawsuit; Investors with Losses in Excess of $100K are Encouraged to Contact the Firm – T | Business & Finance | manchestertimes.com", "text": "Save\nNEW YORK--(BUSINESS WIRE)--Apr 2, 2019--Rosen Law Firm, a global investor rights law firm, reminds AT&T Inc. (NYSE: T) shareholders who: (a) acquired AT&T common stock pursuant or traceable to the SEC Form S-4 registration statement and prospectus (collectively, the “Registration Statement”) issued in connection with AT&T’s June 2018 acquisition of and merger with Time Warner, Inc. (the “Acquisition”); and/or (b) purchased or otherwise acquired AT&T securities between October 22, 2016 and October 24, 2018, both dates inclusive (the “Class Period”) of the important May 31, 2019 lead plaintiff deadline in the class action. The lawsuit seeks to recover damages for AT&T investors under the federal securities laws.\nTo join the AT&T class action, go to https://www.rosenlegal.com/cases-register-1517.html or call Phillip Kim, Esq. toll-free at 866-767-3653 or email for information on the class action.\nNO CLASS HAS YET BEEN CERTIFIED IN THE ABOVE ACTION. UNTIL A CLASS IS CERTIFIED, YOU ARE NOT REPRESENTED BY COUNSEL UNLESS YOU RETAIN ONE. YOU MAY RETAIN COUNSEL OF YOUR CHOICE. YOU MAY ALSO REMAIN AN ABSENT CLASS MEMBER AND DO NOTHING AT THIS POINT. AN INVESTOR’S ABILITY TO SHARE IN ANY POTENTIAL FUTURE RECOVERY IS NOT DEPENDENT UPON SERVING AS LEAD PLAINTIFF.\nAccording to the lawsuit, defendants throughout the Class Period made false and/or misleading statements and/or failed to disclose that: (1) AT&T had substantially increased prices, while at the same time discontinuing promotional discounts for its DirecTV Now service; (2) as a result, DirecTV Now subscribers were leaving ( i.e. , not renewing) as soon as their promotional discount periods expired, while at the same time new potential DirecTV Now customers were unwilling to pay the higher prices and therefore not subscribing at all; and (3) as a result, AT&T’s public statements were materially false and misleading at all relevant times. When the true details entered the market, the lawsuit claims that investors suffered damages.\nA class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than May 31, 2019. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. If you wish to join the litigation, go to https://www.rosenlegal.com/cases-register-1517.html or to discuss your rights or interests regarding this class action, please contact Phillip Kim, Esq. of Rosen Law Firm toll free at 866-767-3653 or via e-mail at .\nFollow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm , on Twitter: https://twitter.com/rosen—firm or on Facebook: https://www.facebook.com/rosenlawfirm/ .\nRosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 3 each year since 2013.\nView source version on businesswire.com : https://www.businesswire.com/news/home/20190402006100/en/\nCONTACT: Laurence Rosen, Esq.\nThe Rosen Law Firm, P.A.\n275 Madison Avenue, 34thFloor ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "rosen", "sentiment": "negative"}, {"name": "rosen law firm", "sentiment": "negative"}, {"name": "phillip kim", "sentiment": "none"}], "organizations": [{"name": "at&t inc", "sentiment": "negative"}, {"name": "at&t", "sentiment": "negative"}, {"name": "sec", "sentiment": "none"}, {"name": "at&t inc.", "sentiment": "none"}, {"name": "time warner, inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "esq.", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T06:20:31.003+03:00"}, {"thread": {"uuid": "c0741b021f0ba90708f15ae3dfb9c23aeb78bb49", "url": "https://www.businesswire.com/news/home/20190402006091/en/", "site_full": "www.businesswire.com", "site": "businesswire.com", "site_section": "", "site_categories": ["jewelry_making", "media", "hobbies_and_interests", "finance", "financial_news"], "section_title": "", "title": "INVESTOR ALERT: Rosen Law Firm Reminds Healthcare Services Group, Inc. Investors of Important Deadline in Securities Class Action Lawsuit – HCSG | Business & Finance | manchestertimes.com", "title_full": "INVESTOR ALERT: Rosen Law Firm Reminds Healthcare Services Group, Inc. Investors of Important Deadline in Securities Class Action Lawsuit – HCSG | Business & Finance | manchestertimes.com", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://bloximages.newyork1.vip.townnews.com/manchestertimes.com/content/tncms/custom/image/3fe49e04-4339-11e8-8636-b3accfd19e22.jpg", "performance_score": 0, "domain_rank": 5013, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "c0741b021f0ba90708f15ae3dfb9c23aeb78bb49", "url": "https://www.businesswire.com/news/home/20190402006091/en/", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "INVESTOR ALERT: Rosen Law Firm Reminds Healthcare Services Group, Inc. Investors of Important Deadline in Securities Class Action Lawsuit – HCSG | Business & Finance | manchestertimes.com", "text": "Save\nNEW YORK--(BUSINESS WIRE)--Apr 2, 2019--Rosen Law Firm, a global investor rights law firm, reminds purchasers of the securities of Healthcare Services Group, Inc. (NASDAQ:HCSG) from April 11, 2017 through March 4, 2019, inclusive (the “Class Period”) of the important May 21, 2019 lead plaintiff deadline in the class action. The lawsuit seeks to recover damages for Healthcare Services investors under the federal securities laws.\nTo join the Healthcare Services Group, Inc. class action, go to https://www.rosenlegal.com/cases-register-1526.html or call Phillip Kim, Esq. toll-free at 866-767-3653 or email for information on the class action.\nNO CLASS HAS YET BEEN CERTIFIED IN THE ABOVE ACTION. UNTIL A CLASS IS CERTIFIED, YOU ARE NOT REPRESENTED BY COUNSEL UNLESS YOU RETAIN ONE. YOU MAY RETAIN COUNSEL OF YOUR CHOICE. YOU MAY ALSO REMAIN AN ABSENT CLASS MEMBER AND DO NOTHING AT THIS POINT. AN INVESTOR’S ABILITY TO SHARE IN ANY POTENTIAL FUTURE RECOVERY IS NOT DEPENDENT UPON SERVING AS LEAD PLAINTIFF.\nAccording to the lawsuit, defendants throughout the Class Period made false and/or misleading statements and/or failed to disclose that: (1) Healthcare Services’ CEO either knew or was reckless in not knowing that Healthcare Services had been accused of strategically rounding quarterly earnings per share, and therefore investors could not rely upon the company’s track record without a thorough investigation into the allegations; (2) defendants concealed that the SEC had written to Healthcare Services in November 2017 to inquire into the company’s earnings per share rounding practices; and (3) Healthcare Services concealed that the SEC delivered a subpoena to the company in March 2018 demanding the production of documents in connection with how Healthcare Services calculated earnings per share. When the true details entered the market, the lawsuit claims that investors suffered damages.\nA class action lawsuit has already been filed. If you wish to serve as lead plaintiff, you must move the Court no later than May 21, 2019. A lead plaintiff is a representative party acting on behalf of other class members in directing the litigation. If you wish to join the litigation, go to https://www.rosenlegal.com/cases-register-1526.html or to discuss your rights or interests regarding this class action, please contact Phillip Kim, Esq. of Rosen Law Firm toll free at 866-767-3653 or via e-mail at .\nFollow us for updates on LinkedIn: https://www.linkedin.com/company/the-rosen-law-firm , on Twitter: https://twitter.com/rosen—firm or on Facebook: https://www.facebook.com/rosenlawfirm/ .\nRosen Law Firm represents investors throughout the globe, concentrating its practice in securities class actions and shareholder derivative litigation. Rosen Law Firm was Ranked No. 1 by ISS Securities Class Action Services for number of securities class action settlements in 2017. The firm has been ranked in the top 3 each year since 2013.\nView source version on businesswire.com : https://www.businesswire.com/news/home/20190402006091/en/\nCONTACT: Laurence Rosen, Esq.\nThe Rosen Law Firm, P.A.\n275 Madison Avenue, 34thFloor ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "rosen law firm", "sentiment": "negative"}, {"name": "phillip kim", "sentiment": "none"}], "organizations": [{"name": "rosen law firm reminds healthcare services group, inc", "sentiment": "neutral"}, {"name": "healthcare services", "sentiment": "none"}, {"name": "healthcare services group, inc.", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "esq.", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T06:21:15.021+03:00"}, {"thread": {"uuid": "d5da1df0224f44d22253716012cd5b39a1f4571b", "url": "https://www.zacks.com/stock/news/368655/twilio-inc-twlo-stock-sinks-as-market-gains-what-you-should-know", "site_full": "www.zacks.com", "site": "zacks.com", "site_section": "http://feed.zacks.com/commentary/AllStories/rss", "site_categories": ["financial_news", "finance", "mutual_funds"], "section_title": "Zacks Investment Research - All Commentary Articles", "title": "Twilio Inc. (TWLO) Stock Sinks As Market Gains: What You Should Know", "title_full": "Twilio Inc. (TWLO) Stock Sinks As Market Gains: What You Should Know", "published": "2019-04-02T00:45:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://staticx-tuner.zacks.com/images/default_article_images/default62.jpg", "performance_score": 0, "domain_rank": 8414, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "d5da1df0224f44d22253716012cd5b39a1f4571b", "url": "https://www.zacks.com/stock/news/368655/twilio-inc-twlo-stock-sinks-as-market-gains-what-you-should-know", "ord_in_thread": 0, "author": "Zacks Equity Research", "published": "2019-04-02T00:45:00.000+03:00", "title": "Twilio Inc. (TWLO) Stock Sinks As Market Gains: What You Should Know", "text": "You follow Tale of the Tape - edit You follow Zacks Equity Research - edit What would you like to follow? Zacks Equity Research Cancel Read More Hide Full Article\nTwilio Inc. ( TWLO - Free Report ) closed the most recent trading day at $127.65, moving -1.18% from the previous trading session. This change lagged the S&P 500's 1.16% gain on the day. Meanwhile, the Dow gained 1.27%, and the Nasdaq, a tech-heavy index, added 1.29%.\nHeading into today, shares of the company had gained 6.15% over the past month, outpacing the Computer and Technology sector's gain of 3.18% and the S&P 500's gain of 1.92% in that time.\nWall Street will be looking for positivity from TWLO as it approaches its next earnings report date. The company is expected to report EPS of $0.01, up 125% from the prior-year quarter. Meanwhile, our latest consensus estimate is calling for revenue of $223.42 million, up 73.03% from the prior-year quarter.\nTWLO's full-year Zacks Consensus Estimates are calling for earnings of $0.11 per share and revenue of $1.07 billion. These results would represent year-over-year changes of 0% and +64.78%, respectively.\nInvestors might also notice recent changes to analyst estimates for TWLO. These recent revisions tend to reflect the evolving nature of short-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 1.89% lower within the past month. TWLO currently has a Zacks Rank of #3 (Hold).\nValuation is also important, so investors should note that TWLO has a Forward P/E ratio of 1174.36 right now. For comparison, its industry has an average Forward P/E of 56.37, which means TWLO is trading at a premium to the group.\nInvestors should also note that TWLO has a PEG ratio of 64.6 right now. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Internet - Software was holding an average PEG ratio of 3.14 at yesterday's closing price.\nThe Internet - Software industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 56, putting it in the top 22% of all 250+ industries.\nThe Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nTo follow TWLO in the coming trading sessions, be sure to utilize Zacks.com. In-Depth Zacks Research for the Tickers Above Normally $25 each - click below to receive one report FREE:", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "twlo", "sentiment": "negative"}, {"name": "zacks equity research", "sentiment": "negative"}, {"name": "twilio inc.", "sentiment": "negative"}, {"name": "zacks equity research cancel read more hide full article twilio inc.", "sentiment": "none"}, {"name": "s&p 500", "sentiment": "none"}, {"name": "zacks consensus estimates", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T07:56:34.048+03:00"}, {"thread": {"uuid": "622b1f29529ee2485349cf8c25b86395186098ee", "url": "https://www.zacks.com/stock/news/368664/aurora-cannabis-inc-acb-outpaces-stock-market-gains-what-you-should-know", "site_full": "www.zacks.com", "site": "zacks.com", "site_section": "http://feed.zacks.com/commentary/AllStories/rss", "site_categories": ["financial_news", "finance", "mutual_funds"], "section_title": "Zacks Investment Research - All Commentary Articles", "title": "Aurora Cannabis Inc. (ACB) Outpaces Stock Market Gains: What You Should Know", "title_full": "Aurora Cannabis Inc. (ACB) Outpaces Stock Market Gains: What You Should Know", "published": "2019-04-02T00:45:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://staticx-tuner.zacks.com/images/default_article_images/default202.jpg", "performance_score": 0, "domain_rank": 8414, "social": {"facebook": {"likes": 1, "comments": 1, "shares": 1}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "622b1f29529ee2485349cf8c25b86395186098ee", "url": "https://www.zacks.com/stock/news/368664/aurora-cannabis-inc-acb-outpaces-stock-market-gains-what-you-should-know", "ord_in_thread": 0, "author": "Zacks Equity Research", "published": "2019-04-02T00:45:00.000+03:00", "title": "Aurora Cannabis Inc. (ACB) Outpaces Stock Market Gains: What You Should Know", "text": "You follow Tale of the Tape - edit You follow Zacks Equity Research - edit What would you like to follow? Zacks Equity Research Cancel Read More Hide Full Article\nIn the latest trading session, Aurora Cannabis Inc. ( ACB - Free Report ) closed at $9.18, marking a +1.32% move from the previous day. This change outpaced the S&P 500's 1.16% gain on the day. Meanwhile, the Dow gained 1.27%, and the Nasdaq, a tech-heavy index, added 1.29%.\nHeading into today, shares of the company had gained 19.84% over the past month, outpacing the Medical sector's gain of 1.35% and the S&P 500's gain of 1.92% in that time.\nInvestors will be hoping for strength from ACB as it approaches its next earnings release. In that report, analysts expect ACB to post earnings of -$0.05 per share. This would mark a year-over-year decline of 25%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $61.42 million, up 382.06% from the year-ago period.\nLooking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of -$0.17 per share and revenue of $224.47 million. These totals would mark changes of -241.67% and +417.53%, respectively, from last year.\nAny recent changes to analyst estimates for ACB should also be noted by investors. These revisions help to show the ever-changing nature of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\nOur research shows that these estimate changes are directly correlated with near-term stock prices. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 5.05% lower. ACB currently has a Zacks Rank of #3 (Hold).\nThe Medical - Products industry is part of the Medical sector. This group has a Zacks Industry Rank of 81, putting it in the top 32% of all 250+ industries.\nThe Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nTo follow ACB in the coming trading sessions, be sure to utilize Zacks.com. In-Depth Zacks Research for the Tickers Above Normally $25 each - click below to receive one report FREE:", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "acb", "sentiment": "negative"}, {"name": "zacks equity research", "sentiment": "negative"}, {"name": "aurora cannabis inc.", "sentiment": "negative"}, {"name": "s&p 500", "sentiment": "none"}, {"name": "zacks consensus estimates", "sentiment": "none"}, {"name": "zacks consensus estimate", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T07:56:47.012+03:00"}, {"thread": {"uuid": "70f2b910619bc5c921d0f9764251ef6908cce6c5", "url": "https://www.zacks.com/stock/news/368660/apple-aapl-gains-but-lags-market-what-you-should-know", "site_full": "www.zacks.com", "site": "zacks.com", "site_section": "http://feed.zacks.com/commentary/AllStories/rss", "site_categories": ["financial_news", "finance", "mutual_funds"], "section_title": "Zacks Investment Research - All Commentary Articles", "title": "Apple (AAPL) Gains But Lags Market: What You Should Know", "title_full": "Apple (AAPL) Gains But Lags Market: What You Should Know", "published": "2019-04-02T00:45:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://staticx-tuner.zacks.com/images/default_article_images/default90.jpg", "performance_score": 0, "domain_rank": 8414, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "70f2b910619bc5c921d0f9764251ef6908cce6c5", "url": "https://www.zacks.com/stock/news/368660/apple-aapl-gains-but-lags-market-what-you-should-know", "ord_in_thread": 0, "author": "Zacks Equity Research", "published": "2019-04-02T00:45:00.000+03:00", "title": "Apple (AAPL) Gains But Lags Market: What You Should Know", "text": "You follow Tale of the Tape - edit You follow Zacks Equity Research - edit What would you like to follow? Zacks Equity Research Cancel Read More Hide Full Article\nApple ( AAPL - Free Report ) closed the most recent trading day at $191.08, moving +0.59% from the previous trading session. This change lagged the S&P 500's 1.16% gain on the day. Meanwhile, the Dow gained 1.27%, and the Nasdaq, a tech-heavy index, added 1.29%.\nHeading into today, shares of the maker of iPhones, iPads and other products had gained 9.7% over the past month, outpacing the Computer and Technology sector's gain of 3.18% and the S&P 500's gain of 1.92% in that time.\nWall Street will be looking for positivity from AAPL as it approaches its next earnings report date. On that day, AAPL is projected to report earnings of $2.37 per share, which would represent a year-over-year decline of 13.19%. Meanwhile, our latest consensus estimate is calling for revenue of $57.60 billion, down 5.79% from the prior-year quarter.\nFor the full year, our Zacks Consensus Estimates are projecting earnings of $11.41 per share and revenue of $254.70 billion, which would represent changes of -4.2% and -4.1%, respectively, from the prior year.\nInvestors might also notice recent changes to analyst estimates for AAPL. Recent revisions tend to reflect the latest near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.17% higher. AAPL is holding a Zacks Rank of #3 (Hold) right now.\nLooking at its valuation, AAPL is holding a Forward P/E ratio of 16.65. For comparison, its industry has an average Forward P/E of 17.5, which means AAPL is trading at a discount to the group.\nInvestors should also note that AAPL has a PEG ratio of 1.94 right now. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Computer - Mini computers was holding an average PEG ratio of 2.7 at yesterday's closing price.\nThe Computer - Mini computers industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 47, putting it in the top 19% of all 250+ industries.\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nYou can find more information on all of these metrics, and much more, on Zacks.com. In-Depth Zacks Research for the Tickers Above Normally $25 each - click below to receive one report FREE:", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "zacks equity research", "sentiment": "negative"}, {"name": "aapl", "sentiment": "none"}, {"name": "s&p 500", "sentiment": "none"}, {"name": "zacks consensus estimates", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T07:57:08.022+03:00"}, {"thread": {"uuid": "b2fe5399d5db3caab20bb9751537852ef3f41153", "url": "https://www.zacks.com/stock/news/368672/funko-inc-fnko-stock-sinks-as-market-gains-what-you-should-know", "site_full": "www.zacks.com", "site": "zacks.com", "site_section": "http://feed.zacks.com/commentary/AllStories/rss", "site_categories": ["financial_news", "finance", "mutual_funds"], "section_title": "Zacks Investment Research - All Commentary Articles", "title": "Funko, Inc. (FNKO) Stock Sinks As Market Gains: What You Should Know", "title_full": "Funko, Inc. (FNKO) Stock Sinks As Market Gains: What You Should Know", "published": "2019-04-02T00:45:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://staticx-tuner.zacks.com/images/default_article_images/default319.jpg", "performance_score": 0, "domain_rank": 8414, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "b2fe5399d5db3caab20bb9751537852ef3f41153", "url": "https://www.zacks.com/stock/news/368672/funko-inc-fnko-stock-sinks-as-market-gains-what-you-should-know", "ord_in_thread": 0, "author": "Zacks Equity Research", "published": "2019-04-02T00:45:00.000+03:00", "title": "Funko, Inc. (FNKO) Stock Sinks As Market Gains: What You Should Know", "text": "You follow Tale of the Tape - edit You follow Zacks Equity Research - edit What would you like to follow? Zacks Equity Research Cancel Read More Hide Full Article\nFunko, Inc. ( FNKO - Free Report ) closed the most recent trading day at $21.67, moving -0.23% from the previous trading session. This change lagged the S&P 500's 1.16% gain on the day. Meanwhile, the Dow gained 1.27%, and the Nasdaq, a tech-heavy index, added 1.29%.\nHeading into today, shares of the company had gained 9.2% over the past month, outpacing the Consumer Discretionary sector's loss of 0.84% and the S&P 500's gain of 1.92% in that time.\nWall Street will be looking for positivity from FNKO as it approaches its next earnings report date. On that day, FNKO is projected to report earnings of $0.09 per share, which would represent year-over-year growth of 200%. Our most recent consensus estimate is calling for quarterly revenue of $158.61 million, up 15.6% from the year-ago period.\nFNKO's full-year Zacks Consensus Estimates are calling for earnings of $1.10 per share and revenue of $818.38 million. These results would represent year-over-year changes of +34.15% and +19.28%, respectively.\nAny recent changes to analyst estimates for FNKO should also be noted by investors. These recent revisions tend to reflect the evolving nature of short-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\nRanging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Within the past 30 days, our consensus EPS projection has moved 17.09% higher. FNKO currently has a Zacks Rank of #3 (Hold).\nIn terms of valuation, FNKO is currently trading at a Forward P/E ratio of 19.75. For comparison, its industry has an average Forward P/E of 15.02, which means FNKO is trading at a premium to the group.\nInvestors should also note that FNKO has a PEG ratio of 1.14 right now. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. Consumer Products - Discretionary stocks are, on average, holding a PEG ratio of 1.32 based on yesterday's closing prices.\nThe Consumer Products - Discretionary industry is part of the Consumer Discretionary sector. This industry currently has a Zacks Industry Rank of 200, which puts it in the bottom 22% of all 250+ industries.\nThe Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nYou can find more information on all of these metrics, and much more, on Zacks.com. In-Depth Zacks Research for the Tickers Above Normally $25 each - click below to receive one report FREE:", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "zacks equity research", "sentiment": "negative"}, {"name": "funko, inc.", "sentiment": "neutral"}, {"name": "s&p 500", "sentiment": "none"}, {"name": "zacks consensus estimates", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "fnko", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T07:58:15.013+03:00"}, {"thread": {"uuid": "2b5bee22abd90e1b9d9f8812056c6e6628390ba7", "url": "https://www.zacks.com/stock/news/368649/apple-aapl-stock-outlook-q2-earnings-iphone-sales-amp-services-growth", "site_full": "www.zacks.com", "site": "zacks.com", "site_section": "http://feed.zacks.com/commentary/AllStories/rss", "site_categories": ["financial_news", "finance", "mutual_funds"], "section_title": "Zacks Investment Research - All Commentary Articles", "title": "Apple (AAPL) Stock Outlook: Q2 Earnings, iPhone Sales & Services Growth", "title_full": "Apple (AAPL) Stock Outlook: Q2 Earnings, iPhone Sales & Services Growth", "published": "2019-04-01T23:56:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://staticx-tuner.zacks.com//images/articles/main/5a/55.jpg", "performance_score": 0, "domain_rank": 8414, "social": {"facebook": {"likes": 1, "comments": 0, "shares": 17}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "2b5bee22abd90e1b9d9f8812056c6e6628390ba7", "url": "https://www.zacks.com/stock/news/368649/apple-aapl-stock-outlook-q2-earnings-iphone-sales-amp-services-growth", "ord_in_thread": 0, "author": "Benjamin Rains", "published": "2019-04-01T23:56:00.000+03:00", "title": "Apple (AAPL) Stock Outlook: Q2 Earnings, iPhone Sales & Services Growth", "text": "You follow Stocks in the News - edit You follow Benjamin Rains - edit What would you like to follow? Benjamin Rains Cancel Read More Hide Full Article\nShares of Apple ( AAPL - Free Report ) have climbed over 20% this year, along with FAANG peers Netflix ( NFLX - Free Report ) and Facebook ( FB - Free Report ) , to outpace the S&P 500’s 13% jump. Apple and CEO Tim Cook hope that new Services like Apple TV+ will propel long-term growth for the tech titan. But despite its new offerings and its 2019 climb, Apple’s near-term outlook appears rough, especially in terms of iPhone sales.\nRecent News & Overview\nApple just recently lowered the price of many of its products, including iPhones, iPads, Macs, and AirPods, on its online store in China, according to multiple reports. Prices on these products were lowered by roughly 6% on average and come after official Chinese third-party Apple sellers such as Alibaba’s ( BABA - Free Report ) Tmall and JD.com ( JD - Free Report ) lowered some Apple prices earlier this year. Apple’s new price cuts have been attributed to the recent reduction of a value-added tax in China from 16% to 13%.\nIt is unclear if Apple’s lower prices will positively impact sales in the market that has for years offered a range of much less expensive smartphones from the likes of Xiaomi and Huawei. Investors might remember that Apple stock plummeted at the start of the year after Cook warned shareholders of a major slowdown in China and lower-than-anticipated iPhone sales.\nAAPL’s first-quarter revenue ended up falling 4.5%, driven by a 15% drop off in iPhone sales and a 27% decline in revenue in Greater China. The world’s second-largest economy, which includes Hong Kong and Taiwan, accounted for roughly 16% of quarterly sales, while iPhone sales were responsible for 61% of Q1 revenue.\nSince the disappointing quarter, Apple has focused on its Services future. The company last week unveiled its long-awaited streaming TV platform that hopes to one day compete alongside Amazon ( AMZN - Free Report ) Prime, Netflix, Hulu, and Disney’s ( DIS - Free Report ) soon-to-launched streaming service. Apple also showed off its $9.99 per month, magazine-heavy news service, a new Apple credit card in partnership with Goldman Sachs ( GS - Free Report ) , and a subscription-based gaming offering called Apple Arcade.\nOutlook\nApple’s Services business has been closely watched by Wall Street for years, but the unit that includes Spotify ( SPOT - Free Report ) competitor, Apple Music and more, will face even more scrutiny going forward. But before we look at what to expect from Services, let’s see how Apple’s biggest units are projected to perform this quarter.\nOverall, Apple’s adjusted second-quarter earnings are projected to sink 13.2% on the back of a 5.8% decrease in quarterly revenue. Peeking further ahead, Apple’s full-year 2019 revenue is expected to dip 4.1%, with its adjusted EPS figure projected to fall at a similar rate.\nMore specially, Q2 iPhone revenue is projected to tumble roughly 19.5% from $38.03 billion in the year-ago period to $30.57 billion, based on our current NFM estimate. This would mark a larger year over year decline in Apple’s most important business than Q1. Meanwhile, Apple’s Services unit is projected to jump nearly 23% from $9.19 billion to reach $11.29 billion. Investors will likely be pleased to note that this estimate comes in above Q1’s 20% Services growth.\nBottom Line\nAs we mentioned at the top, shares of Apple have climbed over 20% this year. With that said, AAPL stock still rests 18% below its 52-week high of $233.47 per share. This gives the stock more room to run heading into its second-quarter earnings release, which is expected in early May.\nApple is currently a Zacks Rank #3 (Hold) based on its mixed earnings estimate revision activity. The company clearly faces a substantial downturn ahead. But if investors and Wall Street know to expect lower iPhone sales and top and bottom-line declines, there might be a better chance that Services growth can help propel the stock forward.\nApple’s overall near-term outlook could be hard for some to swallow, but the iPhone market is still one of the world’s largest companies. Therefore, along with its massive pile of cash, its quarterly dividend, and industry-matching valuation, Apple stock might be worth buying or holding onto.\nZacks' Top 10 Stocks for 2019 In addition to the stocks discussed above, wouldn't you like to know about our 10 finest buy-and-holds for the year?From more than 4,000 companies covered by the Zacks Rank, these 10 were picked by a process that consistently beats the market. Even during 2018 while the market dropped -5.2%, our Top 10s were up well into double-digits. And during bullish 2012 – 2017, they soared far above the market's +126.3%, reaching +181.9%.This year, the portfolio features a player that thrives on volatility, an AI comer, and a dynamic tech company that helps doctors deliver better patient outcomes at lower costs. In-Depth Zacks Research for the Tickers Above Normally $25 each - click below to receive one report FREE:", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://www.cnbc.com/2019/04/01/apple-slashes-iphone-prices-in-china-by-as-much-as-5percent.html"], "entities": {"persons": [{"name": "benjamin rains", "sentiment": "negative"}, {"name": "tim cook", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "aapl", "sentiment": "negative"}, {"name": "netflix", "sentiment": "none"}, {"name": "nflx", "sentiment": "none"}, {"name": "recent news & overview apple", "sentiment": "none"}, {"name": "faang", "sentiment": "none"}, {"name": "alibaba", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T07:58:47.045+03:00"}, {"thread": {"uuid": "71b0695b03709c57aedb7efde81d763a0475d2cf", "url": "https://www.fsis.usda.gov/wps/portal/fsis/topics/recalls-and-public-health-alerts/recall-case-archive/archive/2019/recall-040-2019-release", "site_full": "www.fsis.usda.gov", "site": "usda.gov", "site_section": "", "site_categories": ["education", "law_government_and_politics", "business", "us_government_resources"], "section_title": "", "title": "AdvancePierre Foods, Inc. Recalls Frozen Beef Patties due to Possible Foreign Matter Contamination", "title_full": "AdvancePierre Foods, Inc. Recalls Frozen Beef Patties due to Possible Foreign Matter Contamination", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.809, "main_image": "", "performance_score": 1, "domain_rank": 2543, "social": {"facebook": {"likes": 27, "comments": 3, "shares": 161}, "gplus": {"shares": 0}, "pinterest": {"shares": 1}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "71b0695b03709c57aedb7efde81d763a0475d2cf", "url": "https://www.fsis.usda.gov/wps/portal/fsis/topics/recalls-and-public-health-alerts/recall-case-archive/archive/2019/recall-040-2019-release", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "AdvancePierre Foods, Inc. Recalls Frozen Beef Patties due to Possible Foreign Matter Contamination", "text": "AdvancePierre Foods, Inc. Recalls Frozen Beef Patties due to Possible Foreign Matter Contamination Class II Recall 040-2019 Health Risk: Low Apr 2, 2019 Congressional and Public Affairs (202) 720-9113 WASHINGTON, April 2, 2019 – AdvancePierre Foods, Inc., an Enid, Okla. establishment, is recalling approximately 20,373 pounds of ready-to-eat (RTE) beef patties that may be contaminated with extraneous materials, specifically soft purple plastic, the U.S. Department of Agriculture’s Food Safety and Inspection Service (FSIS) announced today. The frozen RTE flame broiled beef patties were produced on Nov. 30, 2018. The following products are subject to recall: [ View labels (PDF only)} 14.06-lb. cases containing three bags with 30 pieces for a total of 90 portions of “CN FULLY COOKED FLAMEBROILED BEEF PATTIES CARAMEL COLOR ADDED” with case code 155-525-0 and package code 8334. The products subject to recall bear establishment number “EST. 2260E” inside the USDA mark of inspection. These items were shipped to food service locations nationwide. While the product was distributed to schools, it resulted from a commercial sale and was not part of food provided by the USDA for the National School Lunch Program. The problem was discovered on April 1, 2019 after the firm received two consumer complaints regarding soft purple plastic found in the product. There have been no confirmed reports of adverse reactions due to consumption of these products. Anyone concerned about an injury or illness should contact a healthcare provider. FSIS is concerned that some product may be frozen and in food service freezers. Food service locations who have purchased these products are urged not to serve or consume them. These products should be thrown away or returned to the place of purchase. FSIS routinely conducts recall effectiveness checks to verify recalling firms notify their customers of the recall and that steps are taken to make certain that the product is no longer available to consumers. Consumers with questions about the recall can contact AdvancePierre’s Consumer Affairs Hotline at (855) 382-3101. Members of the media with questions about the recall can contact Worth Sparkman, Senior Communications Manager with AdvancePierre, at (479) 290-6358. Consumers with food safety questions can \"Ask Karen,\" the FSIS virtual representative available 24 hours a day at AskKaren.gov or via smartphone at m.askkaren.gov . The toll-free USDA Meat and Poultry Hotline 1-888-MPHotline (1-888-674-6854) is available in English and Spanish and can be reached from 10 a.m. to 6 p.m. (Eastern Time) Monday through Friday. Recorded food safety messages are available 24 hours a day. The online Electronic Consumer Complaint Monitoring System can be accessed 24 hours a day at: http://www.fsis.usda.gov/reportproblem . USDA Recall Classifications Class I This is a health hazard situation where there is a reasonable probability that the use of the product will cause serious, adverse health consequences or death. Class II This is a health hazard situation where there is a remote probability of adverse health consequences from the use of the product. Class III This is a situation where the use of the product will not cause adverse health consequences. Last Modified Apr 02, 2019 ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "recalls frozen beef patties", "sentiment": "negative"}, {"name": "possible foreign matter contamination advancepierre foods, inc", "sentiment": "neutral"}, {"name": "advancepierre foods, inc", "sentiment": "neutral"}, {"name": "fsis", "sentiment": "none"}, {"name": "advancepierre foods, inc.", "sentiment": "none"}, {"name": "usda", "sentiment": "none"}, {"name": "u.s. department of agriculture’s food safety and inspection service", "sentiment": "none"}], "locations": [{"name": "enid", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "okla.", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T08:39:49.066+03:00"}, {"thread": {"uuid": "b9854a5fc15aaa55b9f5056070811aacd0f2136d", "url": "https://www.business-standard.com/article/news-ani/apple-rolls-out-watchos-5-2-with-ecg-feature-in-hong-kong-and-europe-119032801288_1.html", "site_full": "www.business-standard.com", "site": "business-standard.com", "site_section": "", "site_categories": ["media", "financial_news", "finance"], "section_title": "", "title": "Apple rolls out watchOS 5.2 with ECG feature in Hong Kong and Europe | Business Standard News", "title_full": "Apple rolls out watchOS 5.2 with ECG feature in Hong Kong and Europe | Business Standard News", "published": "2019-03-28T02:00:00.000+02:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 1.0, "main_image": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1190328/full-119032801288.jpg", "performance_score": 0, "domain_rank": 2291, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "b9854a5fc15aaa55b9f5056070811aacd0f2136d", "url": "https://www.business-standard.com/article/news-ani/apple-rolls-out-watchos-5-2-with-ecg-feature-in-hong-kong-and-europe-119032801288_1.html", "ord_in_thread": 0, "author": "", "published": "2019-03-28T02:00:00.000+02:00", "title": "Apple rolls out watchOS 5.2 with ECG feature in Hong Kong and Europe | Business Standard News", "text": "Apple FaceTime bug lets you eavesdrop even if no one responds\nApple has started rolling out watch OS 5.2 which includes the ECG app bundled with irregular heartbeat detection features in regions other than the US.\nThe update is available for users in Hong Kong, Austria, Belgium, Denmark, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Luxembourg, Netherlands, Norway, Portugal, Romania, Spain, Sweden, the UK, and Switzerland.\nThe ECG app made its debut last year in the US. The app is exclusive to the newer watches, however, the irregular rhythm notification feature is being rolled out to all Series 1 smartwatches and later. The feature can monitor and alert about irregular heartbeats called atrial fibrillation (AFib), Engadget reports.\nTo prevent false alarms, it will only issue a warning if it detects abnormal rhythms on five checks over a duration of 65 minutes. (This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.) First Published: Thu, March 28 2019. 22:43 IST ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "business standard news apple facetime", "sentiment": "negative"}, {"name": "business standard", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "greece", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "engadget", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "luxembourg", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "finland", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T08:57:48.065+03:00"}, {"thread": {"uuid": "5fe06c720e3aa8d504daae20d4a10231b32b92ac", "url": "https://www.business-standard.com/article/news-ani/apple-is-sorry-for-your-macbook-s-faulty-keyboard-119032801286_1.html", "site_full": "www.business-standard.com", "site": "business-standard.com", "site_section": "", "site_categories": ["media", "financial_news", "finance"], "section_title": "", "title": "Apple is sorry for your MacBook's faulty keyboard | Business Standard News", "title_full": "Apple is sorry for your MacBook's faulty keyboard | Business Standard News", "published": "2019-03-28T02:00:00.000+02:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1190328/full-119032801286.jpg", "performance_score": 0, "domain_rank": 2291, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "5fe06c720e3aa8d504daae20d4a10231b32b92ac", "url": "https://www.business-standard.com/article/news-ani/apple-is-sorry-for-your-macbook-s-faulty-keyboard-119032801286_1.html", "ord_in_thread": 0, "author": "", "published": "2019-03-28T02:00:00.000+02:00", "title": "Apple is sorry for your MacBook's faulty keyboard | Business Standard News", "text": "\nApple knows that the keyboard on your MacBook is not working properly and it is apologetic about it.\nMacBook's butterfly switch keyboards were designed to make the typing experience better.\nHowever, users have been facing incessant issues, from stuck keys to random misfires, even after Apple added a rubberised membrane to tackle the problem, TechCrunch reports.\nAcknowledging the issues, Apple said it is sorry for the issues with the third-generation butterfly keyboard. Users facing the problem are suggested to contact AppleCare. (This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.) First Published: Thu, March 28 2019. 22:52 IST ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "business standard news  apple", "sentiment": "neutral"}, {"name": "business standard", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T08:58:01.018+03:00"}, {"thread": {"uuid": "804a3e03f854b06db1063c0dd9cab18e4cdd736a", "url": "https://www.business-standard.com/article/news-cm/wabco-india-spurts-as-german-auto-parts-maker-to-acquire-wabco-holdings-inc-119032900321_1.html", "site_full": "www.business-standard.com", "site": "business-standard.com", "site_section": "", "site_categories": ["media", "financial_news", "finance"], "section_title": "", "title": "WABCO India spurts as German auto-parts maker to acquire WABCO Holdings Inc | Business Standard News", "title_full": "WABCO India spurts as German auto-parts maker to acquire WABCO Holdings Inc | Business Standard News", "published": "2019-03-29T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.071, "main_image": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1190329/full-119032900321.jpg", "performance_score": 0, "domain_rank": 2291, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "804a3e03f854b06db1063c0dd9cab18e4cdd736a", "url": "https://www.business-standard.com/article/news-cm/wabco-india-spurts-as-german-auto-parts-maker-to-acquire-wabco-holdings-inc-119032900321_1.html", "ord_in_thread": 0, "author": "Capital Market", "published": "2019-03-29T03:00:00.000+03:00", "title": "WABCO India spurts as German auto-parts maker to acquire WABCO Holdings Inc | Business Standard News", "text": "\nWABCO India rose 7.18% to Rs 6819.45 at 11:33 IST on BSE as German auto-parts maker ZF Friedrichshafen AG will acquire WABCO Holdings Inc for roughly $7 billion. The announcement was made after market hours yesterday, 28 March 2019.\nMeanwhile, the S&P BSE Sensex was up 49.78 points, or 0.13% to 38,595.50.\nOn the BSE, 9,743 shares were traded in the counter so far compared with average daily volumes of 740 shares in the past two weeks. The stock had hit a high of Rs 7082.65 and a low of Rs 6750 so far during the day. The stock hit a 52-week high of Rs 8,319.90 on 25 April 2018. The stock hit a 52-week low of Rs 5,798.40 on 18 February 2019.\nWABCO India said that its US-based ultimate parent company, WABCO Holdings Inc., announced that it has entered into a definitive merger agreement with ZF Friedrichshafen AG (\"ZF\"), a privately held global leader in driveline and chassis technologies. Under the agreement, ZF will acquire all outstanding shares of WASCO for $136.50 per share in an all-cash transaction for an equity value of over $7 billion. The transaction is expected to close in early 2020.\nThe transaction will bring together two global technology leaders serving OEMs and fleets in the automotive and commercial vehicle industry, combining WABCO's capabilities in commercial vehicle safety and efficiency, including technologies involved in vehicle dynamics control, active air suspension systems, and fleet management systems with ZF's leading position in driveline and chassis technologies for cars and commercial vehicles.\nWABCO India said that it does not intend to make any comments on this matter unless and until it deems further disclosure is required. As on 31 December 2018, WABCO Asia held 75% stake in WABCO India.\nNet profit of WABCO India declined 6.29% to Rs 59.79 crore on 6.12% rise in net sales to Rs 653.19 crore in Q3 December 2018 over Q3 December 2017.\nWABCO India designs, manufactures and markets conventional braking products, advanced braking systems, and other related air assisted products and systems.\nPowered by Capital Market - Live News (This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.) First Published: Fri, March 29 2019. 11:38 IST ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "wabco india", "sentiment": "negative"}, {"name": "wabco holdings inc", "sentiment": "negative"}, {"name": "ag", "sentiment": "none"}, {"name": "wabco holdings inc.", "sentiment": "none"}, {"name": "s&p bse sensex", "sentiment": "none"}, {"name": "zf friedrichshafen ag", "sentiment": "none"}, {"name": "zf", "sentiment": "none"}], "locations": [{"name": "wasco", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T09:00:49.017+03:00"}, {"thread": {"uuid": "34431216d4616cc1fff2704459e440af8ca740c6", "url": "https://www.business-standard.com/article/news-ians/apple-starts-iphone-7-production-in-india-119040200349_1.html", "site_full": "www.business-standard.com", "site": "business-standard.com", "site_section": "", "site_categories": ["media", "financial_news", "finance"], "section_title": "", "title": "Apple starts iPhone 7 production in India | Business Standard News", "title_full": "Apple starts iPhone 7 production in India | Business Standard News", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.001, "main_image": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1190402/full-119040200349.jpg", "performance_score": 0, "domain_rank": 2291, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 1}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "34431216d4616cc1fff2704459e440af8ca740c6", "url": "https://www.business-standard.com/article/news-ians/apple-starts-iphone-7-production-in-india-119040200349_1.html", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "Apple starts iPhone 7 production in India | Business Standard News", "text": "\nGiving an impetus to its India manufacturing plans, Apple has started the assembling of iPhone 7 at its supplier Wistron's facility in Bengaluru.\nTaiwanese industrial major Wistron already assembles iPhone 6S in the country.\n\"We are proud to be producing iPhone 7 in Bengaluru for our local customers furthering our long-term commitment in India,\" Apple told IANS on Tuesday.\nThe assembling of iPhone 7 began last month.\nWistron, which last year announced plans to invest Rs 3,000 crore in the Narasupra industrial sector in Karnataka's Kolar district, started Apple operations with assembling low-end iPhone SE and later iPhone 6S.\nAccording to Wistron India head Gururaj A, the company would set up an iPhone making unit in the 43 acres of land allotted to it, with employment potential of over 10,000 people.\nThe new Wistron facility is also set to manufacture a wider range of Apple's devices.\nApple is slowly but steadily strategising its plans to make deeper inroads in a country where over 450 million people use smartphones, and assembling iPhone 7 is another step towards gaining more ground.\nAccording to Tarun Pathak, Associate Director at Hong Kong-based Counterpoint Research, the Indian electronics market is growing fast and has gained a significant advantage on some of the competing countries.\n\"I think to start with, it makes sense for Apple to localise assembling of models that have the potential to scale up and then slowly expands it to entire portfolio,\" Pathak told IANS.\niPhone 7 runs iOS 12, is water-resistant and houses a 12MP camera, Retina HD display, great battery life and stereo speakers.\nThe 32GB iPhone 7 costs Rs 39,900 while the 128GB variant Rs 49,900.\nIn India, price is a key factor when it comes to buying a smartphone.\nApple has already begun reducing the price of iPhones in China and may go the same way in India where the iPhone is considered expensive.\nAccording to a report in Caixin on Monday, Apple has cut prices for several of its products including iPhones.\nFor the first time this year, Apple has dropped iPhone prices on its official Chinese website.\n\"The slash comes in response to China's reduction of the tax burden for manufacturing and other sectors that began on April 1,\" the report said.\nThe iPhone maker is also seeking tax relief and other incentives to begin assembling more handsets and open its branded stores in India.\n--IANS\nna/bc (This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.) First Published: Tue, April 02 2019. 12:44 IST ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "wistron india", "sentiment": "none"}, {"name": "wistron", "sentiment": "none"}, {"name": "ians", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "karnataka", "sentiment": "none"}, {"name": "kolar district", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T09:04:33.002+03:00"}, {"thread": {"uuid": "336e923b3725f08c5b412439a6e978138a0fb4bb", "url": "https://www.business-standard.com/article/news-ians/georgia-man-pleads-guilty-of-hacking-apple-accounts-119033000481_1.html", "site_full": "www.business-standard.com", "site": "business-standard.com", "site_section": "", "site_categories": ["media", "financial_news", "finance"], "section_title": "", "title": "Georgia man pleads guilty of hacking Apple accounts | Business Standard News", "title_full": "Georgia man pleads guilty of hacking Apple accounts | Business Standard News", "published": "2019-03-30T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1190330/full-119033000481.jpg", "performance_score": 0, "domain_rank": 2291, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "336e923b3725f08c5b412439a6e978138a0fb4bb", "url": "https://www.business-standard.com/article/news-ians/georgia-man-pleads-guilty-of-hacking-apple-accounts-119033000481_1.html", "ord_in_thread": 0, "author": "", "published": "2019-03-30T03:00:00.000+03:00", "title": "Georgia man pleads guilty of hacking Apple accounts | Business Standard News", "text": "NBA comes to India: Two pre-season games set for next October in Mumbai\nA Georgia man has pleaded guilty of hacking into Apple accounts of several famous musicians and athletes and spending thousands of dollars from their accounts.\n\"The victims included rappers as well as college and professional athletes, including people in the NBA and NFL,\" the Justice Department said while declining to name people.\nThe hacker, Kwamaine Jerell Ford, began targeting accounts in March 2015 with a phishing scheme, pretending to be an Apple support representative needing logins, passwords and/or the answers to security questions, the Apple Insider reported on Friday.\nAfter getting the information, Ford would log into the Apple accounts to take them over. He convinced people that it was necessary to reset an account or access videos people were sending.\nBut in reality, he set about hijacking accounts by resetting passwords, changing email contacts and editing security questions, the report added.\nAccording to the iPhone-maker, there were hundreds of unauthorised logins to victims' Apple accounts.\n--IANS\nksc/pg/pcj (This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.) First Published: Sat, March 30 2019. 17:28 IST ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "kwamaine jerell ford", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "business standard news nba", "sentiment": "negative"}, {"name": "justice department", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "nba", "sentiment": "none"}], "locations": [{"name": "georgia", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T09:09:24.047+03:00"}, {"thread": {"uuid": "f88fc1e5c31d13b3152cd46a97ba47daab36c64d", "url": "https://www.business-standard.com/article/news-ians/macbook-keyboards-still-faulty-apple-apologizes-119032800439_1.html", "site_full": "www.business-standard.com", "site": "business-standard.com", "site_section": "", "site_categories": ["media", "financial_news", "finance"], "section_title": "", "title": "MacBook keyboards still faulty, Apple apologizes | Business Standard News", "title_full": "MacBook keyboards still faulty, Apple apologizes | Business Standard News", "published": "2019-03-28T02:00:00.000+02:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.012, "main_image": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1190328/full-119032800439.jpg", "performance_score": 0, "domain_rank": 2291, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "f88fc1e5c31d13b3152cd46a97ba47daab36c64d", "url": "https://www.business-standard.com/article/news-ians/macbook-keyboards-still-faulty-apple-apologizes-119032800439_1.html", "ord_in_thread": 0, "author": "", "published": "2019-03-28T02:00:00.000+02:00", "title": "MacBook keyboards still faulty, Apple apologizes | Business Standard News", "text": "Apple refreshes iMacs with powerful chips, graphics\nApple has apologized to users who are still encountering issues with the third-party butterfly keyboards on MacBooks and MacBook Pros even after the company introduced a fresh batch of laptops last year with redesigned keyboards.\nThe butterfly keyboards have troubled users with unexpected repetition of letters while typing, unresponsive keys and sticky keys and with letters not appearing.\n\"We are aware that a small number of users are having issues with their third-generation butterfly keyboard and for that we are sorry,\" MacRumors quoted an Apple spokesperson as saying on Wednesday.\nThe iPhone-maker designed and incorporated the mechanism in new MacBooks and MacPro keyboards to distribute the pressure on a single key evenly, thus increasing the precision in typing.\nWhile the iPhone-maker initiated a service programme offering free repairs of affected 2015-17 MacBook and 2016-17 MacBook Pro models with first- and second-generation butterfly keyboards, the latest 2018 MacBook Pro and 2018 MacBook Air models with third-generation butterfly keyboards do not qualify at this time, the report added.\nThe company did not disclose any rectification plans or programmes for the faulted devices.\n--IANS\nrp/ksk/mr (This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.) First Published: Thu, March 28 2019. 13:54 IST ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "business standard news apple", "sentiment": "negative"}, {"name": "macbook pros", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T09:15:00.009+03:00"}, {"thread": {"uuid": "ca79b837fcb401793dfb3a7ab2d34f2e13affb70", "url": "https://www.business-standard.com/article/news-ians/apple-watch-with-ecg-app-now-in-europe-hong-kong-119032800237_1.html", "site_full": "www.business-standard.com", "site": "business-standard.com", "site_section": "", "site_categories": ["media", "financial_news", "finance"], "section_title": "", "title": "Apple Watch with ECG app now in Europe, Hong Kong | Business Standard News", "title_full": "Apple Watch with ECG app now in Europe, Hong Kong | Business Standard News", "published": "2019-03-28T02:00:00.000+02:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1190328/full-119032800237.jpg", "performance_score": 0, "domain_rank": 2291, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "ca79b837fcb401793dfb3a7ab2d34f2e13affb70", "url": "https://www.business-standard.com/article/news-ians/apple-watch-with-ecg-app-now-in-europe-hong-kong-119032800237_1.html", "ord_in_thread": 0, "author": "", "published": "2019-03-28T02:00:00.000+02:00", "title": "Apple Watch with ECG app now in Europe, Hong Kong | Business Standard News", "text": "Apple to celebrate February as 'Heart Month'\nApple Watch Series 4 with industry-first features like ECG reading app and irregular rhythm notification will now be available in Europe and Hong Kong.\nWith watchOS 5.2, customers in 19 European countries including Germany can take an ECG reading with Apple Watch Series 4 at any time.\n\"All recordings, their associated classifications and any noted symptoms are stored securely in the Health app on iPhone,\" Apple said in a statement late Wednesday.\nThe ECG app enables customers to take an electrocardiogram right from their wrist.\nIt can capture heart rhythm on demand in a moment when users experience symptoms such as a rapid or skipped heart beat and help provide clinically important data to physicians.\nThe irregular rhythm notification feature on Apple Watch occasionally checks heart rhythm in the background and sends a notification if an irregular heart rhythm that appears to be atrial fibrillation (AFib) is identified.\nThe ECG app and irregular rhythm notification feature can alert users to signs of AFib.\n\"We've seen the ECG app and irregular rhythm notifications on Apple Watch have meaningful impact on our customers across the US,\" said Jeff Williams, Apple's Chief Operating Officer.\nA recent clinical trial of around 600 participants found that the ECG app on Apple Watch demonstrated 98.3 per cent sensitivity in classifying AFib and 99.6 per cent specificity in classifying sinus rhythm in classifiable recordings, when compared to an ECG administered by a cardiologist.\nThe irregular rhythm notification feature was recently studied in the Apple Heart Study which found \"only 0.5 per cent of participants received irregular pulse notifications, an important finding given concerns about potential over-notification.\"\n--IANS\nna/pg (This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.) First Published: Thu, March 28 2019. 10:52 IST ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "business standard news apple", "sentiment": "negative"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T09:15:19.001+03:00"}, {"thread": {"uuid": "decda2e79e755fa718073fbd80c9f1374dd7f18e", "url": "https://www.business-standard.com/article/pti-stories/apple-executive-death-cop-s-bail-plea-rejected-119040101330_1.html", "site_full": "www.business-standard.com", "site": "business-standard.com", "site_section": "", "site_categories": ["media", "financial_news", "finance"], "section_title": "", "title": "Apple executive death: Cop's bail plea rejected | Business Standard News", "title_full": "Apple executive death: Cop's bail plea rejected | Business Standard News", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1190401/full-119040101330.jpg", "performance_score": 0, "domain_rank": 2291, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "decda2e79e755fa718073fbd80c9f1374dd7f18e", "url": "https://www.business-standard.com/article/pti-stories/apple-executive-death-cop-s-bail-plea-rejected-119040101330_1.html", "ord_in_thread": 0, "author": "Press Trust Of India", "published": "2019-04-01T03:00:00.000+03:00", "title": "Apple executive death: Cop's bail plea rejected | Business Standard News", "text": "Rape victim threatens to kill herself after accused gets bail\nAn Uttar Pradesh court on Monday rejected the bail plea of a police constable in connection with the death an Apple employee here last year.\nAdditional sessions judge S S Pandey rejected the bail plea of Sandeep Kumar, who was sent to jail on March 22 after the court had taken cognizance of the offences under Section 302 (murder) of the Indian Penal Code (IPC).\nKumar and another constable, Prashant Chaudhary, were arrested after Apple area sales manager Vivek Tiwari was shot dead early on September 29 when he allegedly refused to stop his car for checking.\nEarlier, the police had filed a charge sheet against Kumar only under Section 323 (voluntarily causing hurt) of the IPC and he was released on bail. But due to additional sections, he had to surrender again.\nThe trial court had framed charges against Kumar and it is set to record evidence of the prosecution. (This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.) First Published: Mon, April 01 2019. 22:35 IST ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "sandeep kumar", "sentiment": "none"}, {"name": "kumar", "sentiment": "none"}, {"name": "prashant chaudhary", "sentiment": "none"}, {"name": "pandey", "sentiment": "none"}, {"name": "vivek tiwari", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "business standard news rape", "sentiment": "negative"}, {"name": "business standard", "sentiment": "none"}], "locations": [{"name": "uttar pradesh", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T09:21:11.006+03:00"}, {"thread": {"uuid": "ccac48a3a1f45ff7ea65a2ba5c1af84db8c22cf5", "url": "https://www.business-standard.com/article/pti-stories/cipla-signs-22-mn-pact-with-pulmatrix-inc-for-new-asthma-drug-119040101229_1.html", "site_full": "www.business-standard.com", "site": "business-standard.com", "site_section": "", "site_categories": ["media", "financial_news", "finance"], "section_title": "", "title": "Cipla signs $22 mn pact with Pulmatrix Inc for new asthma drug | Business Standard News", "title_full": "Cipla signs $22 mn pact with Pulmatrix Inc for new asthma drug | Business Standard News", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.002, "main_image": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1190401/full-119040101229.jpg", "performance_score": 0, "domain_rank": 2291, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "ccac48a3a1f45ff7ea65a2ba5c1af84db8c22cf5", "url": "https://www.business-standard.com/article/pti-stories/cipla-signs-22-mn-pact-with-pulmatrix-inc-for-new-asthma-drug-119040101229_1.html", "ord_in_thread": 0, "author": "Press Trust Of India", "published": "2019-04-01T03:00:00.000+03:00", "title": "Cipla signs $22 mn pact with Pulmatrix Inc for new asthma drug | Business Standard News", "text": "Sensex drops 345 points, Nifty slips 119 points\nDomestic pharma major Cipla Monday said it has signed a binding agreement with Pulmatrix Inc for co-development and licensing opportunity for a new drug under development for an upfront consideration of USD 22 million.\nThe agreement has been signed between the company's wholly-owned subsidiary in the US, Cipla Technologies LLC with Pulmatrix Inc for an investment in phase 2 ready Pulmazole (inhaled ltraconazole).\nPulmazole is an inhaled anti-fungal formulation of itraconazole aimed at treating allergic bronchopulmonary aspergillosis (ABPA) in asthma patients.\nCipla said, \"Entry into a definitive agreement is contingent upon Pulmatrix raising additional funds from the market\".\nUpon signing the definitive agreement, the co-development cost towards development and the total free cash flow in relation to commercialisation of Pulmazole will be further shared by both the parties in a phased manner, it added. (This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.) First Published: Mon, April 01 2019. 21:21 IST ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "business standard news sensex", "sentiment": "negative"}, {"name": "cipla", "sentiment": "negative"}, {"name": "pulmatrix inc", "sentiment": "negative"}, {"name": "cipla technologies llc", "sentiment": "none"}, {"name": "business standard", "sentiment": "none"}], "locations": [{"name": "pulmazole", "sentiment": "none"}, {"name": "us", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T09:21:44.007+03:00"}, {"thread": {"uuid": "f3fdc1999eb92afa71cf42d17f31263128e3d282", "url": "https://3dnews.ru/985108", "site_full": "3dnews.ru", "site": "3dnews.ru", "site_section": "http://3dnews.ru/news/rss/", "site_categories": ["computer_reviews", "tech"], "section_title": "3DNews: Новости Hardware", "title": "Apple AirPods остаются самыми продаваемыми беспроводными наушниками", "title_full": "Apple AirPods остаются самыми продаваемыми беспроводными наушниками", "published": "2019-04-01T16:23:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "RU", "spam_score": 0.0, "main_image": "https://3dnews.ru/assets/external/illustrations/2019/04/01/985108/MMEF2-1.jpg", "performance_score": 0, "domain_rank": 3856, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 1}}}, "uuid": "f3fdc1999eb92afa71cf42d17f31263128e3d282", "url": "https://3dnews.ru/985108", "ord_in_thread": 0, "author": "", "published": "2019-04-01T16:23:00.000+03:00", "title": "Apple AirPods остаются самыми продаваемыми беспроводными наушниками", "text": "Apple AirPods ĐžŃ\u0081Ń\u0082Đ°Ń\u008eŃ\u0082Ń\u0081Ń\u008f Ń\u0081Đ°ĐźŃ\u008bĐźĐ¸ ĐżŃ\u0080ĐžĐ´Đ°Đ˛Đ°ĐľĐźŃ\u008bĐźĐ¸ ĐąĐľŃ\u0081ĐżŃ\u0080ĐžĐ˛ĐžĐ´Đ˝Ń\u008bĐźĐ¸ Đ˝Đ°Ń\u0083Ń\u0088Đ˝Đ¸ĐşĐ°ĐźĐ¸ 01.04.2019 [16:23],\nĐ\u009fŃ\u0080ĐžŃ\u0088ĐťĐ¸ Ń\u0082Đľ Đ˛Ń\u0080ĐľĐźĐľĐ˝Đ°, ĐşĐžĐłĐ´Đ° AirPods ĐşŃ\u0080Đ¸Ń\u0082Đ¸ĐşĐžĐ˛Đ°ĐťĐ¸ ĐˇĐ° Ń\u0081Ń ĐžĐśĐľŃ\u0081Ń\u0082Ń\u008c Ń\u0081Đž Ń\u0081Đ˛ĐžĐ¸ĐźĐ¸ ĐżŃ\u0080ĐžĐ˛ĐžĐ´Đ˝Ń\u008bĐźĐ¸ ÂŤŃ\u0081ĐžĐąŃ\u0080Đ°Ń\u0082Ń\u008cŃ\u008fĐźĐ¸Âť. Đ\u0097Đ° ĐżĐžŃ\u0081ĐťĐľĐ´Đ˝Đ¸Đľ ĐżĐ°Ń\u0080Ń\u0083 ĐťĐľŃ\u0082 ĐżĐžĐżŃ\u0083ĐťŃ\u008fŃ\u0080Đ˝ĐžŃ\u0081Ń\u0082Ń\u008c Ń\u008dŃ\u0082ĐžĐłĐž ĐąĐľŃ\u0081ĐżŃ\u0080ĐžĐ˛ĐžĐ´Đ˝ĐžĐłĐž Đ°ĐşŃ\u0081ĐľŃ\u0081Ń\u0081Ń\u0083Đ°Ń\u0080Đ° Đ˛ĐžĐˇŃ\u0080ĐžŃ\u0081ĐťĐ°, Đ¸, Ń\u0081ĐžĐłĐťĐ°Ń\u0081Đ˝Đž Đ˝ĐžĐ˛ĐžĐźŃ\u0083 Đ¸Ń\u0081Ń\u0081ĐťĐľĐ´ĐžĐ˛Đ°Đ˝Đ¸Ń\u008e Counterpoint Research, AirPods ĐżĐž-ĐżŃ\u0080ĐľĐśĐ˝ĐľĐźŃ\u0083 Đ´ĐžĐźĐ¸Đ˝Đ¸Ń\u0080Ń\u0083Ń\u008eŃ\u0082 Đ˝Đ° Ń\u0080Ń\u008bĐ˝ĐşĐľ ĐąĐľŃ\u0081ĐżŃ\u0080ĐžĐ˛ĐžĐ´Đ˝Ń\u008bŃ Đ˝Đ°Ń\u0083Ń\u0088Đ˝Đ¸ĐşĐžĐ˛, Đ˝ĐľŃ\u0081ĐźĐžŃ\u0082Ń\u0080Ń\u008f Đ˝Đ° ĐżĐžŃ\u008fĐ˛ĐťĐľĐ˝Đ¸Đľ Đ˝ĐžĐ˛Ń\u008bŃ ĐźĐžĐ´ĐľĐťĐľĐš.\nĐ\u009fĐž ĐžŃ\u0086ĐľĐ˝ĐşĐ°Đź Counterpoint, Đ˛ Ń\u0087ĐľŃ\u0082Đ˛Ń\u0091Ń\u0080Ń\u0082ĐžĐź ĐşĐ˛Đ°Ń\u0080Ń\u0082Đ°ĐťĐľ 2018 ĐłĐžĐ´Đ° ĐąŃ\u008bĐťĐž ĐżĐžŃ\u0081Ń\u0082Đ°Đ˛ĐťĐľĐ˝Đž 12,5 ĐźĐťĐ˝ ĐąĐľŃ\u0081ĐżŃ\u0080ĐžĐ˛ĐžĐ´Đ˝Ń\u008bŃ Đ˝Đ°Ń\u0083Ń\u0088Đ˝Đ¸ĐşĐžĐ˛, ĐżŃ\u0080Đ¸Ń\u0087Ń\u0091Đź ĐąĐžĐťŃ\u008cŃ\u0088Ń\u0083Ń\u008e Ń\u0087Đ°Ń\u0081Ń\u0082Ń\u008c ĐžĐąŃ\u008aŃ\u0091ĐźĐ° Ń\u0081ĐžŃ\u0081Ń\u0082Đ°Đ˛ĐťŃ\u008fĐťĐ¸ Ń\u0083Ń\u0081Ń\u0082Ń\u0080ĐžĐšŃ\u0081Ń\u0082Đ˛Đ° Apple: Ń\u0082ĐľŃ Đ˝ĐžĐťĐžĐłĐ¸Ń\u0087ĐľŃ\u0081ĐşĐ¸Đš ĐłĐ¸ĐłĐ°Đ˝Ń\u0082 ĐˇĐ°Đ˝Đ¸ĐźĐ°Đť 60 % Ń\u0080Ń\u008bĐ˝ĐşĐ°.\nĐ­Ń\u0082Đž Đ˛ĐżĐľŃ\u0087Đ°Ń\u0082ĐťŃ\u008fŃ\u008eŃ\u0089Đ¸Đš Ń\u0080ĐľĐˇŃ\u0083ĐťŃ\u008cŃ\u0082Đ°Ń\u0082 Ń\u0081 Ń\u0083Ń\u0087Ń\u0091Ń\u0082ĐžĐź Ń\u0082ĐžĐłĐž, Ń\u0087Ń\u0082Đž Ń\u0080Ń\u008fĐ´ ĐąŃ\u0080ĐľĐ˝Đ´ĐžĐ˛ Ń\u0081Ń\u0080ĐľĐ´Đ˝ĐľĐłĐž Ń\u0083Ń\u0080ĐžĐ˛Đ˝Ń\u008f Ń\u0082ĐžĐśĐľ Đ˝Đ°Ń\u0087Đ°Đť ĐżĐžĐżŃ\u008bŃ\u0082ĐşĐ¸ ĐˇĐ°Đ˛ĐžĐľĐ˛Đ°Ń\u0082Ń\u008c Ń\u0080Ń\u008bĐ˝ĐžĐş Đ˛ Ń\u008dŃ\u0082ĐžĐź ĐşĐ˛Đ°Ń\u0080Ń\u0082Đ°ĐťĐľ. Đ\u0094Đ°ĐśĐľ Đ˝Đ° Ń\u0080ĐžĐ´Đ¸Đ˝Đľ Apple, ĐłĐ´Đľ AirPods ĐžŃ\u0081Ń\u0082Đ°Ń\u008eŃ\u0082Ń\u0081Ń\u008f Ń\u0081Đ°ĐźĐžĐš ĐżŃ\u0080ĐžĐ´Đ°Đ˛Đ°ĐľĐźĐžĐš ĐźĐžĐ´ĐľĐťŃ\u008cŃ\u008e, ĐşĐžŃ\u0080ĐľĐšŃ\u0081ĐşĐ¸Đš Đ¸ Đ´Đ°Ń\u0082Ń\u0081ĐşĐ¸Đš ĐąŃ\u0080ĐľĐ˝Đ´Ń\u008b Samsung Đ¸ Jabra ĐżĐžĐşĐ°ĐˇŃ\u008bĐ˛Đ°Ń\u008eŃ\u0082 Ń ĐžŃ\u0080ĐžŃ\u0088Đ¸Đľ Ń\u0080ĐľĐˇŃ\u0083ĐťŃ\u008cŃ\u0082Đ°Ń\u0082Ń\u008b. Đ\u0094ĐžĐťŃ\u008f Đ\u009aŃ\u0083ĐżĐľŃ\u0080Ń\u0082Đ¸Đ˝Đž Đ˛ Đ\u009aĐ¸Ń\u0082Đ°Đľ ĐžŃ\u0082Đ˝ĐžŃ\u0081Đ¸Ń\u0082ĐľĐťŃ\u008cĐ˝Đž Đ˝Đ¸ĐśĐľ ĐżĐž Ń\u0081Ń\u0080Đ°Đ˛Đ˝ĐľĐ˝Đ¸Ń\u008e Ń\u0081 Đ´Ń\u0080Ń\u0083ĐłĐ¸ĐźĐ¸ Ń\u0080ĐľĐłĐ¸ĐžĐ˝Đ°ĐźĐ¸ Đ¸Đˇ-ĐˇĐ° Ń\u0080Đ°Ń\u0081Ń\u0082Ń\u0083Ń\u0089ĐľĐłĐž ĐżŃ\u0080Đ¸Ń\u0081Ń\u0083Ń\u0082Ń\u0081Ń\u0082Đ˛Đ¸Ń\u008f ĐźĐľŃ\u0081Ń\u0082Đ˝Ń\u008bŃ ĐąŃ\u008eĐ´ĐśĐľŃ\u0082Đ˝Ń\u008bŃ Ń\u0083Ń\u0081Ń\u0082Ń\u0080ĐžĐšŃ\u0081Ń\u0082Đ˛.\nĐ\u0098Ń\u0081Ń\u0082ĐžŃ\u0087Đ˝Đ¸Đş:", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "counterpoint research", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T09:57:43.024+03:00"}, {"thread": {"uuid": "5063f7a7de61487618962ce3a93ac4d975678977", "url": "https://article.wn.com/view/2019/04/03/Porsche_Cars_North_America_Inc_PCNA_importer_and_distributor/", "site_full": "article.wn.com", "site": "wn.com", "site_section": "http://rss.wn.com/English/keyword/business", "site_categories": ["media"], "section_title": "WN.com - Business News", "title": "Porsche Cars North America, Inc. (PCNA), importer and distributor of the Porsche 911, 718 Boxster and Cayman, Panamera, Cayenne, and Macan model lines, today announced March retail sales of 4,779 vehicles...", "title_full": "Porsche Cars North America, Inc. (PCNA), importer and distributor of the Porsche 911, 718 Boxster and Cayman, Panamera, Cayenne, and Macan model lines, today announced March retail sales of 4,779 vehicles... - Worldnews.com", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "GB", "spam_score": 0.0, "main_image": "", "performance_score": 0, "domain_rank": 5594, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "5063f7a7de61487618962ce3a93ac4d975678977", "url": "https://article.wn.com/view/2019/04/03/Porsche_Cars_North_America_Inc_PCNA_importer_and_distributor/", "ord_in_thread": 0, "author": "wn.com", "published": "2019-04-02T03:00:00.000+03:00", "title": "Porsche Cars North America, Inc. (PCNA), importer and distributor of the Porsche 911, 718 Boxster and Cayman, Panamera, Cayenne, and Macan model lines, today announced March retail sales of 4,779 vehicles...", "text": "Porsche Cars North America , Inc. ( PCNA ), importer and distributor of the Porsche 911 , 718 Boxster and Cayman, Panamera , Cayenne, and Macan model lines, today announced March retail sales of 4,779 vehicles, a new all-time high for the month. Following record months in January and February, sales for the first quarter are up 7.7", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "macan", "sentiment": "neutral"}, {"name": "boxste", "sentiment": "neutral"}, {"name": "cayman", "sentiment": "none"}], "organizations": [{"name": "porsche cars north america, inc.", "sentiment": "neutral"}, {"name": "porsche cars north america , inc.", "sentiment": "neutral"}], "locations": [{"name": "cayman", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T12:06:32.016+03:00"}, {"thread": {"uuid": "b7d4bffab8b1648d7f9d648164fe4d969e7c1e44", "url": "https://itunes.apple.com/us/album/kanchana-3-original-motion-picture-soundtrack-ep/1458262899", "site_full": "itunes.apple.com", "site": "apple.com", "site_section": "", "site_categories": ["tech", "television", "shopping", "mac_support", "entertainment"], "section_title": "", "title": "‎Kanchana 3 (Original Motion Picture Soundtrack) - EP by Saravedi Saran, Kapilan Kugavel, Sekar Sai Bharath, Jesse Samuel, Bharath Madhusudhanan & Raj Thillaiyampalam on Apple Music", "title_full": "‎Kanchana 3 (Original Motion Picture Soundtrack) - EP by Saravedi Saran, Kapilan Kugavel, Sekar Sai Bharath, Jesse Samuel, Bharath Madhusudhanan & Raj Thillaiyampalam on Apple Music", "published": "2019-03-31T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.099, "main_image": "https://is2-ssl.mzstatic.com/image/thumb/Music113/v4/ee/79/0a/ee790af6-4b39-695a-1437-fc3673175976/Kanchana_3.jpg/1200x630wp.png", "performance_score": 0, "domain_rank": 49, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "b7d4bffab8b1648d7f9d648164fe4d969e7c1e44", "url": "https://itunes.apple.com/us/album/kanchana-3-original-motion-picture-soundtrack-ep/1458262899", "ord_in_thread": 0, "author": "", "published": "2019-03-31T03:00:00.000+03:00", "title": "‎Kanchana 3 (Original Motion Picture Soundtrack) - EP by Saravedi Saran, Kapilan Kugavel, Sekar Sai Bharath, Jesse Samuel, Bharath Madhusudhanan & Raj Thillaiyampalam on Apple Music", "text": "Kadhal Oru Vizhiyil (feat. Neha Venugopal) Kapilan Kugavel, Neha Venugopal & Raj Thillaiyampalam 4:07 Kaali Kaali (feat. Dhivagar Santhosh) Sekar Sai Bharath & Dhivagar Santhosh 4:03 ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "kapilan kugavel", "sentiment": "negative"}, {"name": "sekar sai bharath", "sentiment": "negative"}, {"name": "bharath madhusudhanan", "sentiment": "negative"}, {"name": "saravedi saran", "sentiment": "negative"}, {"name": "jesse samuel", "sentiment": "negative"}, {"name": "raj thillaiyampalam", "sentiment": "negative"}, {"name": "neha venugopal", "sentiment": "negative"}, {"name": "dhivagar santhosh", "sentiment": "none"}, {"name": "kaali kaali", "sentiment": "none"}], "organizations": [{"name": "kanchana", "sentiment": "negative"}], "locations": []}, "rating": null, "crawled": "2019-04-03T14:11:42.007+03:00"}, {"thread": {"uuid": "c284fa18c668ba9678ad1121484c3292865a5a75", "url": "https://www.yahoo.com/news/monday-apple-rumors-2019-iphone-181020112.html", "site_full": "www.yahoo.com", "site": "yahoo.com", "site_section": "https://www.yahoo.com/news/", "site_categories": ["search_engine", "media", "tech"], "section_title": "Yahoo News - Latest News &amp; Headlines", "title": "Monday Apple Rumors: 2019 iPhone May Support Two-Way Wireless Charging", "title_full": "Monday Apple Rumors: 2019 iPhone May Support Two-Way Wireless Charging", "published": "2019-04-02T02:10:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://s.yimg.com/uu/api/res/1.2/vSd3TuatzObT8cTdDJeABg--~B/aD0xODA7dz0zMDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/0f2fb056fcdcf6b5725a30edb76ce804", "performance_score": 0, "domain_rank": 5, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "c284fa18c668ba9678ad1121484c3292865a5a75", "url": "https://www.yahoo.com/news/monday-apple-rumors-2019-iphone-181020112.html", "ord_in_thread": 0, "author": "William White", "published": "2019-04-02T02:10:00.000+03:00", "title": "Monday Apple Rumors: 2019 iPhone May Support Two-Way Wireless Charging", "text": "Leading the Apple (NASDAQ: AAPL ) rumor mill today is news of a possible feature for the 2019 iPhone. Today, we’ll look at that and other Apple Rumors for Monday. Monday Apple Rumors: 2019 iPhone May Support Two-Way Wireless Charging More Two-Way Wireless Charging : A new rumor claims that AAPL will introduce two-way wireless charging to the 2019 iPhone , reports MacRumors . This rumor claims that this will allow the 2019 iPhone to act as a a charging mat for other devices. This could make it perfect for charging up AirPods on the go. This same rumor also says that the tech company will include larger batteries in its 2019 iPhone line to make up for the extra charging feature.\nIsrael Store : Rumor has it that Apple is giving up on opening a store in Israel , 9to5Mac notes. The tech company wants to open its first retail location in the country, but isn’t having any luck in malls. Reports claims that no mall owners have been willing to agree to AAPL’s terms for opening a store. The reports claim that this has resulted in the company giving up on opening physical retail locations in the country.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\nCar Hire : A recent hire at at Apple hints at its plans for a car , reports AppleInsider . Michael Schwekutsch is now reportedly a part of the tech company’s Special Projects Group. This could have him working on Project Titan. His hiring matters due to his work history. Before joining AAPL, he was the Vice President responsible for powertrains at Tesla (NASDAQ: TSLA ).\nCheck out more recent Apple Rumors or Subscribe to Apple Rumors : RSS As of this writing, William White did not hold a position in any of the aforementioned securities. Compare Brokers\nSubscribe to Apple Rumors Email More Apple Rumors RSS More The post Monday Apple Rumors: 2019 iPhone May Support Two-Way Wireless Charging appeared first on InvestorPlace .", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://investorplace.com/options-trading/broker-center/", "https://investorplace.com/2019/04/apple-2019-iphone-may-support-two-way-wireless-charging/&quot;", "https://investorplace.com&quot;", "https://s.yimg.com/ny/api/res/1.2/cFeUfCKAZ0kMCZwPYdydIw--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9MzAwO2g9MTgw/https://media.zenfs.com/en-US/investorplace_417/0f2fb056fcdcf6b5725a30edb76ce804);", "https://investorplace.com/2019/04/apple-2019-iphone-may-support-two-way-wireless-charging/", "https://investorplace.com", "http://investorplace.com/hot-topics/apple-rumors-stock-news/feed/&quot;", "http://investorplace.com/hot-topics/apple-rumors-stock-news/feed/", "http://investorplace.com/hot-topics/apple-rumors-stock-news/", "http://investorplace.com/2012/04/hot-topics/apple-rumors-stock-news/", "https://investorplace.com/stock-quotes/tsla-stock-quote/", "https://investorplace.com/hot-topics/apple-rumors-stock-news/", "https://s.yimg.com/ny/api/res/1.2/vJO57M.Q.2fwzUVX.e9ozA--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/https://media.zenfs.com/en-US/investorplace_417/7988a9c2a9fd3c49c184f052c2e2f10d", "https://s.yimg.com/ny/api/res/1.2/cFeUfCKAZ0kMCZwPYdydIw--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9MzAwO2g9MTgw/https://media.zenfs.com/en-US/investorplace_417/0f2fb056fcdcf6b5725a30edb76ce804", "https://investorplace.com/options-trading/broker-center/&quot;", "http://investorplace.com/2012/04/hot-topics/apple-rumors-stock-news/&quot;", "https://s.yimg.com/ny/api/res/1.2/vJO57M.Q.2fwzUVX.e9ozA--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/https://media.zenfs.com/en-US/investorplace_417/7988a9c2a9fd3c49c184f052c2e2f10d);", "https://investorplace.com/stock-quotes/tsla-stock-quote/&quot;"], "entities": {"persons": [], "organizations": [{"name": "israel store", "sentiment": "none"}, {"name": "aapl", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T14:21:09.017+03:00"}, {"thread": {"uuid": "2dafd0ec8676ff740514f99f07ede89088c3f6be", "url": "https://www.yahoo.com/news/apple-slashes-iphone-prices-china-135829051.html", "site_full": "www.yahoo.com", "site": "yahoo.com", "site_section": "https://www.yahoo.com/news/", "site_categories": ["search_engine", "media", "tech"], "section_title": "Yahoo News - Latest News &amp; Headlines", "title": "Apple slashes iPhone prices in China", "title_full": "Apple slashes iPhone prices in China", "published": "2019-04-01T21:58:00.000+03:00", "replies_count": 8, "participants_count": 8, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://s.yimg.com/uu/api/res/1.2/oMMk452xvhmLGxgMgYSw1w--~B/aD0yMjU7dz00MDA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/video/video.cnbc2.com/4fd969e290dc8ca75ff72a02825e65e9", "performance_score": 0, "domain_rank": 5, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 1}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "2dafd0ec8676ff740514f99f07ede89088c3f6be", "url": "https://www.yahoo.com/news/apple-slashes-iphone-prices-china-135829051.html", "ord_in_thread": 0, "author": "Kif Leswing", "published": "2019-04-01T21:58:00.000+03:00", "title": "Apple slashes iPhone prices in China", "text": "Apple AAPL has cut prices for several of its most important products on its official Chinese online store by nearly 6 percent. The price cuts affect products including iPhones, iPads, Macs and AirPods, according to Apple's online store in China. The price cuts come months after the company blamed a $5 billion to $9 billion revenue shortfall in the fourth quarter of 2018 on \" lower than anticipated \" iPhone sales and demand in China, Taiwan and Hong Kong.\n\"If you look at our results, our shortfall is over 100 percent from iPhone and it's primarily in greater China,\" Apple CEO Tim Cook told CNBC in January when the company lowered its revenue guidance ahead of earnings.\nEarlier this year, prices on Apple products were lowered on official third-party sellers in China including Tmall and JD.com. Monday's price cut may be in response to a recent value-added tax cut in China that took affect on April 1. The value-added tax for manufacturers, like Apple, was cut to 13 percent from 16 percent, according to Caixin .\nThe price cuts can be seen on Apple's website. For example, the entry-level iPhone XR now costs 6199RMB, 4.6 percent lower than on March 29, when Apple listed 6499RMB as its price. Apple's high-end iPhone XS and iPhone XS Max models each got a 500RMB price cut.\nAccording to Apple's customer service, anybody who has bought an affected product from Apple in China within the past 14 days can receive a refund for the difference in price.\nGreater China, which includes Hong Kong and Taiwan, accounted for about 15 percent of Apple's revenue in the fourth calendar quarter of 2018, the most recent quarter for which statistics are available. However, Apple's China revenue of $13.17 billion was down nearly $5 billion from a year ago.\nApple shares went slightly negative in early trading on Monday.\nApple didn't return a request for comment.\nSubscribe to CNBC on YouTube.\nMore From CNBC\nLyft falls below IPO price on its second day of trading\nOne of the iPhone's most useful features is one swipe from the homescreen\nApril could see IPOs from Uber and Pinterest. Here's what to expect", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://www.cnbc.com/2019/04/01/april-could-see-ipos-from-uber-and-pinterest-heres-what-to-expect.html?__source=yahoo|finance|related|story|&par=yahoo&doc=105825623", "https://www.cnbc.com/2019/04/01/how-to-use-iphone-widgets-today-view-swipe-right.html?__source=yahoo|finance|related|story|&par=yahoo&doc=105825623", "https://www.cnbc.com/2019/04/01/lyft-stock-is-tumbling-after-a-lukewarm-market-debut.html?__source=yahoo|finance|related|story|&par=yahoo&doc=105825623"], "entities": {"persons": [{"name": "tim cook", "sentiment": "none"}], "organizations": [{"name": "china apple aapl", "sentiment": "negative"}, {"name": "apple", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "caixin", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T14:21:59.002+03:00"}, {"thread": {"uuid": "c8937c81cfa1b9ec20ebfa1488298b9e1a44b6b8", "url": "https://www.marketwatch.com/investing/stock/cmg", "site_full": "www.marketwatch.com", "site": "marketwatch.com", "site_section": "", "site_categories": ["investing", "financial_news", "finance"], "section_title": "", "title": "CMG Stock Price - Chipotle Mexican Grill Inc. Stock Quote (U.S.: NYSE) - MarketWatch", "title_full": "CMG Stock Price - Chipotle Mexican Grill Inc. Stock Quote (U.S.: NYSE) - MarketWatch", "published": "2019-04-01T13:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.252, "main_image": "http://mw2.wsj.net/mw5/content/logos/mw_logo_social.png", "performance_score": 0, "domain_rank": 900, "social": {"facebook": {"likes": 0, "comments": 1, "shares": 13}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "c8937c81cfa1b9ec20ebfa1488298b9e1a44b6b8", "url": "https://www.marketwatch.com/investing/stock/cmg", "ord_in_thread": 0, "author": "foxnews.com", "published": "2019-04-01T13:00:00.000+03:00", "title": "CMG Stock Price - Chipotle Mexican Grill Inc. Stock Quote (U.S.: NYSE) - MarketWatch", "text": "Chipotle Mexican Grill Inc. stock price, stock Quote: : s and financial overviews from MarketWatch.", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "cmg stock price - chipotle mexican grill inc", "sentiment": "negative"}, {"name": "marketwatch chipotle mexican grill inc.", "sentiment": "negative"}, {"name": "marketwatch", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T16:53:51.008+03:00"}, {"thread": {"uuid": "d3b586ced327fbf4920939af5e8db5236871b42e", "url": "https://www.sec.gov/divisions/corpfin/cf-noaction/2019/turnkey-jet-040219-2a1.htm", "site_full": "www.sec.gov", "site": "sec.gov", "site_section": "", "site_categories": ["sports", "baseball", "law_government_and_politics", "us_government_resources"], "section_title": "", "title": "TurnKey Jet, Inc.: No Action, Interpretive and/or Exemptive Letter of April 3, 2019", "title_full": "TurnKey Jet, Inc.: No Action, Interpretive and/or Exemptive Letter of April 3, 2019", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "", "performance_score": 0, "domain_rank": 4305, "social": {"facebook": {"likes": 33, "comments": 9, "shares": 25}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "d3b586ced327fbf4920939af5e8db5236871b42e", "url": "https://www.sec.gov/divisions/corpfin/cf-noaction/2019/turnkey-jet-040219-2a1.htm", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "TurnKey Jet, Inc.: No Action, Interpretive and/or Exemptive Letter of April 3, 2019", "text": "Response of the Division of Corporation Finance\nRe:\nTurnKey Jet, Inc. Incoming letter dated April 2, 2019\nBased on the facts presented, the Division will not recommend enforcement action to the Commission if, in reliance on your opinion as counsel that the Tokens are not securities, TKJ offers and sells the Tokens without registration under the Securities Act and the Exchange Act. Capitalized terms have the same meanings as defined in your letter.\nIn reaching this position, we particularly note that: TKJ will not use any funds from Token sales to develop the TKJ Platform, Network, or App, and each of these will be fully developed and operational at the time any Tokens are sold; the Tokens will be immediately usable for their intended functionality (purchasing air charter services) at the time they are sold; TKJ will restrict transfers of Tokens to TKJ Wallets only, and not to wallets external to the Platform; TKJ will sell Tokens at a price of one USD per Token throughout the life of the Program, and each Token will represent a TKJ obligation to supply air charter services at a value of one USD per Token; If TKJ offers to repurchase Tokens, it will only do so at a discount to the face value of the Tokens (one USD per Token) that the holder seeks to resell to TKJ, unless a court within the United States orders TKJ to liquidate the Tokens; and The Token is marketed in a manner that emphasizes the functionality of the Token, and not the potential for the increase in the market value of the Token.\nThis position is based on the representations made to the Division in your letter. Any different facts or conditions might require the Division to reach a different conclusion. Further, this response expresses the Division's position on enforcement action only and does not express any legal conclusion on the question presented.\nSincerely,", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "division of corporation finance re", "sentiment": "negative"}, {"name": "turnkey jet, inc", "sentiment": "neutral"}, {"name": "tokens", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T19:12:51.000+03:00"}, {"thread": {"uuid": "f3e3dea68fef874d4290717c2db827ceee475077", "url": "https://www.yahoo.com/news/apple-shows-signs-weakness-canceling-194226501.html", "site_full": "www.yahoo.com", "site": "yahoo.com", "site_section": "https://www.yahoo.com/news/", "site_categories": ["search_engine", "media", "tech"], "section_title": "Yahoo News - Latest News &amp; Headlines", "title": "Apple Shows Signs of Weakness After Canceling AirPower Wireless Charger", "title_full": "Apple Shows Signs of Weakness After Canceling AirPower Wireless Charger", "published": "2019-04-02T03:42:00.000+03:00", "replies_count": 8, "participants_count": 8, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://s.yimg.com/uu/api/res/1.2/jB6mpWf_hxZ2e4VA.Byw7w--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/2d8c2bdd3c9c522e5bec43109cb7292a", "performance_score": 0, "domain_rank": 5, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "f3e3dea68fef874d4290717c2db827ceee475077", "url": "https://www.yahoo.com/news/apple-shows-signs-weakness-canceling-194226501.html", "ord_in_thread": 0, "author": "rad Moon", "published": "2019-04-02T03:42:00.000+03:00", "title": "Apple Shows Signs of Weakness After Canceling AirPower Wireless Charger", "text": "On Friday afternoon, Apple (NASDAQ: AAPL ) did something unusual, but not entirely unexpected. The company officially canceled the AirPower. The company’s wireless charger was not a rumor — AAPL announced the product on stage at its 2017 iPhone event. However, after a year and a half of delays and quietly scrubbing AirPower references from its website, Apple threw in the towel. The company released a statement saying the wireless charge mat has been canceled, apologizing to the customers who have been waiting for it. Apple Shows Signs of Weakness After Canceling AirPower Wireless Charger More Source: Apple\nGiven that wireless charging is a prominent feature of recent Apple products, including all new iPhones, the Apple Watch and the AirPods, the misstep is not only embarrassing, but it’s also leaving money on the table. Despite the bad PR, Apple stock actually saw a slight rise for Friday afternoon’s close.\nIt’s Official: The Apple AirPower Is Dead On Friday afternoon, Apple sent an e-mailed statement to TechCrunch , finally conceding defeat on the AirPower wireless charger.\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n“After much effort, we’ve concluded AirPower will not achieve our high standards and we have cancelled the project. We apologize to those customers who were looking forward to this launch. We continue to believe that the future is wireless and are committed to push the wireless experience forward.”\nThat puts an end to the product that AAPL first announced at its 2017 iPhone event .\nWhat Was the AirPower and Why Was It Important? Apple has been moving its mobile products toward wireless charging capability, but it has been several years behind rivals like Samsung in supporting the technology in the iPhone. And while the Apple Watch charges wirelessly, it does so with proprietary magnetic induction technology — not the Qi standard that smartphones (including the iPhone) use.\n10 Tech Stocks That Transformed Their Business With no wireless charger of its own, Apple was leaving money on the table with every iPhone sold. Customers who wanted to use the convenient feature had to buy a third-party charger.\nWith Apple stock feeling the pressure from slowing iPhone revenue, these add-on sales become even more important. Apple decided to release its own wireless charger, but wanted its version to charge everything — iPhone, Apple Watch and AirPods. The company also wanted to set the bar high for ease of use, so products could be set anywhere on the mat (not in designated locations) and they would just start charging.\nImmediately after the announcement, the AirPower was featured on Apple’s website, but the delivery date soon changed to read “coming in 2018” and then “currently unavailable.” After the 2018 iPhone event, the AirPower disappeared from Apple’s website altogether, even as AAPL continued to promote the wireless charging capability of its devices. When the second-generation AirPods wireless earbuds were released several weeks ago, the retail box had a picture of the AirPower charging mat .\nAn Embarrassing Debacle for AAPL Like any tech company, Apple has products it works on sometimes right up to the prototype stage and then abandons. That is expected.\nThe difference with the AirPower is that the company actually announced the product (at its biggest event of the year), showed off pictures of it, put it on its website, kept people guessing for a year and a half and then cancelled it.\nMaking the situation far worse is the fact that wireless chargers are mainstream. There are hundreds of them on the market. Samsung offers its own version for the Galaxy smartphones, and Alphabet’s (NASDAQ: GOOG , NASDAQ: GOOGL ) Google sells one for the Pixel.\nThird-party companies are in on the action as well. I recently reviewed a Nomad Base Station that will wirelessly charge an iPhone and AirPods, plus an Apple Watch simultaneously. It works flawlessly, although the Apple Watch charger is physically separate from the charge mat.\nApple apparently ran into a wall by trying to be too ambitious. The company wanted the AirPower to charge multiple devices simultaneously when placed anywhere on its surface while displaying real-time charge levels of each on a iPhone. That approach reportedly resulted in overheating issues that Apple engineers were unable to overcome.\n7 ETFs to Buy for Serious Diversification Unfortunately, the public perception is that Apple took a year and a half to try to make a wireless charger — a commodity product — and failed. And it made a big deal about a new product, then killed it. Add to that the fact that it has been trumpeting the wireless charging capability of its products, but has no wireless charger to go with them. The AirPower episode has eroded the public’s perception of Apple’s design prowess.\nHowever, of more immediate concern to AAPL investors is that the lack of a wireless charger means every time the company sells an iPhone or set of AirPods, customers who want the convenience will add a third-party wireless charger to their cart. That’s anywhere from $50 to $150 in potential revenue that could have gone toward helping Apple stock weather the iPhone sales decline.\nAs of this writing, Brad Moon did not hold a position in any of the aforementioned securitie s.\nMore From InvestorPlace 2 Toxic Pot Stocks You Should Avoid 10 Tech Stocks That Transformed Their Business 8 Genomic Testing Stocks That Can Ease the Sting of Theranos 7 Weak Blue-Chip Stocks to Trim Immediately Compare Brokers\nThe post Apple Shows Signs of Weakness After Canceling AirPower Wireless Charger appeared first on InvestorPlace .", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://investorplace.com/options-trading/broker-center/", "https://investorplace.com/2018/10/toxic-pot-stocks-to-avoid?cid=MKT382818&eid=MKT385969", "https://investorplace.com&quot;", "https://investorplace.com/2019/04/7-etfs-to-buy-for-serious-diversification/", "https://s.yimg.com/ny/api/res/1.2/E4zutPCERrBaF0venfP0wA--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9NzI4O2g9NDAw/https://media.zenfs.com/en-US/investorplace_417/2d8c2bdd3c9c522e5bec43109cb7292a);", "https://investorplace.com", "https://investorplace.com/stock-quotes/googl-stock-quote/&quot;", "https://investorplace.com/stock-quotes/goog-stock-quote/&quot;", "https://investorplace.com/2019/03/7-weak-blue-chip-stocks-to-trim-immediately/", "https://investorplace.com/2019/04/apple-shows-signs-of-weakness-after-canceling-airpower-wireless-charger/", "https://investorplace.com/2019/03/10-tech-stocks-that-transformed-their-business/", "https://investorplace.com/2019/03/8-genomic-testing-stocks-that-can-ease-the-sting-of-theranos/", "https://investorplace.com/stock-quotes/aapl-stock-quote/", "https://investorplace.com/2017/09/apple-event-iphone-x-lives-up-to-hype/&quot;", "https://investorplace.com/options-trading/broker-center/&quot;", "https://s.yimg.com/ny/api/res/1.2/E4zutPCERrBaF0venfP0wA--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9NzI4O2g9NDAw/https://media.zenfs.com/en-US/investorplace_417/2d8c2bdd3c9c522e5bec43109cb7292a", "https://investorplace.com/stock-quotes/goog-stock-quote/", "https://investorplace.com/2017/09/apple-event-iphone-x-lives-up-to-hype/", "https://investorplace.com/stock-quotes/googl-stock-quote/", "https://investorplace.com/2019/04/apple-shows-signs-of-weakness-after-canceling-airpower-wireless-charger/&quot;"], "entities": {"persons": [], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "apple shows signs of weakness after canceling airpower wireless charger", "sentiment": "negative"}, {"name": "aapl", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T22:24:43.011+03:00"}, {"thread": {"uuid": "245a282277a88f46e85400aa1df533ad59343617", "url": "https://article.wn.com/view/2019/04/03/Cree_Inc_Announces_2019_Second_Quarter_Earnings_Release_Webc/", "site_full": "article.wn.com", "site": "wn.com", "site_section": "http://rss.wn.com/English/keyword/science", "site_categories": ["media"], "section_title": "WN.com - Science News", "title": "Cree, Inc. Announces 2019 Second Quarter Earnings Release Webcast", "title_full": "Cree, Inc. Announces 2019 Second Quarter Earnings Release Webcast - Worldnews.com", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "GB", "spam_score": 0.0, "main_image": "", "performance_score": 0, "domain_rank": 5594, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "245a282277a88f46e85400aa1df533ad59343617", "url": "https://article.wn.com/view/2019/04/03/Cree_Inc_Announces_2019_Second_Quarter_Earnings_Release_Webc/", "ord_in_thread": 0, "author": "wn.com", "published": "2019-04-02T03:00:00.000+03:00", "title": "Cree, Inc. Announces 2019 Second Quarter Earnings Release Webcast", "text": "What: Cree, Inc. ( NASDAQ : CREE) Q2 2019 Quarterly Earnings Webcast\nWhen: January 30 , 2019 at 5:00 p.m. EST\nWhere: http ://investor.cree.com/events .cfm\nHow: Live over the Internet - Simply log in at the address above. The recorded webcast will also be available at the address above for replay.", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "cree, inc", "sentiment": "neutral"}], "locations": []}, "rating": null, "crawled": "2019-04-03T23:31:01.028+03:00"}, {"thread": {"uuid": "6c26d34781e84c256d009b711df8f47e98b0ebe4", "url": "https://www.inc.com/video/founders-project/how-the-founder-of-boxed-raised-50-million-through-networking.html", "site_full": "www.inc.com", "site": "inc.com", "site_section": "", "site_categories": ["media", "business_software", "business", "marketing"], "section_title": "", "title": "How the Founder of Boxed Raised $50 Million Through Networking [VIDEO] | Inc.com", "title_full": "How the Founder of Boxed Raised $50 Million Through Networking [VIDEO] | Inc.com", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.008, "main_image": "https://www.incimages.com/uploaded_files/image/BoxedSite_387900.jpg", "performance_score": 0, "domain_rank": 1265, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "6c26d34781e84c256d009b711df8f47e98b0ebe4", "url": "https://www.inc.com/video/founders-project/how-the-founder-of-boxed-raised-50-million-through-networking.html", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "How the Founder of Boxed Raised $50 Million Through Networking [VIDEO] | Inc.com", "text": "Enter your email to reset your password Or sign up using: New member? Sign up now. Sign in if you're already registered. Get Inc. Straight to Your Inbox SIGN UP FOR TODAY'S 5 MUST READS How the Founder of Boxed Raised $50 Million Through Networking IMAGE: How the Founder of Boxed Raised $50 Million Through Networking Boxed co-founder and CEO, Chieh Huang, explains how he introduces himself to new people while networking, and how it's led to lots of capital. Published on: Apr 2, 2019 Recommended Videos ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "chieh huang", "sentiment": "none"}], "organizations": [], "locations": []}, "rating": null, "crawled": "2019-04-04T00:09:32.003+03:00"}, {"thread": {"uuid": "64aafe4d86d37d630e475086f36e9c97a6bca518", "url": "https://itunes.apple.com/il/album/monopoly-single/1458183717", "site_full": "itunes.apple.com", "site": "apple.com", "site_section": "", "site_categories": ["tech", "television", "shopping", "mac_support", "entertainment"], "section_title": "", "title": "‎MONOPOLY - Single by Ariana Grande & Victoria Monét on Apple Music", "title_full": "‎MONOPOLY - Single by Ariana Grande & Victoria Monét on Apple Music", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.003, "main_image": "https://is1-ssl.mzstatic.com/image/thumb/Music113/v4/8d/57/c9/8d57c9c5-f401-8378-63dd-20fb83545e4b/00602577684357.rgb.jpg/1200x630wp.png", "performance_score": 0, "domain_rank": 49, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "64aafe4d86d37d630e475086f36e9c97a6bca518", "url": "https://itunes.apple.com/il/album/monopoly-single/1458183717", "ord_in_thread": 0, "author": "", "published": "2019-04-01T03:00:00.000+03:00", "title": "‎MONOPOLY - Single by Ariana Grande & Victoria Monét on Apple Music", "text": "\nAfter a tease on Twitter, the besties drop a stellar new track. Preview ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "ariana grande & victoria monét", "sentiment": "negative"}], "locations": []}, "rating": null, "crawled": "2019-04-04T01:15:28.024+03:00"}, {"thread": {"uuid": "5fc2536b35ddf4aa31ff668903b284124cb3e54f", "url": "https://article.wn.com/view/2019/04/03/Snapon_Acquires_Power_Hawk_Technologies_Inc/", "site_full": "article.wn.com", "site": "wn.com", "site_section": "http://rss.wn.com/English/keyword/science", "site_categories": ["media"], "section_title": "WN.com - Science News", "title": "Snap-on Acquires Power Hawk Technologies, Inc.", "title_full": "Snap-on Acquires Power Hawk Technologies, Inc. - Worldnews.com", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "GB", "spam_score": 0.0, "main_image": "", "performance_score": 0, "domain_rank": 5594, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "5fc2536b35ddf4aa31ff668903b284124cb3e54f", "url": "https://article.wn.com/view/2019/04/03/Snapon_Acquires_Power_Hawk_Technologies_Inc/", "ord_in_thread": 0, "author": "wn.com", "published": "2019-04-01T03:00:00.000+03:00", "title": "Snap-on Acquires Power Hawk Technologies, Inc.", "text": "Expands Capabilities in Serving Critical Industries in Military and Emergency Services\nKENOSHA, Wis. --(BUSINESS WIRE )--Apr. 3, 2019-- Snap-on Incorporated ( NYSE : SNA ), a leading global innovator, manufacturer and marketer of tools, equipment, diagnostics, repair information and systems solutions for professional users", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "emergency services", "sentiment": "negative"}, {"name": "snap-on acquires power hawk technologies, inc", "sentiment": "neutral"}, {"name": "snap-on incorporated", "sentiment": "none"}], "locations": [{"name": "wis", "sentiment": "none"}, {"name": "kenosha", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-04T01:52:32.009+03:00"}, {"thread": {"uuid": "d05bc3ce6148a60a57e17ad3b4cd450d9f86cf48", "url": "https://open.spotify.com/track/1d2LjDnlf9C9kHmWAsQmD6", "site_full": "open.spotify.com", "site": "spotify.com", "site_section": "", "site_categories": ["music", "entertainment"], "section_title": "", "title": "ロマンチシズム, a song by Mrs. GREEN APPLE on Spotify", "title_full": "ロマンチシズム, a song by Mrs. GREEN APPLE on Spotify", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "JP", "spam_score": 0.0, "main_image": "https://i.scdn.co/image/6d918c7fec835df07aece4c02dc3c20052f074d3", "performance_score": 0, "domain_rank": 295, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "d05bc3ce6148a60a57e17ad3b4cd450d9f86cf48", "url": "https://open.spotify.com/track/1d2LjDnlf9C9kHmWAsQmD6", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "ロマンチシズム, a song by Mrs. GREEN APPLE on Spotify", "text": "\nWe and our partners use cookies to personalize your experience, to show you ads based on your interests, and for measurement and analytics purposes. By using our website and our services, you agree to our use of cookies as described in our Cookie Policy . ×\nThis browser doesn't support Spotify Web Player. Switch browsers or download Spotify for your desktop. ロマンチシズム ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "spotify", "sentiment": "none"}], "organizations": [], "locations": []}, "rating": null, "crawled": "2019-04-04T07:05:14.026+03:00"}, {"thread": {"uuid": "2086295427ba5569f9eba1e98fe9f65b81527911", "url": "https://www.standard.co.uk/lifestyle/esmagazine/apple-tv-video-streaming-a4107236.html", "site_full": "www.standard.co.uk", "site": "standard.co.uk", "site_section": "", "site_categories": ["united_kingdom", "travel"], "section_title": "", "title": "Can the new Apple TV service become a success? | London Evening Standard", "title_full": "Can the new Apple TV service become a success? | London Evening Standard", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "GB", "spam_score": 0.103, "main_image": "https://static.standard.co.uk/s3fs-public/thumbnails/image/2019/04/02/13/Tim-Cook.jpg", "performance_score": 0, "domain_rank": 5829, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "2086295427ba5569f9eba1e98fe9f65b81527911", "url": "https://www.standard.co.uk/lifestyle/esmagazine/apple-tv-video-streaming-a4107236.html", "ord_in_thread": 0, "author": "John Arlidge", "published": "2019-04-02T03:00:00.000+03:00", "title": "Can the new Apple TV service become a success? | London Evening Standard", "text": "Can the new Apple TV service become a success?\nCan Apple’s new TV offering conquer the booming video streaming market? The latest lifestyle, fashion and travel trends ES Lifestyle newsletter The latest lifestyle, fashion and travel trends Enter your email address Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid You already have an account. Please log in .\nRegister with your social account or click here to log in I would like to receive trends and interviews from fashion, lifestyle to travel every week, by email Update newsletter preferences\nIt was the kind of line-up you expect to see on the starry boulevards of Los Angeles, not the dreary, rain-flecked streets of Silicon Valley.\nThere was Oprah Winfrey , Steven Spielberg , Reese Witherspoon , Jennifer Aniston , Steve Carell , Octavia Spencer and JJ Abrams. Even Big Bird from Sesame Street took to the stage. They had come to celebrate the marriage of Hollywood and Apple. Apple is ‘the company that has reimagined how we communicate’, Winfrey said as the company’s CEO, Tim Cook, wearing grey jeans and sneakers, looked on, grinning. ‘That represents a genuine opportunity to make a big impact. They are in a billion pockets, y’all — a billion pockets!’\nApple TV+, which Cook and his shiny new best friends launched at Apple’s Cupertino headquarters last week, is a new video streaming service with $1bn-a-year (£770m) worth of original programming. That billion has been well spent — on pulling in Winfrey, who has two documentaries and a new format for her legendary book club in the works, and on commissioning Spielberg’s big-budget reboot of his 1980s sci-fi anthology series Amazing Stories. When the service launches this autumn in more than 100 countries, including the UK, other highlights will include Truth Be Told, a crime drama starring Oscar-winner Spencer, and star-spangled satire The Morning Show, about daytime TV anchors, which has already been commissioned for two seasons and for which Witherspoon and Aniston are reportedly being paid $1.1 million per episode. The cast also includes Carell, Gugu Mbatha-Raw, Billy Crudup and Mark Duplass. Apple is set to take on Netflix with new streaming platform\nThe service will also provide access to hit shows from other networks, such as HBO, Showtime, Starz and CBS. A subscription to Apple TV+, which will not carry advertising, is expected to cost less than £10 a month.Cook hopes seamless access to existing popular shows coupled with ‘must watch’ exclusive Apple content will give his firm the edge over other media players, generate fresh subscriber revenue and encourage Apple users to stick with their iPhones and iPads instead of switching to other hardware providers.\nIt’s not hard to see why he and Hollywood are excited. As well as Winfrey and friends, Apple has hired plenty of commissioning talent, including Jay Hunt, who ran Channel 4 from 2011 to 2017, and Jamie Erlicht and Zack Van Amburg, who brought Breaking Bad to Sony. Apple’s base of 1.4 billion iPhones, iPads and Macs in use globally gives it a vast distribution platform. What’s more, Apple knows a thing or two about entertainment subscription services. It already enjoys a huge audience through Apple Music, which has 56 million subscribers and is growing faster than the larger and more established Spotify. Analysts predict Apple will make around $50bn from online services, including iTunes, this year.\nAdd this to a commitment to viewer privacy and a commercial proposition that is attractive to programme makers — Apple does not want to own all its content, in contrast to Netflix and Amazon, which want copyright — and the future looks bright. ‘There’s potential in a future Apple mega-bundle of TV services,’ says Matthew Ball, an independent media consultant and former head of strategy at Amazon Studios.\nBut there are snags. When Apple released iTunes in 2003, it took advantage of the big record labels’ failure to come up with a business model for the file-sharing age to pioneer a new way to package and sell music. With video streaming ­— much like its music-streaming service, which launched seven years later than Spotify ­— Apple is coming late to the game. Very late. Rival services are well established and popular.\nNetflix, which now serves nearly 140 million subscribers, is sinking more than $10bn into content annually, more than twice as much as any other studio and 10 times Apple’s spend. It made 700 original TV shows and 80 movies last year. One film, Roma , won its director, Alfonso Cuarón, an Oscar at this year’s awards. Amazon’s Prime Video streaming service has a budget of around $5bn and some speculate it will outspend Netflix by 2021. It has enjoyed top ratings with series such as Transparent, and recently premiered Hanna, starring Samantha Morton’s daughter, Esme Creed-Miles. Hanna (Image supplied by Capital Pictures)\nDisney is also joining the fray. The media giant, which has just closed its $71bn takeover of 21st Century Fox, is pulling its top content from Netflix and other streaming services and starting its own, Disney+, later this year. The Marvel Cinematic Universe will join a slate there that includes a Star Wars vehicle, created by veteran Marvel and Disney hit-maker, Jon Favreau, which will be set in the time between Return of the Jedi and The Force Awakens. It is rumoured to cost around $100m for 10 episodes, rivalling the cost of Netflix’s most lavish creation, the multi Emmy-winning drama The Crown. \"Apple has reimagined how we communicate. They are in a billion pockets, y’all — a billion pockets!” Oprah Winfrey\nFacebook has also launched Facebook Watch, an entertainment service that features stars including Bear Grylls. Consumers here in the UK will later this year be able to sign up for another new streaming service, BritBox . That’s the joint BBC and ITV service, which Channel 4 is also expected to join soon. It will mainly feature archive shows, alongside new British commissions made for the service. BritBox is already operating in the US, where it has more than half a million subscribers.\nCook concedes Apple has little experience in making TV and his firm has had early setbacks in its existing iTunes streaming services, the forerunner to Apple TV+. Two projects it released in 2017, Planet of the Apps and James Corden’s Carpool Karaoke, were uninspiring. The extended Carpool format was too long for many fans used to snackable bites. Then there is the tricky question of taste. Cook is a conservative fellow. His favourite TV shows are Friday Night Lights and Madam Secretary. Company insiders say he insists Apple content cannot be too edgy. ‘He’s worried that a negative reaction to a series could spark a consumer boycott of Apple’s core business,’ one executive says. He vetoed what would have been the firm’s first scripted drama, Vital Signs, a dark, semi-biographical tale of hip-hop artist Dr Dre, because it featured cocaine, an extended orgy and an abundance of guns. Cardi B causes chaos on Carpool Karaoke with 'driving lesson'\nApple’s early offerings certainly seem a little tame. As well as the new shows already announced, it has struck a deal with Isaac Asimov’s estate for his Foundation epic, about scientists struggling to preserve a human-run Galactic Empire, and there is a Terry Gilliam series based on his 1981 fantasy film Time Bandits.\nThe trouble is, bold work is what newcomers need to get noticed in the media business, especially when they are playing catch-up. Netflix built its original-content business on House of Cards, a drama about an ethically bankrupt politician, and Orange is the New Black, about a women’s prison. Both featured robust language and plenty of sex. Amazon has supported ambitious original series such as The Romanoffs by Matthew Weiner, creator of Mad Men, and Mozart in the Jungle. House of Cards\nPerhaps the biggest question of all is: will consumers be prepared to pay for yet another streaming service — even if it comes from the most successful and valuable tech company ever? It isn’t clear whether the marketplace can sustain the volume of content already being produced. Since 2014, the number of streaming shows has grown nearly 40 per cent, according to analysts FX. ‘If you look at the market, the average consumer may have room to add a service or two but the ceiling of what a consumer will pay is soon reached,’ says Andrew Hare, senior vice-president of digital research and strategy at Magid Associates.\nCan Apple TV+ succeed where services such as the A-List-backed music streaming service Tidal (which never managed to become a serious rival to Apple Music or Spotify) failed? It looks like Cook and his Hollywood friends have their work cut out.", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "jennifer aniston", "sentiment": "none"}, {"name": "steve carell", "sentiment": "none"}, {"name": "tim cook", "sentiment": "none"}, {"name": "steven spielberg", "sentiment": "none"}, {"name": "reese witherspoon", "sentiment": "none"}, {"name": "oprah winfrey", "sentiment": "none"}, {"name": "jj abrams", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "positive"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "sesame street", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "octavia spencer", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-04T09:47:22.036+03:00"}], "totalResults": 44, "moreResultsAvailable": 0, "next": "/filterWebContent?token=6c661f77-9010-47fb-9532-d5fdb563c97a&format=json&ts=1554360442036&q=published%3A%3E1553658014000+published%3A%3C1554172814000+domain_rank%3A%3C10000+site_type%3Anews+language%3Aenglish+title%3A%28%22Apple+Fellow%22+OR+%22Apple%22+OR+%22Apple+Incorporate%22+OR+%22Apple.com%22+OR+%22Apple+comp%22+OR+%22Apple+Computer%22+OR+%22Apple+Computers%22+OR+%22Inc.+Apple+Computer%22+OR+%22Apple%22+OR+%22Apple+pc%22+OR+%22Apple+inc%22+OR+%22Apple+Computer+Incorporated%22+OR+%22Apple+compputer%22+OR+%22List+of+Apple+Computer+CEOs%22+OR+%22Apple+computers%22+OR+%22Apple%2C+Inc.%22+OR+%22Apple+Incorporated%22+OR+%22Apple+incorporated%22+OR+%22Apple%22+OR+%22Apple+Computer%2C+Inc.%22+OR+%22Apple+logo%22+OR+%22Apple+Computer%2C+Inc%22+OR+%22Apple+Computer+Inc.%22+OR+%22Apple+Computer+Co.%22+OR+%22Apple+computer%22+OR+%22Apple+Inc%22+OR+%22Apple%2Cinc.%22+OR+%22AppleComputer%22+OR+%22Apple%2C+Inc%22+OR+%22Apple+inc.%22+OR+%22Apple+Company%22+OR+%22Spruce+Technologies%22+OR+%22Apple+Corporation%22+OR+%22Apple+Computer+Inc%22+OR+%22%EF%A3%BF+Inc%22+OR+%22Apple+computer+Inc%22+OR+%22Apple+incoporated%22+OR+%22Apple%22+OR+%22Apple+Computers+Incorporated%22+OR+%22Www.apple.com%22+OR+%22%EF%A3%BF+Inc.%22+OR+%22Apple%2C+inc.%22+OR+%22Apple%22+OR+%22Spruce+Text+List%22+OR+%22AppleInc.%22+OR+%22Apple+company%22+OR+%22Apple%C2%AE%22+OR+%22Appleinc%22+OR+%22Appleinc.%22+OR+%22Apple+Inc.%22+OR+%22Peltor%22+OR+%223m%22+OR+%22Minnesota+Mining+%26+Manufacturing%22+OR+%22Minnesota+Mining+and+Manufacturing+Company%22+OR+%22NYSE%3AMMM%22+OR+%223M+Co%22+OR+%223M+Company%22+OR+%22Minnesota+Mining+%26+Manufacturing+Company%22+OR+%223m+tape%22+OR+%22Minnesota+Mining+and+Manufacturing%22+OR+%223M+Corporation%22+OR+%223M+corporation%22+OR+%22Minnesota+Mining+%26+Mfg%22+OR+%22The+3M+Company%22+OR+%22The+Minnesota+Mining+and+Manufacturing+Company%22+OR+%22Minnesota+mining+and+manufacturing%22+OR+%223M+ESPE%22+OR+%223-m%22+OR+%223-M%22+OR+%223M+Co.%22+OR+%22Meguiar%27s%22+OR+%22DI-NOC%22+OR+%223M%22+OR+%22American+Express+Publishing%22+OR+%22Blue+from+American+Express%22+OR+%22Platinum+Card%22+OR+%22Americanexpress%22+OR+%22The+American+Express+Company%22+OR+%22Blue+From+American+Express%22+OR+%22American+Express+RED%22+OR+%22American+Express+Red+Card%22+OR+%22American+Express+Company%22+OR+%22American+Express+Bank%22+OR+%22American+Express+Bank+Limited%22+OR+%22American+Express+Bank+Ltd.%22+OR+%22Amex+Bank+of+Canada%22+OR+%22Ed+Gilligan%22+OR+%22AMEX+Bank+of+Canada%22%29", "requestsLeft": 976, "warnings": null}