{"posts": [{"thread": {"uuid": "a9c086aa05bdb14459372fa6f1c1c8d93bf9ea65", "url": "https://www.deseretnews.com/article/900063407/twitter-reacts-to-mcdonalds-shake-sauce-mcpickle-april-fools-day-prank.html", "site_full": "www.deseretnews.com", "site": "deseretnews.com", "site_section": "http://www.deseretnews.com/world-nation/index.rss", "site_categories": ["media"], "section_title": "U.S. & World News | Deseret News", "title": "Twitter reacts to McDonald's Shake Sauce, McPickle April Fools' Day prank", "title_full": "Twitter reacts to McDonald's Shake Sauce, McPickle April Fools' Day prank", "published": "2019-04-01T22:21:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://media.deseretdigital.com/file/55b0645302.jpg?crop=top:0|left:0|width:1200|height:630&quality=100&resize=width:1200&order=resize,crop&c=14&a=19509ab9", "performance_score": 0, "domain_rank": 2973, "social": {"facebook": {"likes": 25, "comments": 3, "shares": 31}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "a9c086aa05bdb14459372fa6f1c1c8d93bf9ea65", "url": "https://www.deseretnews.com/article/900063407/twitter-reacts-to-mcdonalds-shake-sauce-mcpickle-april-fools-day-prank.html", "ord_in_thread": 0, "author": "Herb Scribner", "published": "2019-04-01T22:21:00.000+03:00", "title": "Twitter reacts to McDonald's Shake Sauce, McPickle April Fools' Day prank", "text": "SALT LAKE CITY — McDonald’s had an April Fools' Day prank that some fans wished was real.\nMcDonald ’s posted a photo on Instagram Monday morning that showed four new dipping sauces called “Shake Sauce.” The sauce flavors — strawberry, vanilla, chocolate and shamrock — all corresponding with a shake flavor from McDonald’s.\nSee the post below.\nView this post on Instagram Meet #ShakeSauce — a sweet new way to dip.\nA post shared by McDonald's (@mcdonalds) on Apr 1, 2019 at 5:01am PDT\nThe photo certainly tastes like an April Fools' joke. But there are some who wished it was real.\n“Yo this is genius,” one commenter wrote.\nAnother said, “April fools? I bloody hope not.”\nComment on this story Australia: McDonald’s had a second prank for April Fools’ Day — the new McPickle sandwich. The Australian McDonald’s page shared an image of the new sandwich, which was basically a Big Mac but with pickles.\n\"Pickle lovers, it’s the news you’ve all been waiting for. We’re super stoked to announce the launch of our brand new McPickle Burger. It’s time to tuck into juicy, flavoursome pickles layered between melted cheese, ketchup sauce and toasted sesame seed buns. It’s sure to be a treat for all your senses.\"\nView this post on Instagram Pickle lovers, it’s the news you’ve all been waiting for. We’re super stoked to announce the launch of our brand new McPickle Burger. It’s time to tuck into juicy, flavoursome pickles layered between melted cheese, ketchup sauce and toasted sesame seed buns. It’s sure to be a treat for all your senses. #dailynuggets #mcpickle #pickleoverload #maccas #imlovinit\nA post shared by McDonald's Australia (@mcdonaldsau) on Mar 31, 2019 at 1:03pm PDT\nSocial media praised the idea.\nAccording to Delish.com , you can get the McPickle … sort of. Just order a Big Mac without sauce, onions or beef and add extra pickles.", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://www.instagram.com/p/BvtlBd4hxeo/?utm_source=ig_embed&utm_medium=loading", "https://t.co/pNLhauvWS2", "https://www.instagram.com/mcdonalds/?utm_source=ig_embed&utm_medium=loading", "https://www.instagram.com/p/Bvr3W-AjUWd/?utm_source=ig_embed"], "entities": {"persons": [], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "mcdonald's shake sauce", "sentiment": "neutral"}], "locations": [{"name": "australia", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T00:12:04.024+03:00"}, {"thread": {"uuid": "73a37d48779030fb05727bf9cc030cda9ae4eeec", "url": "https://www.foxbusiness.com/media/april-fools-day-pranks-mcdonalds-tmobile-others-tricked-customers", "site_full": "www.foxbusiness.com", "site": "foxbusiness.com", "site_section": "https://www.foxnews.com/", "site_categories": ["investing", "financial_news", "finance"], "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "title": "April Fools' Day pranks: McDonald's, T-Mobile and 6 others that tricked customers Business", "title_full": "April Fools' Day pranks: McDonald's, T-Mobile and 6 others that tricked customers | Fox Business", "published": "2019-04-01T23:02:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.008, "main_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/04/0/0/T-Mobile-box.jpg?ve=1&amp;tl=1", "performance_score": 0, "domain_rank": 5795, "social": {"facebook": {"likes": 20, "comments": 4, "shares": 34}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "73a37d48779030fb05727bf9cc030cda9ae4eeec", "url": "https://www.foxbusiness.com/media/april-fools-day-pranks-mcdonalds-tmobile-others-tricked-customers", "ord_in_thread": 0, "author": "Thomas Barrabi", "published": "2019-04-01T23:02:00.000+03:00", "title": "April Fools' Day pranks: McDonald's, T-Mobile and 6 others that tricked customers Business", "text": "April Fools' Day pranks: McDonald's, T-Mobile and 6 others that tricked customers By Thomas Barrabi Published April 01, 2019 Business Leaders FOXBusiness\n video Kellogg to sell cookie business Kellogg announced plans to sell its Keebler cookie business to Nutella-owner Ferrero.\nSome of the world’s top companies and business leaders couldn’t resist pranking the public Monday on April Fools’ Day.\nBusinesses have regularly utilized social media to capitalize on April Fools’ Day with viral marketing stunts in recent years. Amazon-owned Audible, SodaStream and McDonald’s are just a few major brands participating in this year’s festivities.\nFOX Business breaks down this year’s best business-related pranks below.\nAmazon’s Audible targets a new audience\nAdvertisement\nThe audiobook and entertainment platform joked that it was launching a new platform “for fish,” noting that “13 out of 27 fish owners reported a positive change in their pets’ behavior” after they listened to Audible.\n“Fill your fishes’ three-second memories with the soothing sounds of underwater audio, and then play it again! Because they won’t remember anyway,” the brand said in a fake press release .\nBurger King&apos;s \"Impossible\" Whopper\nThe fast-food chain said it would test out a Whopper featuring the Impossible burger patty, a plant-based meat substitute, at 59 restaurants in the St. Louis area. While the market test is real, Burger King pranked loyal Whopper fans by serving them the meatless version of the meal.\nGoogle Maps lets users play games\nIn honor of April Fools&apos; Day, Google introduced a feature that turned its \"Maps\" app into a version of the classic video game \"Snake.\"\nHelloFresh&apos;s \"Unicorn Box\"\nThe meal-kit delivery company unveiled a unicorn-themed box of ingredients, featuring recipes for \"Pixie Pizza\" and \"Fairy Fettuccine.\" It&apos;s probably a good thing the box isn&apos;t real, because most of its offerings appear to be composed entirely of sugar.\nMcDonald&apos;s unveils the \"McPickle\"\nThe fast-food powerhouse had a little fun with its Australia-based customers by debuting a burger filled almost exclusively with pickles. More than a few social media users were actually excited about the McPickle before learning it was a joke.\nPatriots star Tom Brady “retires”\nThe six-time Super Bowl champion celebrated the launch of his official Twitter account on Monday by “retiring” in his first-ever post. Brady quickly made it clear that he was joking, but the original tweet generated more than 20,000 retweets just two hours after it went live.\nSodaStream turns burps into carbonated water\nThe company known for its home beverage carbonation systems unveiled the \"SodaStreamMe,\" a faux-invention endorsed by astronaut Scott Kelly. The fictional water bottle uses a person&apos;s burps to produce carbonated water.\nT-Mobile&apos;s portable phone booth\nWith the introduction of the \"T-Mobile Phone BoothE Mobile EditionE,\" the wireless provider jokingly provided customers with a portable phone booth for private phone calls that is literally \"just a cardboard box with a hole in it.\"", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://www.audible.com/ep/audible-for-fish-intro?source_code=ORGGB156032819003K", "https://www.foxnews.com/food-drink/mcdonalds-april-fools-day-joke-about-new-burger-angers-australian-customers", "https://www.t-mobile.com/brand/t-mobile-boothe", "https://www.youtube.com/embed/N9FED3jkNTo"], "entities": {"persons": [{"name": "thomas barrabi", "sentiment": "negative"}, {"name": "ferrero", "sentiment": "none"}], "organizations": [{"name": "t-mobile", "sentiment": "negative"}, {"name": "mcdonald", "sentiment": "negative"}, {"name": "kellogg", "sentiment": "none"}, {"name": "continue reading below businesses", "sentiment": "none"}, {"name": "facebook twitter comments print", "sentiment": "none"}, {"name": "keebler", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-02T00:21:07.001+03:00"}, {"thread": {"uuid": "edef55694d75204d3e268b278f5a6d4be812ac4b", "url": "https://www.thesun.co.uk/tvandshowbiz/8768841/eastenders-grange-hill-lee-macdonald-zammo-mcguire/", "site_full": "www.thesun.co.uk", "site": "thesun.co.uk", "site_section": "https://www.thesun.co.uk/feed", "site_categories": ["media"], "section_title": "The Sun", "title": "Grange Hill legend Lee MacDonald lands role on EastEnders 32 years after playing ‘drug kid’ Zammo McGuire", "title_full": "Grange Hill legend Lee MacDonald lands role on EastEnders 32 years after playing ‘drug kid’ Zammo McGuire", "published": "2019-04-02T00:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "GB", "spam_score": 0.0, "main_image": "https://www.thesun.co.uk/wp-content/uploads/2019/04/VP-COMP-PG-19-EXCL.jpg?strip=all&amp;quality=100&amp;w=1200&amp;h=800&amp;crop=1", "performance_score": 5, "domain_rank": 2180, "social": {"facebook": {"likes": 3198, "comments": 508, "shares": 531}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "edef55694d75204d3e268b278f5a6d4be812ac4b", "url": "https://www.thesun.co.uk/tvandshowbiz/8768841/eastenders-grange-hill-lee-macdonald-zammo-mcguire/", "ord_in_thread": 0, "author": "FIONA NIMONI", "published": "2019-04-02T00:00:00.000+03:00", "title": "Grange Hill legend Lee MacDonald lands role on EastEnders 32 years after playing ‘drug kid’ Zammo McGuire", "text": "GRANGE Hill legend Lee MacDonald is joining EastEnders in a surprise acting comeback 32 years after playing Zammo McGuire. Lee has been running a locksmiths and key-cutting business since retiring …", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "zammo mcguire", "sentiment": "neutral"}, {"name": "mo grange hill", "sentiment": "neutral"}, {"name": "lee macdonald", "sentiment": "neutral"}, {"name": "grange hill", "sentiment": "neutral"}, {"name": "jackie wright", "sentiment": "none"}, {"name": "andy halls", "sentiment": "none"}, {"name": "zammo", "sentiment": "none"}, {"name": "lee", "sentiment": "none"}, {"name": "maguire", "sentiment": "none"}, {"name": "samuel 'zammo", "sentiment": "none"}, {"name": "slater", "sentiment": "none"}, {"name": "laila morse", "sentiment": "none"}, {"name": "zammo mcguire lee macdonald", "sentiment": "none"}, {"name": "tim polley", "sentiment": "none"}, {"name": "steven banks", "sentiment": "none"}, {"name": "melissa wilks", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "daily mail grange hill", "sentiment": "none"}], "locations": [{"name": "grange hill", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T00:44:13.001+03:00"}, {"thread": {"uuid": "a10928a773526efcae434e1519f977d2d180010b", "url": "https://uk.style.yahoo.com/april-fool-day-2019-best-100600124.html", "site_full": "uk.style.yahoo.com", "site": "yahoo.com", "site_section": "", "site_categories": ["search_engine", "fashion", "tech", "style_and_fashion"], "section_title": "", "title": "April Fool’s Day 2019: Best jokes so far, from the McDonald’s ‘McPickle’ to spreadable Yorkshire Tea", "title_full": "April Fool’s Day 2019: Best jokes so far, from the McDonald’s ‘McPickle’ to spreadable Yorkshire Tea", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://s.yimg.com/uu/api/res/1.2/yCXUyKuP16SOUTlf_GTWSQ--~B/aD00ODk7dz02NTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-GB/homerun/the_independent_577/9f60140b3e432db044b9e32e59a16586", "performance_score": 0, "domain_rank": 5, "social": {"facebook": {"likes": 6, "comments": 6, "shares": 26}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "a10928a773526efcae434e1519f977d2d180010b", "url": "https://uk.style.yahoo.com/april-fool-day-2019-best-100600124.html", "ord_in_thread": 0, "author": "Sabrina Barr", "published": "2019-04-01T03:00:00.000+03:00", "title": "April Fool’s Day 2019: Best jokes so far, from the McDonald’s ‘McPickle’ to spreadable Yorkshire Tea", "text": "Reblog 1 / 3 April Fool’s Day 2019: Best jokes so far, from the McDonald’s ‘McPickle’ to spreadable Yorkshire Tea April Fool's Day is a time to have your wits about you, as people around the world revel in pranking their friends, family and colleagues. The origins of the annual celebration can be traced back hundreds of years , yet many are still caught out on the day by believable hoaxes. In recent years, increasing numbers of brands have joined in the battle to fool as many people as possible. This year, companies including McDonald's , the British Transport Police and the BBC have joined in the fun by catching out gullible consumers with fabricated marketing campaigns. Here are some of the best April Fool's pranks so far this year: The McDonald's 'McPickle' burger For April Fool's Day, McDonald's Australia announced the launch of its new 'McPickle' burger on Instagram, made from \"juicy, flavoursome pickles layered between melted cheese, ketchup sauce and toasted sesame seed buns\". While the new addition to the fast food chain's menu may have seemed like an obvious April Fool's joke to some, others were still hopeful that it may turn out to be true. \"Omfg if this is [an] April Fool's joke imma be mad,\" one person commented on Instagram . \"I'm gonna order 1,000,\" a pickle aficionado remarked. However, the news was too good to be true, as McDonald's Australia later commented underneath the Instagram post, saying that the pickle burger was \"available until yesterday\". BBC iPlayer introduces 'Skip The Sex' option For their April Fool's Day gag, BBC iPlayer announced the addition of a new feature on the on-demand platform: the 'Skip The Sex' button. The BBC explained that the feature would be ideal for anyone who would rather avoid \"awkward sex scenes\" while watching television with the family or on public transport. \"Fornication with the family? Skip. Titillation on the train? Skip. Intercourse with the in-laws? Skip,\" the advert states. While the feature is evidently not going to actually be made available, some television watchers have said that they think it could actually be a good idea in future. \"I know this is an April Fool's but it would be a good feature,\" one person tweeted . \"Now if this were real I'd be able to watch Game of Thrones with my husband and son!\" another added . A ban on smelly food on trains Fed up of having to endure stinky sandwiches and smelly snacks on trains? As part of new anti-social behaviour legislation, those caught eating offensive food items while in transit could face a penalty fare of up to £2,000. Check before you travel 👉 https://t.co/kePXd0M6Yz pic.twitter.com/Or9LRThRsw — British Transport Police (@BTP) April 1, 2019 There's nothing worse than sitting down on a train for your daily commute, only for the passenger sitting next to you to start tucking into smelly food. The British Transport Police agrees, which is why for April Fool's it's announced those that do so could face a £2,000 fine. The police force stated that those \"caught eating offensive food items\" on public transport may face a penalty fare, as part of \"new anti-social behaviour legislation\". While the announcement was made in jest, several Twitter users said they'd almost been fooled. \"You know it's concerning when I'm actually having to wonder whether this is a joke or not,\" one person remarked . Cricketers to have Instagram handles on kits As part of our efforts to make the game more appealing to younger generations, the ICC will be applying both numbers and Instagram handles to kits from the beginning of the World Test Championship. pic.twitter.com/XnvantQfc9 — ICC (@ICC) April 1, 2019 While cricket is a popular game among sports fans of all ages, some may think of it as slightly more appealing to older generations. That's why the International Cricket Council (ICC) joked that players' kits will feature their Instagram handles on their kits from the beginning of the World Test Championship. \"In further changes ahead of the World Test Championship, the tradition of the coin toss will be replaced by a @Twitter poll, allowing fans at home to decide who bats and bowls!\" the organisation added. The ICC also said that when temperatures increase over summer, cricketers will be allowed to depart from cricket sartorial tradition by wearing shorts. \"I know it's a prank, but the idea of including social media handles is pretty good,\" one cricket fan remarked on Twitter. Story continues New Yorkshire Tea Spreadable! It's like normal tea, only thicker. pic.twitter.com/n2SahkFa4O — Yorkshire Tea (@YorkshireTea) April 1, 2019 The tea blend company made the announcement on Twitter, sharing a picture of the jar of the innovative spread with the tagline: \"Let's have a proper slice.\" Considering the recent launch of Marmite Peanut Butter , many could be forgiven for believing that Yorkshire Tea had created a spreadable tea but sadly, it was only an April Fool's. Nonetheless, some consumers expressed interest in the concept. \"I know the date but I would still buy this, lads,\" one person tweeted . \"I know this is a joke but hell I'd buy this perfect combo with a nice mug of Yorkshire tea strong,\" another commented . Sainsbury’s launches limited edition pink avocados Sainsbury's announces launch of limited edition pink avocados for April Fool's Day (Sainsbury's) More For this year’s April Fool’s, Sainsbury’s announced the launch of the pink avocado , describing it as the “first-of-its-kind”. Named the “Rosa-vo”, the supermarket claims the rose-hued fruit could prove popular among foodie millennials. “Whilst we know Sainsbury’s customers are loyal devotees to the iconic brunch dish, we felt it was about time the humble avo-toast was given a bit of a refresh and social-specific makeover,” a Sainsbury’s spokesperson said. While the concept of the pink avocado has been fabricated, it does look like it could make an appealing addition to any brunch menu. To stay up-to-date with all the revelry taking place in celebration of April Fool's Day, follow The Independent 's live blog here . Reblog What to read next ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "yorkshire tea reblog", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "british transport police", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T00:44:25.059+03:00"}, {"thread": {"uuid": "3c69ba83d0f6552ab43e32fc6a893807a222f926", "url": "https://www.bbc.com/news/uk-northern-ireland-47781253", "site_full": "www.bbc.com", "site": "bbc.com", "site_section": "https://www.bbc.com/news/northern_ireland", "site_categories": ["media"], "section_title": "Northern Ireland - BBC News", "title": "Mary Lou McDonald apologises over parade banner", "title_full": "Mary Lou McDonald apologises over parade banner - BBC News", "published": "2019-04-02T00:21:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "GB", "spam_score": 0.0, "main_image": "https://ichef.bbci.co.uk/news/1024/branded_news/B63F/production/_106055664_marylou_england.jpg", "performance_score": 0, "domain_rank": 130, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "3c69ba83d0f6552ab43e32fc6a893807a222f926", "url": "https://www.bbc.com/news/uk-northern-ireland-47781253", "ord_in_thread": 0, "author": "bbc.co.uk", "published": "2019-04-02T00:21:00.000+03:00", "title": "Mary Lou McDonald apologises over parade banner", "text": "Image copyright Sinn Féin Image caption Mary Lou McDonald taking part in New York's St Patrick's Day parade with the banner The Sinn Féin leader has apologised for marching behind an \"England get out of Ireland\" banner on St Patrick's Day.\nMary Lou McDonald moved to reassure the public that its message was not directed at English people.\n\"For anybody who felt that it was directed at English people, I just want to reassure them that's not the case,\" she said.\nMs McDonald was condemned for posing with the sign last month in New York City's annual parade.\nHer actions were described as offensive and divisive by Tánaiste (Irish deputy prime minister) Simon Coveney.\n'Very welcome' Speaking to RTÉ Radio 1, Ms McDonald said: \"In respect of St Patrick's Day, I think it starts certainly a conversation around that banner which has been up and down Fifth Avenue for a generation.\n\"It's a very direct political statement, it's an anti-partition statement.\n\"I know it was taken by some to be directed at English people. It certainly was not and is not...\n\"Indeed I have blood relatives myself who are English... and English people are very welcome in Ireland.\n\"Many of them live amongst us, they are our neighbours and our friends, so certainly I apologise to anybody who felt that the banner was intended in that way, and I'm happy to clarify that it's not.\"", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://www.bbc.co.uk/news/uk-northern-ireland-47601796"], "entities": {"persons": [{"name": "mary lou mcdonald", "sentiment": "negative"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "tánaiste", "sentiment": "none"}, {"name": "simon coveney", "sentiment": "none"}], "organizations": [{"name": "sinn féin image", "sentiment": "negative"}, {"name": "sinn féin", "sentiment": "none"}, {"name": "rté radio", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "fifth avenue", "sentiment": "none"}, {"name": "england", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T01:34:56.026+03:00"}, {"thread": {"uuid": "53817e8d7d6efa8db3f0b2c099fd5a9c030a6bf3", "url": "https://www.nydailynews.com/news/crime/ny-mcdonalds-pepper-stray-mace-mcdonalds-atlantic-city-20190401-cjs6zosnnbfyfhk33h7zjhj6dy-story.html", "site_full": "www.nydailynews.com", "site": "nydailynews.com", "site_section": "http://feeds.feedburner.com/google/fUmW", "site_categories": ["media", "celebrity_fan_gossip", "entertainment"], "section_title": "\"SECURITY\" - Google News", "title": "VIDEO: McDonald’s patron in Atlantic City pepper sprays security guard in massive brawl - New York Daily News", "title_full": "VIDEO: McDonald’s patron in Atlantic City pepper sprays security guard in massive brawl - New York Daily News", "published": "2019-04-01T23:54:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://www.nydailynews.com/resizer/D2qmGctovw39vzfwlGTXbmDKT5Y=/1200x0/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/KNTK2TYCGZBZTIRLFYX4OPRSAA.jpg", "performance_score": 0, "domain_rank": 811, "social": {"facebook": {"likes": 18, "comments": 5, "shares": 14}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "53817e8d7d6efa8db3f0b2c099fd5a9c030a6bf3", "url": "https://www.nydailynews.com/news/crime/ny-mcdonalds-pepper-stray-mace-mcdonalds-atlantic-city-20190401-cjs6zosnnbfyfhk33h7zjhj6dy-story.html", "ord_in_thread": 0, "author": "", "published": "2019-04-01T23:54:00.000+03:00", "title": "VIDEO: McDonald’s patron in Atlantic City pepper sprays security guard in massive brawl - New York Daily News", "text": "Apr 01, 2019 | 4:54 PM A woman stands on the counter of a McDonald's after macing employees inside this location. A fast-food beef in Atlantic City got out of hand when an enraged woman started macing fleeing employees, including a security guard.\nIt’s unclear why the filet of fists started, but a YouTube video posted over the weekend shows an irate woman in green sweat pants, along with several associates, storming the kitchen area of a Jersey Shore McDonald’s, sliding around on a slippery floor and throwing everything they can get their hands on at what appear to be scared employees. Advertisement\nThe woman who seems to be the ringleader of the instigating group leaps onto the fast-food restaurant’s counter and sprays an irritant into a break room, where a security guard is trying to separate the combatants. The guard receives an eyeball full of pepper spray for his troubles.\nThe melee happened early Saturday morning, according to the Press of Atlantic City , which quotes a manager at the junk food joint saying four women walked into the eatery and attacked an employee.\n“I’ve never seen anything like this in my life,” that manager said.\nCops said no charges were filed on the scene, but they are investigating. Advertisement", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://www.pressofatlanticcity.com/news/press/atlantic_city/video-shows-fight-pepper-spraying-at-atlantic-city-mcdonald-s/article_5922a3a5-d32d-5dc2-aa00-3da525ecf205.html"], "entities": {"persons": [], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "new york daily news", "sentiment": "negative"}], "locations": [{"name": "atlantic city", "sentiment": "none"}, {"name": "jersey shore mcdonald’s", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T01:52:50.000+03:00"}, {"thread": {"uuid": "3ae760c4ab06af320acfb83c62d433c08563d48a", "url": "https://www.stuff.co.nz/business/111723306/mcdonalds-buys-5m-stake-in-nzxlisted-plexure", "site_full": "www.stuff.co.nz", "site": "stuff.co.nz", "site_section": "http://stuff.co.nz/feeds/auckland/headlines.xml", "site_categories": ["media"], "section_title": "Stuff.co.nz - Stuff", "title": "McDonald's buys $5m stake in NZX-listed Plexure", "title_full": "McDonald's buys $5m stake in NZX-listed Plexure", "published": "2019-04-02T02:10:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "NZ", "spam_score": 0.0, "main_image": "https://resources.stuff.co.nz/content/dam/images/1/u/i/o/n/r/image.related.StuffLandscapeSixteenByNine.1420x800.1uim96.png/1554160226527.jpg", "performance_score": 0, "domain_rank": 2757, "social": {"facebook": {"likes": 2, "comments": 0, "shares": 14}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "3ae760c4ab06af320acfb83c62d433c08563d48a", "url": "https://www.stuff.co.nz/business/111723306/mcdonalds-buys-5m-stake-in-nzxlisted-plexure", "ord_in_thread": 0, "author": "TOM PULLAR-STRECKER", "published": "2019-04-02T02:10:00.000+03:00", "title": "McDonald's buys $5m stake in NZX-listed Plexure", "text": "McDonald's buys $5m stake in NZX-listed Plexure Tom Pullar-Strecker 12:10, Apr 02 2019 STUFF McDonald's has deepened its relationship with Kiwi company Plexure by buying a $5m stake. McDonald's has bought into NZX-listed technology company Plexure, which has had a global deal to provide the United States fast-food giant with mobile marketing technology since 2015. Operating in a supposedly red-hot sector of the technology industry and having what is arguably the world's best-known fast-food chain as a customer has not proved a bonanza for shareholders in the Auckland business. Plexure – formerly known as Vmob – has lost 80 per cent of its value since it first listed on the NZX's junior NZAX market in 2012 after winning \"best Hi-Tech start-up\" at the Hi-Tech Awards a year earlier. But McDonald's announcement that it would buy a 10 per cent stake in the firm for $5.4 million saw its shares jump by more than a third to a high of 44c on Tuesday morning. READ MORE: * Vmob sees loss and sales jump Plexure provides an app that McDonald's uses in 48 countries, including the US, to provide discount vouchers and loyalty offers to McDonald's customers. As part of a new, expanded partnership between the companies, Plexure will be prohibited from providing its service to some of McDonald's competitors in the fast food industry. McDonald's chief executive Steve Easterbrook said mobile apps were playing a key role for the business \"allowing customers to interact with us on their terms in a personal, customised way\". Plexure chief executive Craig Herbison, who has headed the company for 18 months and achieved something of a turn-around, said 110 million people around the world were using the apps Plexure provided. Its other customers include 7-Eleven, Ikea, and Loyalty New Zealand. Herbison said it remained a \"price-sensitive market\", but new usage-based pricing agreed with McDonald's was expected to bring in an extra $1m a year.", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "vmob", "sentiment": "none"}], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "nzx-listed plexure mcdonald", "sentiment": "negative"}, {"name": "kiwi", "sentiment": "none"}, {"name": "plexure", "sentiment": "none"}, {"name": "nzx", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}, {"name": "us", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T02:12:13.010+03:00"}, {"thread": {"uuid": "d661e82a73d36845f16d2580af13c7c1892cad03", "url": "https://www.nzherald.co.nz/business/news/article.cfm?c_id=3&objectid=12218458", "site_full": "www.nzherald.co.nz", "site": "nzherald.co.nz", "site_section": "http://feeds.feedburner.com/co/CIqI", "site_categories": ["media"], "section_title": "New Zealand Herald - Top Stories", "title": "McDonald's gives Kiwi tech firm $5.4m vote of confidence", "title_full": "McDonald's gives Kiwi tech firm $5.4m vote of confidence", "published": "2019-04-02T01:04:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "NZ", "spam_score": 0.0, "main_image": "https://www.nzherald.co.nz/resizer/giyM9Vjn6wAUaB8pttDxjN2CyHY=/1200x0/smart/filters:quality(70)/arc-anglerfish-syd-prod-nzme.s3.amazonaws.com/public/NPZU6F6MGJB55MT5YVPLQFUN2Y.jpg", "performance_score": 10, "domain_rank": 4187, "social": {"facebook": {"likes": 216, "comments": 170, "shares": 1042}, "gplus": {"shares": 0}, "pinterest": {"shares": 104}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "d661e82a73d36845f16d2580af13c7c1892cad03", "url": "https://www.nzherald.co.nz/business/news/article.cfm?c_id=3&objectid=12218458", "ord_in_thread": 0, "author": "newsfeeds@nzherald.co.nz", "published": "2019-04-02T01:04:00.000+03:00", "title": "McDonald's gives Kiwi tech firm $5.4m vote of confidence", "text": "McDonald's gives Kiwi tech firm Plexure $5.4m vote of confidence 2 Apr, 2019 10:15am Take-away giant McDonald's has bought into Kiwi tech company Plexure. Photo/Getty Images. NZ Herald Share on Reddit reddit Fast-food multi-national McDonald's is spending $5.4 million on a 9.9 per cent stake in NZX-listed tech firm Plexure. McDonald's says this is its first-ever investment in a mobile app vendor and follows its recent announcement that it is buying Dynamic Yield, a decision-engine and personalisation company based in Israel and New York. McDonald's says its investment in Plexure will provide it with enhanced access to Plexure's technology in the quick-service restaurant space, including access to greater back-end and front-end features, customer functionality and customer targeting. \"Across all markets, we're using technology to elevate and transform the McDonald's customer experience,\" says group president and chief executive Steve Easterbrook. Advertisement Advertise with NZME. \"Our mobile apps play a key role in our digital acceleration, allowing customers to interact with us on their terms in a personal, customised way,\" Easterbrook says in a statement. \"This investment is a testament to our belief in Plexure's ability to deliver strong results for our business as well as the talent and technology they've cultivated.\" Plexure designs and builds software allowing other businesses, mainly retailers and fast food outlets, to target customers via their mobile phones. Plexure chief executive Craig Herbison says the funds from the placement of 13.8 million shares to McDonald's will be used to expand his company. The shares have been issued at 39.05 cents per share compared with Plexure's closing price yesterday at 31 cents, when its market capitalisation was $38.9 million. The shares lifted to 41 cents in early morning trading. Related articles: Plexure listed on NZX in 2012 as Vmob via a backdoor listing that included issuing shares at 2.5 cents each. It changed its name to Plexure in 2016. Plexure's success has caught the attention of a global giant. Photo/Supplied. Share on Reddit reddit \"This is a tremendous vote of confidence from our largest customer. This investment will further our efforts to reach more people with our technology, provide world-class service to our clients and execute our growth plans for our company,\" Herbison says. Herbison described the deal as one of \"limited exclusivity\", explaining that there is a list of brands that Plexure will no longer work with. \"Understandably, they will be their direct competitors, like Yum Foods, Restaurant brands and Burger King,\" Herbison tells the Herald . \"Outside of that, we still have full ability to sell our technology to other food brands, including those in the fast-casual space.\" He says Plexure has also had to \"stop deal flow with a few prospects\" keen to work with Plexure. While he wouldn't mention any names of these companies, he confirmed that they were in the quick-serve restaurant category. \"It's a compliment in a way in that they see our tech as so good that they don't want anyone else working with it,\" says Herbison when commenting on the halo effect of a global giant taking notice of Kiwi player. Herbison adds the company is also eyeing a number of other categories as it looks to expand the business in the coming years. \"We're in fuel and convenience with Seven-Eleven, we're in big box retail with Ikea, we're looking at global grocers and global hotel chains. We're really looking for businesses who want that global scale.\" Last month, Plexure said it expected revenue for the year ended March is likely to exceed $16.8 million, up more than 40 per cent on the previous year. However rising costs mean annual profit is likely to be about $1 million, little changed from the first half, excluding the impact of a maturing convertible note issue. Plexure boss Craig Herbison. Photo/Supplied.", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "steve easterbrook", "sentiment": "none"}, {"name": "plexure", "sentiment": "none"}], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "kiwi", "sentiment": "negative"}, {"name": "nzme", "sentiment": "none"}, {"name": "nz herald", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "reddit", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "plexure", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T02:22:06.023+03:00"}, {"thread": {"uuid": "c513db33cd890f7b5605d982ab3820ae2104a28a", "url": "https://www.redflagdeals.com/deal/fast-food/mcdonalds-get-any-size-fountain-drink-for-free-with-the-my-mcds-app-select-regions-only/", "site_full": "www.redflagdeals.com", "site": "redflagdeals.com", "site_section": "http://www.redflagdeals.com/rss/deals.php?city=toronto&content_type=editorial", "site_categories": ["couponing", "shopping"], "section_title": "RedFlagDeals.com - Latest Editorial  Deals in Toronto", "title": "McDonald's: Get Any Size Fountain Drink for FREE with the My McD's App (Select Regions Only)", "title_full": "McDonald's: Get Any Size Fountain Drink for FREE with the My McD's App (Select Regions Only)", "published": "2019-04-01T20:08:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "", "performance_score": 0, "domain_rank": 8232, "social": {"facebook": {"likes": 3, "comments": 1, "shares": 5}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "c513db33cd890f7b5605d982ab3820ae2104a28a", "url": "https://www.redflagdeals.com/deal/fast-food/mcdonalds-get-any-size-fountain-drink-for-free-with-the-my-mcds-app-select-regions-only/", "ord_in_thread": 0, "author": "", "published": "2019-04-01T20:08:00.000+03:00", "title": "McDonald's: Get Any Size Fountain Drink for FREE with the My McD's App (Select Regions Only)", "text": "Fast Food Get Any Size Fountain Drink for FREE! McDonalds McDonald's: Get Any Size Fountain Drink for FREE with the My McD's App (Select Regions Only) Get Any Size Fountain Drink for FREE! get this deal\nQuench your thirst by visiting McDonald's , because you can get any size fountain drink for free using the My McD's app!\nThe terms of this offer will vary depending on your region -- customers in Alberta, British Columbia, Manitoba, Northwest Territories and Yukon can get a free fountain drink without any purchase, but Ontario customers will need to make a purchase of at least $1.00 to get the freebie.\nTo get started, open the My McD's app ( Android , iOS ) and the offer will appear under the My Offers section -- simply tap the offer and display the QR code in-restaurant or apply it to a Mobile Order to get your free drink!\nEasy peasy, lemon squeezy. The in-app offer is redeemable up to seven times until April 7 at participating restaurants in Canada -- click here to find the McDonald's restaurant nearest you. posted:", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://play.google.com/store/apps/details?id=com.mcdonalds.superapp&hl=en", "https://www.mcdonalds.com/ca/en-ca/promotions/mymcdsapp.html", "http://www.mcdonalds.ca/ca/en/restaurant_locator.html", "http://www4.mcdonalds.ca/mymcds/", "http://go.redirectingat.com?id=2927x594702&xs=1&url=https%3A%2F%2Fitunes.apple.com%2Fca%2Fapp%2Fmy-mcds%2Fid375695000%3Fmt%3D8"], "entities": {"persons": [], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "mcdonalds mcdonald", "sentiment": "negative"}], "locations": [{"name": "northwest territories", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "yukon", "sentiment": "none"}, {"name": "manitoba", "sentiment": "none"}, {"name": "alberta", "sentiment": "none"}, {"name": "mcdonald's", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T02:49:14.042+03:00"}, {"thread": {"uuid": "cc7581667efa1657ea722b6fa014a49822b3eecf", "url": "https://www.rte.ie/news/politics/2019/0401/1040049-sinn-fein-banner/", "site_full": "www.rte.ie", "site": "rte.ie", "site_section": "http://www.rte.ie/rss/news.xml", "site_categories": ["media"], "section_title": "RTÉ News - News Headlines", "title": "McDonald apologises for offence caused by parade banner", "title_full": "McDonald apologises for offence caused by parade banner", "published": "2019-04-01T23:53:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "IE", "spam_score": 0.0, "main_image": "https://img.rasset.ie/0011c4bf-1600.jpg", "performance_score": 0, "domain_rank": 4464, "social": {"facebook": {"likes": 59, "comments": 33, "shares": 26}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "cc7581667efa1657ea722b6fa014a49822b3eecf", "url": "https://www.rte.ie/news/politics/2019/0401/1040049-sinn-fein-banner/", "ord_in_thread": 0, "author": "", "published": "2019-04-01T23:53:00.000+03:00", "title": "McDonald apologises for offence caused by parade banner", "text": "McDonald apologises for offence caused by 'England get out of Ireland' banner Updated / Monday, 1 Apr 2019 21:53 Mary Lou McDonald apologised for any offensive caused - but said she would not apologise for being \"a united Irelander\"\nThe leader of Sinn Féin has apologised for marching behind an \"England Get Out of Ireland\" banner on St Patrick's Day .\nMary Lou McDonald moved to reassure the public that its message was not directed at English people.\n\"For anybody who felt that it was directed at English people, I just want to reassure them that that's not the case,\" she said.\nThe Dublin Central TD was condemned for helping carry the sign last month in New York City's annual parade to mark the national holiday.\nHer actions were described as offensive and divisive by Tánaiste Simon Coveney.\nAn opinion poll published by the Sunday Business Post over the weekend showed support for Sinn Féin had dropped by five points to 13%. The figure was 18% in February.\nMs McDonald said: \"In respect of St Patrick's Day, I think it starts certainly a conversation around that banner which has been up and down Fifth Avenue for a generation.\n\"It's a very direct political statement, it's an anti-partition statement.\n\"I know it was taken by some to be directed at English people. It certainly was not and is not.\"\nShe described the slogan as a \"fairly blunt statement at any time\".\nSpeaking on RTÉ Radio 1 she said: \"I suppose all of us have to be conscious of not just what we say and what is meant, but also what is heard and what is understood.\"\nAsked whether she was inching towards an apology, she replied: \"I don't have to inch towards anything... for anybody who felt that it was directed at English people I just want to reassure them that that's not the case.\n\"Indeed I have blood relatives myself who are English ... and English people are very welcome in Ireland.\n\"Many of them live amongst us, they are our neighbours and our friends, so certainly I apologise to anybody who felt that the banner was intended in that way, and I'm happy to clarify that it's not. It certainly doesn't mean that.\"\nOn the political sentiment behind the banner, Ms McDonald said she would not apologise for being \"a united Irelander\" and for wanting unity and democracy across Ireland.\n\"Far from apologising for it, I wear that political position as a badge of honour,\" she said.\nThe Democratic Unionist Party said Ms McDonald's apology was motivated by poll ratings rather than remorse.\nEast Antrim MLA Gordon Lyons said: \"Mary Lou McDonald's apology is a cynical response to falling poll ratings rather than any acknowledgement of remorse.\n\"It is testament to Sinn Féin's place on the sidelines of politics that gaffes by their new president have been their most significant contribution to politics in recent months.\n\"It is clear however that a drop in support has pressed those who take the decisions within Sinn Féin to stop defending the banner and belatedly send Mary Lou McDonald out to issue this supposed apology.\"\nMr Lyons said if the party's leadership was truly focused on repairing the damage it would commit to working with all other parties to restore the Stormont Assembly. More on", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "mary lou mcdonal", "sentiment": "negative"}, {"name": "tánaiste simon coveney", "sentiment": "none"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "mary lou mcdonald", "sentiment": "none"}], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "dublin central td", "sentiment": "none"}, {"name": "sinn féin", "sentiment": "none"}, {"name": "sunday business post", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "fifth avenue", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T03:13:01.025+03:00"}, {"thread": {"uuid": "9eaff81063c2ecd5628281b0e8677331bd2058ea", "url": "https://sputniknews.com/viral/201904021073746154-australian-mcdonalds-unveils-pickles-burger/", "site_full": "sputniknews.com", "site": "sputniknews.com", "site_section": "", "site_categories": ["media", "law_government_and_politics", "politics"], "section_title": "", "title": "Pickles-Only Burger for April Fools’ Day Unveiled by Australian McDonalds - Sputnik International", "title_full": "Pickles-Only Burger for April Fools’ Day Unveiled by Australian McDonalds - Sputnik International", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "RU", "spam_score": 0.0, "main_image": "https://cdn5.img.sputniknews.com/images/107374/61/1073746116.jpg", "performance_score": 0, "domain_rank": 1616, "social": {"facebook": {"likes": 16, "comments": 11, "shares": 2}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "9eaff81063c2ecd5628281b0e8677331bd2058ea", "url": "https://sputniknews.com/viral/201904021073746154-australian-mcdonalds-unveils-pickles-burger/", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "Pickles-Only Burger for April Fools’ Day Unveiled by Australian McDonalds - Sputnik International", "text": "A post shared by McDonald's Australia (@mcdonaldsau) on Mar 31, 2019 at 1:03pm PDT\nThe video seemed extremely convincing as it was made in the same commercial-like style as other McDonald’s announcements. Many net users commented that it was a great idea, leaving comments like “I’m gonna order 1000”, “Omg it’s a burger designed for me,”“it’s perfect” and that “pickle problems” have been “solved”.\nREAD MORE: Camels Escape Circus in Germany to Hang Out at McDonalds\nInterest in the burger became so great that the company had to admit that it was an April Fools’ Day prank by adding “available until yesterday”, disappointing pickle-lovers who noted that “it shouldn’t be a joke” and that “even though this is a definitely an April Fools’ joke, I would order this and you know it.”\nMcDonald’s Australia said in a statement to news.com.au that they were glad Australian customers enjoyed the joke, but wouldn’t indicate if they would include the McPickle on the menu in the future. “We know there’s a lot of love out there for our famous pickles, and the McPickle Burger has certainly got people talking about them. We’re glad Australians have enjoyed our April Fools’ joke!” McDonald’s said.\nMeanwhile, McDonald’s rival, Burger King, also announced a so-called “impossible Whopper” — a plant-based version of the brand’s iconic hamburger. The burger is made with a popular Impossible Burger patty, which consists of soy protein, coconut oil and heme derived from plants. However, it was only available at 59 Burger King restaurants in and around the St. Louis area. It has not been reported if the chain plans on rolling out the plant-based patty to a larger market. ...", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "mcdonalds", "sentiment": "negative"}, {"name": "mcdonalds interest", "sentiment": "none"}, {"name": "mcpickle burger", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T04:40:00.007+03:00"}, {"thread": {"uuid": "8d6a36165a7c7a31361a4674fdb2fac6db7c11b9", "url": "https://news.iheart.com/featured/ej/content/2019-04-01-some-customers-upset-over-mcdonalds-plays-april-fools-day-prank/", "site_full": "news.iheart.com", "site": "iheart.com", "site_section": "", "site_categories": ["non_standard_content"], "section_title": "", "title": "Some Customers Upset Over McDonald's Plays April Fool's Day Prank | EJ | 102 The River", "title_full": "Some Customers Upset Over McDonald's Plays April Fool's Day Prank | EJ | 102 The River", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://i.iheart.com/v3/re/new_assets/5ca2be57c1cc208007452fde", "performance_score": 0, "domain_rank": 1524, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "8d6a36165a7c7a31361a4674fdb2fac6db7c11b9", "url": "https://news.iheart.com/featured/ej/content/2019-04-01-some-customers-upset-over-mcdonalds-plays-april-fools-day-prank/", "ord_in_thread": 0, "author": "", "published": "2019-04-01T03:00:00.000+03:00", "title": "Some Customers Upset Over McDonald's Plays April Fool's Day Prank | EJ | 102 The River", "text": "Some Customers Upset Over McDonald's Plays April Fool's Day Prank Apr 1, 2019\nMcDonald's managed to make customers upset after playing an April Fool's Day joke on their customers.\nMcDonald's claimed to be introducing the McPickle Burger, which consisted of cheese, ketchup, a sesame seed bun, and two mounds of pickles.\nThe fast-food chain shared a video of the burger on their Australian social media pages and pickle lovers went bananas over the new menu item.\nOthers who figured out it wasn't really a sandwich wanted McDonald's to make the sandwich a real thing. {\"position1\": {\"artist\": {\"bio\": \"\", \"id\": 30983282, \"name\": \"Dua Lipa\"}, \"catalog_type\": \"artist\", \"description\": \"\", \"id\": 30983282, \"name\": \"Dua Lipa\", \"related\": [{\"bio\": \"\", \"id\": 31823731, \"name\": \"Anne-Marie\"}, {\"bio\": \"\", \"id\": 30402879, \"name\": \"Bebe Rexha\"}, {\"bio\": \"\", \"id\": 30076811, \"name\": \"Halsey\"}, {\"bio\": \"\", \"id\": 33697, \"name\": \"Sia\"}, {\"bio\": \"\", \"id\": 883390, \"name\": \"Zara Larsson\"}, {\"bio\": \"\", \"id\": 32102720, \"name\": \"Ava Max\"}, {\"bio\": \"\", \"id\": 30832098, \"name\": \"Alessia Cara\"}], \"tagged\": false, \"type\": \"catalog\"}} ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "bebe rexha", "sentiment": "none"}, {"name": "zara larsson", "sentiment": "none"}, {"name": "alessia cara", "sentiment": "none"}, {"name": "anne-marie", "sentiment": "none"}], "organizations": [{"name": "mcdonald", "sentiment": "negative"}], "locations": []}, "rating": null, "crawled": "2019-04-02T05:45:22.054+03:00"}, {"thread": {"uuid": "e3a238f76b7ab0f0a7f6294c07bffc4c582830b5", "url": "https://uk.news.yahoo.com/kelly-macdonald-version-princess-margaret-230100108.html", "site_full": "uk.news.yahoo.com", "site": "yahoo.com", "site_section": "", "site_categories": ["media"], "section_title": "", "title": "Kelly Macdonald: My version of Princess Margaret more fun than in The Crown", "title_full": "Kelly Macdonald: My version of Princess Margaret more fun than in The Crown", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "IE", "spam_score": 0.892, "main_image": "https://s.yimg.com/uu/api/res/1.2/eJC_3_3ke7TAaP2BxFIQDg--~B/aD0yNTQyO3c9NDUyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/snappa_entertainment_819/1d52cda7ae183c1813a3bd89475b49c1", "performance_score": 0, "domain_rank": 5, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "e3a238f76b7ab0f0a7f6294c07bffc4c582830b5", "url": "https://uk.news.yahoo.com/kelly-macdonald-version-princess-margaret-230100108.html", "ord_in_thread": 0, "author": "Emma Bowden", "published": "2019-04-01T03:00:00.000+03:00", "title": "Kelly Macdonald: My version of Princess Margaret more fun than in The Crown", "text": "Kelly Macdonald: My version of Princess Margaret more fun than in The Crown By Emma Bowden, Press Association Reblog Kelly Macdonald has said her portrayal of Princess Margaret is more fun than in Netflix’s The Crown. The actress plays the royal in the third series of Sky Arts’ comedy Urban Myths, which tell fabled tales from the world of entertainment. The episode is set to explore Princess Margaret’s relationship with veteran rock star Sir Mick Jagger, played by Twilight actor Jamie Campbell Bower. Vanessa Kirby played the Queen’s sister in series one and two of The Crown, with Helena Bonham Carter taking over the role in the regal drama’s third season. Helena Bonham Carter as Princess Margaret in the upcoming series (Sophie Mutevelian/Netflix) More Macdonald told the Radio Times magazine: “I got prosthetics and everything! “Lots of smoking and swearing and being drunk. And burping. “Our version of her life is very fun. It’s not The Crown.” The Trainspotting actress next appears in new BBC legal thriller The Victim, alongside John Hannah and James Harkness. The four-part drama sees Macdonald play Anna Dean, whose nine-year-old son was murdered 15 years ago. Craig Myers, played by Harkness, is the victim of an attack after he is accused of killing the child, but says he is innocent. The show explores the mystery of whether he is the victim of mistaken identity, or the dangerous killer that Macdonald’s character believes he is. Macdonald said of her character: “I liked the fact that she’s not wholly likeable. You think your sympathies should lie with her, but then she does things where you’re not necessarily behind her actions. “She’s a woman on the verge of madness. It’s very psychological.” Radio Times is out on Tuesday. ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "kelly macdonald", "sentiment": "negative"}, {"name": "margaret", "sentiment": "negative"}, {"name": "emma bowden", "sentiment": "negative"}, {"name": "macdonald", "sentiment": "none"}, {"name": "jamie campbell bower", "sentiment": "none"}, {"name": "mick jagger", "sentiment": "none"}, {"name": "helena bonham carter", "sentiment": "none"}, {"name": "john hannah", "sentiment": "none"}, {"name": "james harkness", "sentiment": "none"}, {"name": "vanessa kirby", "sentiment": "none"}, {"name": "reblog kelly macdonald", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "radio times", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-02T05:57:28.000+03:00"}, {"thread": {"uuid": "70807ba9312dac35ad4ba45345a885d1730789d3", "url": "https://981thebreeze.iheart.com/featured/tony-sandoval-on-the-breeze/content/2019-04-01-mcdonalds-april-fools-day-joke-about-new-burger-backfires/", "site_full": "981thebreeze.iheart.com", "site": "iheart.com", "site_section": "", "site_categories": ["real_estate", "buying_selling_homes"], "section_title": "", "title": "McDonald's April Fools' Day Joke about new Burger Backfires. | Tony Sandoval on The Breeze | 98.1 The Breeze", "title_full": "McDonald's April Fools' Day Joke about new Burger Backfires. | Tony Sandoval on The Breeze | 98.1 The Breeze", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.048, "main_image": "https://i.ytimg.com/vi/vQ25R1UM9pg/hqdefault.jpg", "performance_score": 0, "domain_rank": 1524, "social": {"facebook": {"likes": 18, "comments": 10, "shares": 18}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "70807ba9312dac35ad4ba45345a885d1730789d3", "url": "https://981thebreeze.iheart.com/featured/tony-sandoval-on-the-breeze/content/2019-04-01-mcdonalds-april-fools-day-joke-about-new-burger-backfires/", "ord_in_thread": 0, "author": "", "published": "2019-04-01T03:00:00.000+03:00", "title": "McDonald's April Fools' Day Joke about new Burger Backfires. | Tony Sandoval on The Breeze | 98.1 The Breeze", "text": "McDonald's April Fools' Day Joke about new Burger Backfires. Apr 1, 2019\nMcDonald’s got itself in a pickle on Monday when it attempted an April Fools' Day joke that left some Australian customers angry.\nThis was their post:\n“Pickle lovers, it’s the news you’ve all been waiting for. We’re super stoked to announce the launch of our brand new McPickle Burger,” the Instagram post read. “It’s time to tuck into juicy, flavoursome pickles layered between melted cheese, ketchup sauce and toasted sesame seed buns. It’s sure to be a treat for all your senses. #dailynuggets #mcpickle #pickleoverload #maccas #imlovinit” Tony Sandoval on The Breeze Want to know more about Tony Sandoval on The Breeze? Get his official bio, social pages & articles on The Breeze! Read more Contact ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "tony sandoval", "sentiment": "neutral"}], "organizations": [{"name": "mcdonald", "sentiment": "neutral"}, {"name": "instagram", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-02T07:07:37.000+03:00"}, {"thread": {"uuid": "59e07a00de6674ffe9dc21767289dbdb89f902ea", "url": "https://ca.news.yahoo.com/report-devastating-canadian-climate-change-190037558.html", "site_full": "ca.news.yahoo.com", "site": "yahoo.com", "site_section": "https://ca.news.yahoo.com/?format=rss", "site_categories": ["non_standard_content", "adult"], "section_title": "Yahoo News Canada - Latest News & Headlines", "title": "Report on devastating Canadian climate change a far bigger issue than Jody Wilson-Raybould: Neil Macdonald", "title_full": "Report on devastating Canadian climate change a far bigger issue than Jody Wilson-Raybould: Neil Macdonald", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 30, "participants_count": 12, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://s.yimg.com/uu/api/res/1.2/lFx14IxNjkvGx.Lka794PA--~B/aD00MjI7dz02MjA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/cbc.ca/a966cf26ecd3a0e41807036f4b5c687a", "performance_score": 0, "domain_rank": 5, "social": {"facebook": {"likes": 123, "comments": 153, "shares": 95}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "59e07a00de6674ffe9dc21767289dbdb89f902ea", "url": "https://ca.news.yahoo.com/report-devastating-canadian-climate-change-190037558.html", "ord_in_thread": 0, "author": "CBC", "published": "2019-04-02T03:00:00.000+03:00", "title": "Report on devastating Canadian climate change a far bigger issue than Jody Wilson-Raybould: Neil Macdonald", "text": "Government scientists have produced a new report on climate change in Canada, and it's beyond grim. The details trigger thoughts of hoarding and maybe selling the house and moving to higher ground. To a millennial, the findings should inspire naked fear. Among other things, the report , which is scheduled to be released Tuesday, says:\nCanada's climate has been warming at roughly twice the rate of the rest of the world. In Northern Canada, it's even higher.\nAnd, says the report, there is simply no doubt about the cause. Climate change-skeptic conservatives will, of course, disagree, but here is what the scientists say:\n\"Canada's climate has warmed and will warm further in the future, driven by human influence. Both past and future warming in Canada is, on average, about double the magnitude of global warming.\"\nOur climate is not warming consistently. It is most pronounced in the Prairies and British Columbia, and especially severe in northern B.C. The effects are strongest in winter.\nIt is effectively irreversible. The antidote prescribed in the report is politically impossible, at least right now: \"Scenarios with limited warming will only occur if Canada and the rest of the world reduce carbon emissions to near zero early in the second half of the century.\"\nThe scientists predict an eventual increase in \"annual average country-wide temperature\" of about two degrees Celsius, a rate that will remain steady after mid-century. They say the increase could be as severe as six degrees.\nJason Franson/Canadian Press More The oceans around Canada have become more acidic and less oxygenated. Future warming will be heaviest in ice-free waters of the Canadian arctic. Most Canadians can expect coastal flooding to increase during their lifetimes.\nWarming of the oceans, in particular, is a truly vicious circle. According to the report:\n\"Ocean warming and loss of oxygen will intensify with further emissions of all greenhouse gases, whereas ocean acidification will increase in response to additional carbon dioxide emissions. These changes threaten the health of marine ecosystems.\"\nIn other words, worse begets even worse, begets disaster.\nCanada is experiencing hotter extreme heat and less cold extreme cold. Permafrost is warming. There is less ice and snow.\nRainfall is increasing, although less so in the summer months. As warming continues, Canada (of all places) will likely face freshwater shortages.\nThose are just the highlights. The main takeaway: if climate change worldwide is much more frightening and immediate than we all thought, as the UN's Intergovernmental Panel on Climate Change (IPCC) reported six months ago, it's at least twice as bad in Canada.\nTwice. As. Bad.\nTo the Trudeau government, this is core-mission stuff. Last week, scientists from the environment department were brought in to the Prime Minister's Office for briefings. The report will be public and online Tuesday, and Justin Trudeau and members of his cabinet will be pushing the issue as something bordering on a national emergency, which is not an unreasonable way to characterize it.\nNormally, you'd think findings like these would penetrate deep into voters' minds. Climate change, with reports like this one and that of the IPCC last October, is becoming an issue of economic self-interest.\nSNC-Lavalin scandal\nBut these are not normal times. The Opposition is determined to keep public attention riveted on the SNC-Lavalin scandal , and former attorney general Jody Wilson-Raybould's remarkably effective effort to take down the prime minister.\nThat's not to say the new report won't generate headlines, but they will not be as politically explosive as, say, Wilson-Raybould's secretly recorded conversation with Privy Council Clerk Michael Wernick, which she submitted to the Commons justice committee last week. Over the weekend, at a ceremony in her honour in British Columbia, Wilson-Raybould signalled her determination to keep the story alive, and to continue speaking \"her truth.\" Tory leader Andrew Scheer is equally determined to assist her.\nProbably not coincidentally, the report is also landing at exactly the same time as a new carbon tax (the government wants to call it \"a price on pollution\") lands in Ontario, Saskatchewan, Manitoba and New Brunswick, increasing the price of fuel by about four cents a litre at the pump.\nStory continues Those four provinces had refused to levy their own carbon pricing plans, as other provinces have done, so the federal government stepped in with one of its own.\nNick Murray/CBC More Carbon tax was going to be a, if not the, big issue in the election campaign this fall. The new climate change report should be a considerable weapon to counter the attack on the carbon tax planned by Scheer and conservative provincial premiers.\nBut SNC-Lavalin has, for the last several weeks, shown itself capable of burning up all the political oxygen in Ottawa.\nAlmost certainly, Scheer and his allies will shrug at the findings of the report, and get right back to hammering on the unspeakable treatment of Wilson-Raybould and corruption, corruption, corruption. (No law was broken, no money changed hands, and Wilson-Raybould had the last say and her decision was not overruled, but still, corruption, corruption, end of democracy, etc.)\nAnd out on social media, the millions of Canadians who loathe Trudeau and everything he stands for will ridicule any reporter or news organization that tries to focus on our changing climate. To many conservatives, climate change is just a distraction, if not a hoax – something to be discussed later. Much later.\nIn fact, a lot of Canadians will regard this entire climate report as a shoddy diversion, and reporters who report it as \"tools of the PMO.\"\nOne other thing: people in government tell me the expulsion of Wilson-Raybould and former Treasury Board president Jane Philpott from the Liberal caucus is being accelerated. The plan was to do it on Wednesday, when the national Liberal caucus meets, but that's the day when 338 prospective female parliamentarians will be visiting Parliament Hill as part of the \"Daughters of the Vote\" push to encourage more women to enter politics – not an auspicious moment to expel two women, one of whom is now Canada's best known Indigenous figure.\nSo there are now plans for a series of emergency regional caucuses tonight and on Tuesday. One caucus organizer says the Quebec Liberal caucus unanimously supports expulsion, as well as 90 per cent of the Ontario caucus, 80 per cent of the Atlantic caucus, and 85-90 per cent of the Prairie caucus.\nB.C. Liberals are less certain about the issue, given the politics in that province, but the organizer says the recommendations from regional caucuses will be overwhelming. And Trudeau, who has publicly said he welcomes Wilson-Raybould's and Philpott's desire to run as Liberals in the next election, has indicated he will nonetheless announce his \"respect for the will of members\" and order the two MPs booted.\nThen he wants to start talking about the climate change report. Just at a guess, though, Jody Wilson-Raybould will relegate climate change to the inside pages, just as she's done with everything else. Which is lunacy, but that's where we are.\nThis column is part of CBC's Opinion section. For more information about this section, please read our FAQ .", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://s.yimg.com/ny/api/res/1.2/OMr5Nfh4Ig.Bl4eXPn7FvQ--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/https://media.zenfs.com/en/cbc.ca/fbc44dfab8543a9acec1ec448b1855d0", "https://s.yimg.com/ny/api/res/1.2/OMr5Nfh4Ig.Bl4eXPn7FvQ--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/https://media.zenfs.com/en/cbc.ca/fbc44dfab8543a9acec1ec448b1855d0);", "https://s.yimg.com/ny/api/res/1.2/zLS0OD0F6leZhj6QhkVgcg--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/https://media.zenfs.com/en/cbc.ca/a966cf26ecd3a0e41807036f4b5c687a);", "https://s.yimg.com/ny/api/res/1.2/zLS0OD0F6leZhj6QhkVgcg--~A/YXBwaWQ9aGlnaGxhbmRlcjtzbT0xO3c9ODAw/https://media.zenfs.com/en/cbc.ca/a966cf26ecd3a0e41807036f4b5c687a"], "entities": {"persons": [{"name": "jody wilson-raybould", "sentiment": "negative"}, {"name": "neil macdonald", "sentiment": "negative"}], "organizations": [], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "northern canada", "sentiment": "none"}, {"name": "prairies", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T08:21:27.000+03:00"}, {"thread": {"uuid": "a8f75c4638c776a5141e7823fed5af85a3669939", "url": "https://atlantic.ctvnews.ca/sydney-dj-apologizes-asks-frankie-macdonald-for-forgiveness-1.4361549", "site_full": "atlantic.ctvnews.ca", "site": "ctvnews.ca", "site_section": "http://atlantic.ctvnews.ca/rss/Atlantic#", "site_categories": ["media"], "section_title": "CTV News Atlantic - Public RSS", "title": "Sydney DJ apologizes, asks Frankie MacDonald for forgiveness", "title_full": "Sydney DJ apologizes, asks Frankie MacDonald for forgiveness | CTV News Atlantic", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "CA", "spam_score": 0.0, "main_image": "https://www.ctvnews.ca/polopoly_fs/1.4361555.1554166801!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "performance_score": 2, "domain_rank": 4971, "social": {"facebook": {"likes": 562, "comments": 439, "shares": 206}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "a8f75c4638c776a5141e7823fed5af85a3669939", "url": "https://atlantic.ctvnews.ca/sydney-dj-apologizes-asks-frankie-macdonald-for-forgiveness-1.4361549", "ord_in_thread": 0, "author": "CTV Atlantic", "published": "2019-04-01T03:00:00.000+03:00", "title": "Sydney DJ apologizes, asks Frankie MacDonald for forgiveness", "text": "Hundreds of people rallied to defence of well-known Cape Breton weather personality Frankie MacDonald after some harsh comments on social media.\nOn Monday, the Sydney area DJ who made those comment apologized.\nThe man many know as DJ Gary Boudreau says he's seen better days.\n“I started crying,” he said. “I couldn't believe that that was actually me that made comments like that. That's honestly not how I feel.”\nHe's referring to posts he made on Facebook about MacDonald, among them: “That's the face of our island. It needs to stop,” and “Legit, someone murder me if I ever … represent Cape Breton like this.”\nThe typically easy-going MacDonald Frankie did not respond in kind.\n“He has nothing better to do,” MacDonald said.\nHe says he was leaving the hockey game Sunday night when he logged on and saw Boudreau's comments.\n“I ignored them,” he said. “I ignore all negative comments.”\nSocial media had plenty of those today as hundreds came to Frankie's defence.\nAnother Sydney area DJ, who used to employ Boudreau, says he's been contacted all day by people thinking he -- or his business -- had something to do with the comments.\n“You read it, and you're like ‘no, he's not. He's not really saying this,’” said Blaise Hollohan. “I had to read it four or five times to really get a feeling for it, to believe that he actually came across Facebook and said it.”\nTurns out, MacDonald and Boudreau know each other. Both remember meeting at some of the DJ's shows.\n“I have an alcohol problem,” Boudreau said. “And I'm going to be doing what I can this week, as soon as possible, to get the help I need for that.”\nBut Boudreau says he's not making any excuses. All he can do for now is ask forgiveness.\n“Frankie's probably going to see this,” Boudreau said. “So, Frankie, I am honestly and truly sorry man. I didn't mean any of that. You’re a great guy and I hope you can find it in your heart to forgive me.”\nMacDonald accepted Boudreau’s apology and said there’s no hard feelings.\n“He's a great guy,” he said. “I met him before. He got his picture taken with me in 2013.”\nPeople who know MacDonald are not surprised to hear that.\nIn the wake of all this, a night of support has been organized for MacDonald at a downtown Sydney bar where he's been known to hang out.\nBoudreau says while he doesn't think it would be wise to show up, he thinks it's a great idea.\n Ryan MacDonald.\nPhotos \"Frankie, I am honestly and truly sorry man, I didn't mean any of that,\" said Gary Boudreau. \"You’re a great guy and I hope you can find it in your heart to forgive me.”", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "frankie macdonal", "sentiment": "negative"}, {"name": "frankie macdonald", "sentiment": "negative"}, {"name": "gary boudreau", "sentiment": "none"}, {"name": "macdonald frankie", "sentiment": "none"}, {"name": "frankie", "sentiment": "none"}, {"name": "macdonald", "sentiment": "none"}, {"name": "boudreau", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}], "locations": [{"name": "cape breton", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T08:44:22.011+03:00"}, {"thread": {"uuid": "dcfa17610a4053020e408fd928423960e223d850", "url": "https://news.mcdonalds.com/stories/our-food-details/global-menu-mhq-april-2019", "site_full": "news.mcdonalds.com", "site": "mcdonalds.com", "site_section": "https://news.mcdonalds.com/rss/news-releases.xml", "site_categories": [], "section_title": "McDonald's Corporation News Releases", "title": "Global Favorites are Back at McDonald's Headquarters", "title_full": "Global Favorites are Back at McDonald's Headquarters", "published": "2019-04-01T18:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "", "performance_score": 0, "domain_rank": 9040, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 3}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "dcfa17610a4053020e408fd928423960e223d850", "url": "https://news.mcdonalds.com/stories/our-food-details/global-menu-mhq-april-2019", "ord_in_thread": 0, "author": "McDonald's Corporation News Releases", "published": "2019-04-01T18:00:00.000+03:00", "title": "Global Favorites are Back at McDonald's Headquarters", "text": "Global Favorites are Back at McDonald's Headquarters April 1, 2019\nThe Sixth Menu Rotation Includes Customers’ Favorite Menu Items from the Past Year Including McSpicy Chicken Sandwich from Hong Kong, Mighty Angus Burger from Canada and Baci McFlurry from Italy\nApril marks the one-year anniversary of McDonald’s global headquarters restaurant in Chicago’s West Loop. The restaurant’s international menu, which rotates throughout the year, continues to offer customers their favorite items from around the world. To celebrate this special milestone, we’re bringing back the most popular items from menu offerings throughout the past year.\nCustomers can enjoy their favorite global menu items from Hong Kong, Canada, France, Spain and Italy.\nThe anniversary global menu features: Chicken McMuffin with Egg from Hong Kong, China, Singapore and other Asian markets, this breakfast sandwich starts with a toasted English muffin, topped with a McChicken patty, a fresh cracked egg, American cheese and mayonnaise. The Mighty Angus Burger from Canada, a seasoned juicy third-pound Angus patty topped with a signature smoky sauce, hickory smoked bacon pieces, crisp leaf lettuce, tomato, American cheese and grilled onions, served on a glazed bun, topped with sesame and poppy seeds. McSpicy Chicken Sandwich from Hong Kong and throughout Asia, a spicy seasoned chicken thigh, breaded in a crunchy coating, served with mayonnaise and shredded iceberg lettuce on McDonald’s classic sesame seed bun. The Manhattan Salad from France, a mix of lettuces including romaine, spring mix and baby kale, topped with grape tomatoes, dried cranberries, apple slices and choice of grilled or crispy chicken and a breadstick; offered with blue cheese dressing or your choice of dressing “I’m Greeking Out” Salad from Canada, a mix of premium lettuces, topped with sliced cucumbers, red pepper strips, crumbled feta, seasoned couscous, garlic and herb pita chips, and choice of sliced grilled or crispy chicken; served with Greek dressing or your choice of dressing. Bacon and Cheesy Deluxe Potatoes from Spain, seasoned deluxe potato wedges topped with creamy, melted cheese sauce and sprinkled with crispy bacon bits. Baci® McFlurry from Italy, McDonald’s vanilla soft serve swirled with a Baci® candy sauce of creamy chocolate and hazelnut bits.\nIn addition to the rotating global menu, the restaurant also serves up classic menu items including the Big Mac, the new fresh beef Quarter Pounder with Cheese, Chicken McNuggets and McDonald’s World Famous Fries. The restaurant also offers delicious Latin American-style desserts including crunchy sugar cones topped with creamy soft serve available in vanilla, chocolate or twist varieties, as well as other sweet treats from around the world.\nThe more than 6,000-square-foot restaurant offers modern designs, self-order kiosks, table service, mobile order and payment, and McDelivery with Uber Eats. The restaurant also features outdoor seating, and an ever-changing wall map with Golden Arches that illuminate when an item from a specific country is featured on the menu, and an Australian McCafé area serving up expertly brewed coffee crafted by McDonald’s trained baristas.\nLocated at 1035 W. Randolph St. the restaurant is open from 6 a.m. to 10 p.m., seven days a week. Contact The Sixth Menu Rotation Includes Customers’ Favorite Menu Items from the Past Year Including McSpicy Chicken Sandwich from Hong Kong, Mighty Angus Burger from Canada and Baci McFlurry from Italy April marks the one-year anniversary of McDonald’s global headquarters restaurant in Chicago’s West Browse Stories by Category", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://goo.gl/maps/GrS5TNge73U2"], "entities": {"persons": [{"name": "angus burger", "sentiment": "none"}, {"name": "angus", "sentiment": "none"}], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "baci mcflurry", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "west loop", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T09:02:57.004+03:00"}, {"thread": {"uuid": "3f0c5ed757f6b16bd6ab8dddbb47f77b4994e471", "url": "https://news.mcdonalds.com/news-releases/news-release-details/mcdonalds-announces-investment-new-zealand-based-plexure", "site_full": "news.mcdonalds.com", "site": "mcdonalds.com", "site_section": "https://news.mcdonalds.com/rss/news-releases.xml", "site_categories": [], "section_title": "McDonald's Corporation News Releases", "title": "McDonald’s Announces Investment in New Zealand-Based Plexure", "title_full": "McDonald’s Announces Investment in New Zealand-Based Plexure", "published": "2019-04-01T22:30:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "", "performance_score": 0, "domain_rank": 9040, "social": {"facebook": {"likes": 4, "comments": 1, "shares": 3}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "3f0c5ed757f6b16bd6ab8dddbb47f77b4994e471", "url": "https://news.mcdonalds.com/news-releases/news-release-details/mcdonalds-announces-investment-new-zealand-based-plexure", "ord_in_thread": 0, "author": "McDonald's Corporation News Releases", "published": "2019-04-01T22:30:00.000+03:00", "title": "McDonald’s Announces Investment in New Zealand-Based Plexure", "text": "McDonald’s Announces Investment in New Zealand-Based Plexure April 1, 2019\nAnnouncement furthers McDonald’s digital transformation and coincides with expansion of McDonald’s use of Plexure's technology under current agreement between the companies\nMcDonald’s Corporation (MCD) and Plexure (PLX NZ), a leader in mobile engagement software, announced today McDonald’s investment in the New Zealand-based company. Plexure has played an important role in McDonald’s focus on digital transformation, powering a version of McDonald’s Global Mobile App in 48 countries outside the U.S. and other markets, including Italy and Japan. The transaction marks McDonald’s first-ever investment in a mobile app vendor and follows its recent announcement to acquire Dynamic Yield, a decision-engine and personalization company based in Tel Aviv, Israel, and New York.\nFunds from the investment will further Plexure’s growth plans while giving McDonald’s enhanced access to Plexure’s technology in the quick service restaurant (QSR) space, including access to greater back-end and front-end features, customer functionality and customer targeting, among others.\nThe investment coincides with an amendment to the existing software service agreement between the two companies, which will extend McDonald’s usage of Plexure’s technology and set new specifications for service levels and pricing. As part of this agreement, Plexure will not provide similar services to a defined list of competitors in the QSR space, based on certain terms and conditions.\n“Across all of our markets, we’re using technology to elevate and transform the McDonald’s customer experience,” said Steve Easterbrook, President and Chief Executive Officer of McDonald’s. “Our mobile apps play a key role in our digital acceleration, allowing customers to interact with us on their terms in a personal, customized way. This investment is a testament to our belief in Plexure’s ability to deliver strong results for our business as well as the talent and technology they’ve cultivated.”\nAdded Craig Herbison, Chief Executive Officer of Plexure, “This is a tremendous vote of confidence from our largest customer. This investment will further our efforts to reach more people with our technology, provide world-class service to our clients and execute our growth plans for our company.”\nThe investment is being facilitated through the issuance of new equity in Plexure. Under the terms of the subscription agreement, McDonald’s, through an indirect wholly-owned subsidiary, will purchase 13,795,311 shares of Plexure, facilitated through a cash transaction at an issue price of NZ$0.3905, representing a 15% premium over the volume-weighted average price of Plexure shares during March 2019. The cash investment from McDonald’s will result in a 9.9% minority stake, of which funds will be used for Plexure’s growth and expansion purposes.\nAbout McDonald’s\nMcDonald’s is the world’s leading global foodservice retailer with nearly 38,000 locations in over 100 countries around the world. Over 92 percent of McDonald’s restaurants worldwide are owned and operated by independent local business men and women.\nAbout Plexure\nPlexure is a mobile engagement software company. Global brands use the Company’s products to engage consumers on mobile devices and drive them to store with personalised offers, mobile order and pay and loyalty. Plexure’s software integrates with operational systems to remove friction and create a seamless purchase experience for consumers.\nPlexure makes the sales process for physical retailers seamless, engaging and profitable by identifying where customers are, what they want and then facilitating their purchases.\nThe Company’s technology platform and product offering covers five key capabilities: Mobile order and pay", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "plexure", "sentiment": "none"}], "organizations": [{"name": "mcdonald’s announces investment", "sentiment": "neutral"}, {"name": "mcdonald", "sentiment": "none"}, {"name": "mcdonald’s corporation", "sentiment": "none"}, {"name": "plexure", "sentiment": "none"}], "locations": [{"name": "new zealand-based plexure mcdonald’s announces investment", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "tel aviv", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T09:02:57.006+03:00"}, {"thread": {"uuid": "eb7c51d675dbe3e245627f8d112aeca85664415f", "url": "https://news.yahoo.com/april-fool-day-2019-best-100600124.html", "site_full": "news.yahoo.com", "site": "yahoo.com", "site_section": "", "site_categories": ["media"], "section_title": "", "title": "April Fool’s Day 2019: Best jokes so far, from the McDonald’s ‘McPickle’ to spreadable Yorkshire Tea", "title_full": "April Fool’s Day 2019: Best jokes so far, from the McDonald’s ‘McPickle’ to spreadable Yorkshire Tea", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://s.yimg.com/uu/api/res/1.2/yCXUyKuP16SOUTlf_GTWSQ--~B/aD00ODk7dz02NTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-GB/homerun/the_independent_577/9f60140b3e432db044b9e32e59a16586", "performance_score": 0, "domain_rank": 5, "social": {"facebook": {"likes": 36, "comments": 15, "shares": 22}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "eb7c51d675dbe3e245627f8d112aeca85664415f", "url": "https://news.yahoo.com/april-fool-day-2019-best-100600124.html", "ord_in_thread": 0, "author": "Sabrina Barr", "published": "2019-04-01T03:00:00.000+03:00", "title": "April Fool’s Day 2019: Best jokes so far, from the McDonald’s ‘McPickle’ to spreadable Yorkshire Tea", "text": "Reblog 1 / 3 April Fool’s Day 2019: Best jokes so far, from the McDonald’s ‘McPickle’ to spreadable Yorkshire Tea April Fool's Day is a time to have your wits about you, as people around the world revel in pranking their friends, family and colleagues. The origins of the annual celebration can be traced back hundreds of years , yet many are still caught out on the day by believable hoaxes. In recent years, increasing numbers of brands have joined in the battle to fool as many people as possible. This year, companies including McDonald's , the British Transport Police and the BBC have joined in the fun by catching out gullible consumers with fabricated marketing campaigns. Here are some of the best April Fool's pranks so far this year: The McDonald's 'McPickle' burger For April Fool's Day, McDonald's Australia announced the launch of its new 'McPickle' burger on Instagram, made from \"juicy, flavoursome pickles layered between melted cheese, ketchup sauce and toasted sesame seed buns\". While the new addition to the fast food chain's menu may have seemed like an obvious April Fool's joke to some, others were still hopeful that it may turn out to be true. \"Omfg if this is [an] April Fool's joke imma be mad,\" one person commented on Instagram . \"I'm gonna order 1,000,\" a pickle aficionado remarked. However, the news was too good to be true, as McDonald's Australia later commented underneath the Instagram post, saying that the pickle burger was \"available until yesterday\". BBC iPlayer introduces 'Skip The Sex' option For their April Fool's Day gag, BBC iPlayer announced the addition of a new feature on the on-demand platform: the 'Skip The Sex' button. The BBC explained that the feature would be ideal for anyone who would rather avoid \"awkward sex scenes\" while watching television with the family or on public transport. \"Fornication with the family? Skip. Titillation on the train? Skip. Intercourse with the in-laws? Skip,\" the advert states. While the feature is evidently not going to actually be made available, some television watchers have said that they think it could actually be a good idea in future. \"I know this is an April Fool's but it would be a good feature,\" one person tweeted . \"Now if this were real I'd be able to watch Game of Thrones with my husband and son!\" another added . A ban on smelly food on trains Fed up of having to endure stinky sandwiches and smelly snacks on trains? As part of new anti-social behaviour legislation, those caught eating offensive food items while in transit could face a penalty fare of up to £2,000. Check before you travel 👉 https://t.co/kePXd0M6Yz pic.twitter.com/Or9LRThRsw — British Transport Police (@BTP) April 1, 2019 There's nothing worse than sitting down on a train for your daily commute, only for the passenger sitting next to you to start tucking into smelly food. The British Transport Police agrees, which is why for April Fool's it's announced those that do so could face a £2,000 fine. The police force stated that those \"caught eating offensive food items\" on public transport may face a penalty fare, as part of \"new anti-social behaviour legislation\". While the announcement was made in jest, several Twitter users said they'd almost been fooled. \"You know it's concerning when I'm actually having to wonder whether this is a joke or not,\" one person remarked . Cricketers to have Instagram handles on kits As part of our efforts to make the game more appealing to younger generations, the ICC will be applying both numbers and Instagram handles to kits from the beginning of the World Test Championship. pic.twitter.com/XnvantQfc9 — ICC (@ICC) April 1, 2019 While cricket is a popular game among sports fans of all ages, some may think of it as slightly more appealing to older generations. That's why the International Cricket Council (ICC) joked that players' kits will feature their Instagram handles on their kits from the beginning of the World Test Championship. \"In further changes ahead of the World Test Championship, the tradition of the coin toss will be replaced by a @Twitter poll, allowing fans at home to decide who bats and bowls!\" the organisation added. The ICC also said that when temperatures increase over summer, cricketers will be allowed to depart from cricket sartorial tradition by wearing shorts. \"I know it's a prank, but the idea of including social media handles is pretty good,\" one cricket fan remarked on Twitter. Spreadable Yorkshire Tea New Yorkshire Tea Spreadable! It's like normal tea, only thicker. pic.twitter.com/n2SahkFa4O — Yorkshire Tea (@YorkshireTea) April 1, 2019 The tea blend company made the announcement on Twitter, sharing a picture of the jar of the innovative spread with the tagline: \"Let's have a proper slice.\" Considering the recent launch of Marmite Peanut Butter , many could be forgiven for believing that Yorkshire Tea had created a spreadable tea but sadly, it was only an April Fool's. Nonetheless, some consumers expressed interest in the concept. \"I know the date but I would still buy this, lads,\" one person tweeted . \"I know this is a joke but hell I'd buy this perfect combo with a nice mug of Yorkshire tea strong,\" another commented . Sainsbury’s launches limited edition pink avocados Sainsbury's announces launch of limited edition pink avocados for April Fool's Day (Sainsbury's) More For this year’s April Fool’s, Sainsbury’s announced the launch of the pink avocado , describing it as the “first-of-its-kind”. Named the “Rosa-vo”, the supermarket claims the rose-hued fruit could prove popular among foodie millennials. “Whilst we know Sainsbury’s customers are loyal devotees to the iconic brunch dish, we felt it was about time the humble avo-toast was given a bit of a refresh and social-specific makeover,” a Sainsbury’s spokesperson said. While the concept of the pink avocado has been fabricated, it does look like it could make an appealing addition to any brunch menu. To stay up-to-date with all the revelry taking place in celebration of April Fool's Day, follow The Independent 's live blog here . ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "yorkshire tea reblog", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}, {"name": "british transport police", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T09:54:53.035+03:00"}, {"thread": {"uuid": "3e4fdd78c5cdbba65926643386d75b3591f1fedd", "url": "http://www.pretty52.com/tasty/food-and-drink-theres-now-a-way-you-can-get-hash-brown-burgers-from-mcdonalds-20190401", "site_full": "www.pretty52.com", "site": "pretty52.com", "site_section": "http://www.pretty52.com/index.rss", "site_categories": ["media"], "section_title": "Pretty 52", "title": "There’s Now A Way You Can Get Hash Brown Burgers From McDonald’s", "title_full": "There’s Now A Way You Can Get Hash Brown Burgers From McDonald’s", "published": "2019-04-01T16:19:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "http://beta.ems.ladbiblegroup.com/s3/content/808x455/a287c2145ca206a78d732e03a6542e97.png", "performance_score": 0, "domain_rank": 1385, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "3e4fdd78c5cdbba65926643386d75b3591f1fedd", "url": "http://www.pretty52.com/tasty/food-and-drink-theres-now-a-way-you-can-get-hash-brown-burgers-from-mcdonalds-20190401", "ord_in_thread": 0, "author": "", "published": "2019-04-01T16:19:00.000+03:00", "title": "There’s Now A Way You Can Get Hash Brown Burgers From McDonald’s", "text": "18 hours ago 1.5K Shares There’s Now A Way You Can Get Hash Brown Burgers From McDonald’s Mon Apr 01 2019 14:19:06 GMT+0100 (BST) Mon Apr 01 2019 14:19:41 GMT+0100 (BST) Deborah Cicurel Deborah Cicurel in Tasty Powered by\nLove hash browns? Love burgers ? Wish it was as easy as walking into McDonald's to get the two delicious treats in one? Well, now you can make your hash brown burger dreams come true - but you'll have to be quick about it.\nA genius Reddit thread explains how to make hash brown burgers a reality, and it's all about your timing. Credit: Reddit\nHungry brunchers who want one of the yummy concoctions will have to turn up at McDonald's at exactly 10:30am, just when the breakfast menu ends and the day menu starts to be served, to be able to order both a hash brown and a burger and merge the two together.\nThe Redditor shared a photo of his delicious-looking meal, writing: \"Getting to McDonald's for bang on 10:30 for a double cheeseburger with hash brown\" with a thumbs up emoji. Drunk Man Pulls Trousers Down, Jumps On McDonald's Counter And 'Helicopters' Penis\nOther Reddit users responded with a mix of emotions, from pure jealousy to disgust.\nOne Redditor wrote: \"I would absolutely eat this\" and \"That looks so wrong, but I want one so badly. What's wrong with me?\" while another counselled: \"You need to time it so your at the drive in box for 10:29 [sic].\"\nImagine missing out on such a heavenly creation because you were a mere minute late. McDonald's also brought back the Galaxy McFlurry for January only. (Credit: McDonald's)\nHowever, others were horrified, writing: \"I'm calling the police on you for putting a hash brown in a burger\" and \"I blame your parents for making you like this\".\nWe can never get enough of McDonald's news, and there's been plenty of it lately.\nFirstly, the fantastic news that the popular Galaxy McFlurry was back for January filled us with delight, and of course, we can't forget the launch of camembert doughnuts , which are the perfect snack for any cheese lover.\nAnd of course if you're a regular buyer of Big Macs, you'll want to know this news: McDonald's Monopoly is here and gives you the chance to buy loads of prizes.\nAs if we needed any more excuses to pop to Maccy D's for a burger... Featured Image Credit: McDonald's", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "deborah cicurel deborah cicurel", "sentiment": "none"}], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "bst", "sentiment": "none"}], "locations": [{"name": "reddit", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T11:37:11.000+03:00"}, {"thread": {"uuid": "d52432571912de0f03910ad47c2855597a125fa1", "url": "https://alt987fm.iheart.com/content/2019-04-01-how-mcdonalds-got-tim-burton-fired-from-batman/", "site_full": "alt987fm.iheart.com", "site": "iheart.com", "site_section": "", "site_categories": ["non_standard_content"], "section_title": "", "title": "How McDonald's Got Tim Burton Fired From Batman | ALT 98.7", "title_full": "How McDonald's Got Tim Burton Fired From Batman | ALT 98.7", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.001, "main_image": "https://i.ytimg.com/vi/IbpmrzlwurE/hqdefault.jpg", "performance_score": 0, "domain_rank": 1524, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "d52432571912de0f03910ad47c2855597a125fa1", "url": "https://alt987fm.iheart.com/content/2019-04-01-how-mcdonalds-got-tim-burton-fired-from-batman/", "ord_in_thread": 0, "author": "", "published": "2019-04-01T03:00:00.000+03:00", "title": "How McDonald's Got Tim Burton Fired From Batman | ALT 98.7", "text": "How McDonald's Got Tim Burton Fired From Batman Apr 1, 2019 ALT 98.7 KYSR FM is Los Angeles' new alternative music radio station. © 2019 iHeartMedia, Inc. ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "tim burton", "sentiment": "neutral"}], "organizations": [{"name": "mcdonald", "sentiment": "neutral"}, {"name": "inc", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T13:31:14.023+03:00"}, {"thread": {"uuid": "7ac112619203f6d4447d34cd00690e6028276718", "url": "https://atlantic.ctvnews.ca/sydney-dj-apologizes-for-harsh-comments-about-frankie-macdonald-seeks-forgiveness-1.4361549", "site_full": "atlantic.ctvnews.ca", "site": "ctvnews.ca", "site_section": "http://atlantic.ctvnews.ca/rss/Atlantic", "site_categories": ["media"], "section_title": "CTV News Atlantic - Public RSS", "title": "Sydney DJ apologizes for harsh comments about Frankie MacDonald, seeks forgiveness Atlantic", "title_full": "Sydney DJ apologizes for harsh comments about Frankie MacDonald, seeks forgiveness | CTV News Atlantic", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "CA", "spam_score": 0.0, "main_image": "https://www.ctvnews.ca/polopoly_fs/1.4361787.1554201446!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "performance_score": 0, "domain_rank": 4971, "social": {"facebook": {"likes": 193, "comments": 122, "shares": 80}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "7ac112619203f6d4447d34cd00690e6028276718", "url": "https://atlantic.ctvnews.ca/sydney-dj-apologizes-for-harsh-comments-about-frankie-macdonald-seeks-forgiveness-1.4361549", "ord_in_thread": 0, "author": "CTV Atlantic", "published": "2019-04-01T03:00:00.000+03:00", "title": "Sydney DJ apologizes for harsh comments about Frankie MacDonald, seeks forgiveness Atlantic", "text": "Air Date: March 30, 2019 Sydney DJ apologizes for harsh comments about Frankie MacDonald, seeks forgiveness CTV Atlantic Published Monday, April 1, 2019 10:02PM ADT\nHundreds of people are rallying to defend well-known Cape Breton weather personality Frankie MacDonald after a DJ made some harsh comments on social media.\nOn Monday, the Sydney-area DJ who made those comment apologized.\nThe man many know as Gary Boudreau says he's seen better days.\n“I started crying,” he said. “I couldn't believe that that was actually me that made comments like that. That's honestly not how I feel.”\nHe's referring to posts he made on Facebook about MacDonald, among them: “That's the face of our island. It needs to stop,” and “Legit, someone murder me if I ever … represent Cape Breton like this.”\nThe typically easy-going Frankie MacDonald did not respond in kind.\n“He has nothing better to do,” MacDonald said.\nMacDonald says he was leaving a hockey game Sunday night when he checked social media and saw Boudreau's comments.\n“I ignored them,” he said. “I ignore all negative comments.”\nSocial media had plenty of those Monday as hundreds of people came to MacDonald's defence.\nAnother Sydney-area DJ who used to employ Boudreau says he's been contacted by people thinking he -- or his business -- had something to do with the comments.\n“You read it, and you're like, ‘No, he's not. He's not really saying this,’” said Blaise Hollohan. “I had to read it four or five times to really get a feeling for it, to believe that he actually came across Facebook and said it.”\nAs it turns out, MacDonald and Boudreau know each other. Both remember meeting at some of the DJ's shows.\n“I have an alcohol problem,” Boudreau said. “And I'm going to be doing what I can this week, as soon as possible, to get the help I need for that.”\nBut Boudreau says he's not making any excuses. All he can do for now is ask forgiveness.\n“Frankie's probably going to see this,” Boudreau said. “So, Frankie, I am honestly and truly sorry man. I didn't mean any of that. You’re a great guy and I hope you can find it in your heart to forgive me.”\nMacDonald accepted Boudreau’s apology and says there are no hard feelings.\n“He's a great guy,” he said. “I met him before. He got his picture taken with me in 2013.”\nPeople who know MacDonald are not surprised to hear that.\nIn the wake of all this, a night of support has been organized for MacDonald at a downtown Sydney bar where he's been known to hang out.\nBoudreau says, while he doesn't think it would be wise to show up, he thinks it's a great idea.\nWith files from CTV Atlantic’s Ryan MacDonald. Related Stories ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "frankie macdonald", "sentiment": "negative"}, {"name": "frankie macdona", "sentiment": "negative"}, {"name": "gary boudreau", "sentiment": "none"}, {"name": "macdonald", "sentiment": "none"}, {"name": "boudreau", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}], "locations": [{"name": "cape breton", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T13:52:23.086+03:00"}, {"thread": {"uuid": "1cad87b33f5ffa1c520026dc70c58e4cb19c3099", "url": "https://wfmf.iheart.com/featured/ej/content/2019-04-01-some-customers-upset-over-mcdonalds-plays-april-fools-day-prank/", "site_full": "wfmf.iheart.com", "site": "iheart.com", "site_section": "https://wfmf.iheart.com/featured/ej/", "site_categories": ["music", "non_standard_content", "entertainment"], "section_title": "EJ - 102.5 WFMF", "title": "Some Customers Upset Over McDonald's Plays April Fool's Day Prank", "title_full": "Some Customers Upset Over McDonald's Plays April Fool's Day Prank | EJ | 102.5 WFMF", "published": "2019-04-02T04:45:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://i.iheart.com/v3/re/new_assets/5ca2be57c1cc208007452fde", "performance_score": 0, "domain_rank": 1524, "social": {"facebook": {"likes": 1, "comments": 0, "shares": 1}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "1cad87b33f5ffa1c520026dc70c58e4cb19c3099", "url": "https://wfmf.iheart.com/featured/ej/content/2019-04-01-some-customers-upset-over-mcdonalds-plays-april-fools-day-prank/", "ord_in_thread": 0, "author": "iheart.com", "published": "2019-04-02T04:45:00.000+03:00", "title": "Some Customers Upset Over McDonald's Plays April Fool's Day Prank", "text": "McDonald's managed to make customers upset after playing an April Fool's Day joke on their customers. McDonald's claimed to be introducing the McPickle Burger, which consisted of cheese, ketchup, a sesame seed bun, and two mounds of pickles. The fast-food chain shared a video of the burger on their Australian social media pages and pickle lovers went bananas over the new menu item. Others who figured out it wasn't really a sandwich wanted McDonald's to make the sandwich a real thing. , \"catalog_type\": \"artist\", \"description\": \"\", \"id\": 30983282, \"name\": \"Dua Lipa\", \"related\": [, , , , , , ], \"tagged\": false, \"type\": \"catalog\"}}", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "mcdonald", "sentiment": "negative"}], "locations": []}, "rating": null, "crawled": "2019-04-02T15:47:36.087+03:00"}, {"thread": {"uuid": "0aa1704b8626d975e6ecc0b43e24dc7da0b8932b", "url": "https://995wmag.iheart.com/content/2019-04-02-mcdonalds-pickle-sandwhich/", "site_full": "995wmag.iheart.com", "site": "iheart.com", "site_section": "", "site_categories": ["non_standard_content"], "section_title": "", "title": "McDonald's Pickle Sandwhich | 99.5 WMAG", "title_full": "McDonald's Pickle Sandwhich | 99.5 WMAG", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.177, "main_image": "https://i.iheart.com/v3/re/new_assets/5ca33bf4e7eadf57f769514a", "performance_score": 0, "domain_rank": 1524, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "0aa1704b8626d975e6ecc0b43e24dc7da0b8932b", "url": "https://995wmag.iheart.com/content/2019-04-02-mcdonalds-pickle-sandwhich/", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "McDonald's Pickle Sandwhich | 99.5 WMAG", "text": "The Best Variety of the '80s, '90s and Today. Greensboro-Winston-Salem-High Point 99.5 WMAG - The Best Variety of the '80s, '90s and Today. Greensboro-Winston-Salem-High Point ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "mcdonald", "sentiment": "negative"}], "locations": []}, "rating": null, "crawled": "2019-04-02T16:01:54.000+03:00"}, {"thread": {"uuid": "de59046e6a4f0fd7af12c2a15f8f76af291b741a", "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/coronation-streets-beverley-callard-accidentally-16065591", "site_full": "www.manchestereveningnews.co.uk", "site": "manchestereveningnews.co.uk", "site_section": "", "site_categories": ["media"], "section_title": "", "title": "Coronation Street's Beverley Callard accidentally lets slip that Jim McDonald is returning to the soap - Manchester Evening News", "title_full": "Coronation Street's Beverley Callard accidentally lets slip that Jim McDonald is returning to the soap - Manchester Evening News", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "GB", "spam_score": 0.0, "main_image": "https://i2-prod.manchestereveningnews.co.uk/incoming/article15203248.ece/ALTERNATES/s1200/6_10_CORO_LIZ_JIM_01JPG.jpg", "performance_score": 0, "domain_rank": 7505, "social": {"facebook": {"likes": 229, "comments": 163, "shares": 13}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "de59046e6a4f0fd7af12c2a15f8f76af291b741a", "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/coronation-streets-beverley-callard-accidentally-16065591", "ord_in_thread": 0, "author": "Katie Fitzpatrick", "published": "2019-04-02T03:00:00.000+03:00", "title": "Coronation Street's Beverley Callard accidentally lets slip that Jim McDonald is returning to the soap - Manchester Evening News", "text": "Share By Katie Fitzpatrick 15:00, 2 APR 2019 News Video Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now Get the biggest daily Beverley Callard appeared to accidentally confirm that her on-screen ex husband would be returning to Coronation Street this year.\nBeverley, who plays the iconic character Liz McDonald in the soap, seemed to let slip on Loose Women that Jim would be making a comeback to Weatherfield after turning his ex wife&apos;s life upside down.\nAsked if she could tease what was coming up on the show, she hinted at more Liz and Jim drama by comparing the couple to Prince Andrew and Sarah Ferguson who have remained good friends after splitting in 1996.\n\"We&apos;ve got some really good stuff coming up. The summer and autumn are quite amazing,\" she told the Loose Women panel.\nShe added: \"In fact, I quite think that Andrew and Fergie are quite like Liz and Jim.\"\nLiz and Jim McDonald (Image: ITV) Beverley also revealed she had some hilarious scenes coming up with her on-screen son Steve played by Simon Gregson.\n\"He rang me up last night and said &apos;Have you seen these scenes? We won&apos;t be able to do it for laughing!&apos;\" she said.\nLast year Jim turned up on the street to cruelly con her with his girlfriend Hannah Gilmore.\nHannah pretended she was Katie, Liz and Jim&apos;s daughter who died shortly after she was born in 1992, in an attempt to scam the Rovers Return barmaid out of her life savings.\nThe truth was uncovered when Hannah realised Jim still had feelings for Liz and plotted for Liz to walk in on them sharing a passionate kiss.\nBev on Loose Women (Image: ITV) Hannah then disappeared with the cash and a furious Liz berated Jim at Katie&apos;s grave.\nThere were rumours that Jim, who has myotonic dystrophy which affects the muscles and causes them to waste away, might return in a wheelchair and Liz becomes his carer in scenes reminiscent of the Bette Davis classic horror film Whatever Happened To Baby Jane? about an ageing child star who plots to get even with the sister left in her care, played by Joan Crawford.\n“There was a rumour upstairs, someone told me on the top floor where all the powers that be, that he comes back in a wheelchair and Liz treats him like Bette Davies,” Bev told us at the end of last year.\nCharles Lawson as Jim McDonald and Beverley Callard as Liz McDonald pictured in 1995 (Image: Granada Television) “&apos;Come and get your din dins Jim.&apos; “I thought &apos;yes I love this.&apos; I would love that. Serving him a butty for his dinner.”\nThe actress believes that Liz and Jim are destined to be together.\n“I don&apos;t think they are finished forever. I honestly don&apos;t think they are,\" she explained.\n“The way Charlie and I played it towards the very end they were coming together again before it was discovered and he played it with a sense of remorse and that he really did love Liz.\nRead More Coronation Street cast reunite to support former co-star on the opening night of The Girl On The Train “I really hope they will try and bring him back. I think maybe he&apos;ll somehow get the money to give back to Liz.”\nWant to talk about Corrie with other fans? Join our Coronation Street Fan Chat group on Facebook where you’ll also get updates, spoilers and more.", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "jim mcdonald", "sentiment": "negative"}, {"name": "beverley callard", "sentiment": "negative"}, {"name": "sarah ferguson", "sentiment": "none"}, {"name": "beverley", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}, {"name": "liz mcdonald", "sentiment": "none"}, {"name": "liz", "sentiment": "none"}, {"name": "corrie", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}], "organizations": [{"name": "manchester evening news coronation street", "sentiment": "negative"}], "locations": [{"name": "weatherfield", "sentiment": "none"}, {"name": "coronation street", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T01:18:31.033+03:00"}, {"thread": {"uuid": "dfa172c5bc6a4bf1dcf0a5ca97c7d14a28709692", "url": "https://edmonton.ctvnews.ca/truck-stolen-from-family-staying-at-ronald-mcdonald-house-recovered-1.4363353", "site_full": "edmonton.ctvnews.ca", "site": "ctvnews.ca", "site_section": "http://edmonton.ctvnews.ca/rss/EdmontonNews", "site_categories": ["under_construction", "non_standard_content"], "section_title": "CTV News - Edmonton", "title": "Truck stolen from family staying at Ronald McDonald House recovered", "title_full": "Truck stolen from family staying at Ronald McDonald House recovered | CTV News Edmonton", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "CA", "spam_score": 0.0, "main_image": "https://www.ctvnews.ca/polopoly_fs/1.4363354.1554260347!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "performance_score": 0, "domain_rank": 4971, "social": {"facebook": {"likes": 341, "comments": 41, "shares": 73}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "dfa172c5bc6a4bf1dcf0a5ca97c7d14a28709692", "url": "https://edmonton.ctvnews.ca/truck-stolen-from-family-staying-at-ronald-mcdonald-house-recovered-1.4363353", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "Truck stolen from family staying at Ronald McDonald House recovered", "text": "The truck stolen from a Red Deer family staying at the Ronald McDonald House in Edmonton was recovered Tuesday afternoon.\nThe Burkes came to Edmonton in January after 10-year-old Julianna was diagnosed with Stage 4 cancer.\nEven though the family uses the Ronald McDonald House shuttle to get to the Stollery Children’s Hospital four to five times a week for Julianna’s treatment, the Burkes would need their own vehicle to take her to her “adventures.”\n“We go to the mall, Big Al’s Aquarium, Petland, the swimming pool, restaurants,” Julianna told CTV News.\nThe Dodge RAM 3500 was recovered by EPS at an apartment complex in the Whyte Avenue area between 5 and 6 p.m., Mike Burke told CTV News. The truck is currently in the shop for window repairs.\n“We’re really happy to have the truck back,\" Burke said. \"We’re happy that it came back in better condition that I expected it to be. Julianna is really, really happy now that we can continue with our Edmonton adventures.”\nWith files from CTV Edmonton’s Nicole Weisberg\nPhotos After the Burkes recovered their truck on the same day it was stolen, Julianna will be able to continue her Edmonton adventures.", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "mike burke", "sentiment": "none"}, {"name": "burke", "sentiment": "none"}, {"name": "julianna", "sentiment": "none"}], "organizations": [{"name": "ronald mcdonald house", "sentiment": "negative"}, {"name": "stollery children’s hospital", "sentiment": "none"}, {"name": "nicole weisberg photos", "sentiment": "none"}, {"name": "burkes", "sentiment": "none"}, {"name": "ctv news", "sentiment": "none"}], "locations": [{"name": "edmonton", "sentiment": "none"}, {"name": "petland", "sentiment": "none"}, {"name": "whyte avenue", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T06:41:01.014+03:00"}, {"thread": {"uuid": "be55f3aa501123d8759fda0421b92ca9411a22d6", "url": "https://www.business-standard.com/article/news-cm/mcdonald-s-offers-free-fries-with-mcsaver-meals-119032800522_1.html", "site_full": "www.business-standard.com", "site": "business-standard.com", "site_section": "", "site_categories": ["media", "financial_news", "finance"], "section_title": "", "title": "McDonald's offers free fries with McSaver meals | Business Standard News", "title_full": "McDonald's offers free fries with McSaver meals | Business Standard News", "published": "2019-03-28T02:00:00.000+02:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.01, "main_image": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1190328/full-119032800522.jpg", "performance_score": 0, "domain_rank": 2291, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "be55f3aa501123d8759fda0421b92ca9411a22d6", "url": "https://www.business-standard.com/article/news-cm/mcdonald-s-offers-free-fries-with-mcsaver-meals-119032800522_1.html", "ord_in_thread": 0, "author": "Capital Market", "published": "2019-03-28T02:00:00.000+02:00", "title": "McDonald's offers free fries with McSaver meals | Business Standard News", "text": "\nWestlife Development's subsidiary, Hardcastle Restaurants, master franchisee of McDonald's in West and South India, is offering its iconic, delicious fries free with its medium McSaver meal.\nTo popularize this too-good-to-be true proposition, the brand has launched three television commercials ('TVCs').\nThe three TVCs, that have been conceptualized by DDB Mudra, reinforce the company's brand promise of 'easy to feel good' and capture the customers' absolute delight on getting free fries in a fun and quirky way. With this, the brand is all set to make its customers say 'i'm lovin' it' over and over again.\nPowered by Capital Market - Live News (This story has not been edited by Business Standard staff and is auto-generated from a syndicated feed.) First Published: Thu, March 28 2019. 14:55 IST ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "hardcastle restaurants", "sentiment": "negative"}, {"name": "mcdonald", "sentiment": "negative"}, {"name": "business standard news  westlife development", "sentiment": "neutral"}, {"name": "ddb mudra", "sentiment": "none"}, {"name": "business standard", "sentiment": "none"}], "locations": [{"name": "south india", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T09:01:03.001+03:00"}, {"thread": {"uuid": "4ecf2e9a6957ffa4c2290c9904b12681c20981da", "url": "https://www.today.com/food/mcdonald-s-red-lobster-hardee-s-prank-april-fools-day-t151313", "site_full": "www.today.com", "site": "today.com", "site_section": "", "site_categories": ["media"], "section_title": "", "title": "McDonald's, Red Lobster, Dunkin' Donuts prank April Fools' Day foods", "title_full": "McDonald's, Red Lobster, Dunkin' Donuts prank April Fools' Day foods", "published": "2019-04-01T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://media4.s-nbcnews.com/j/newscms/2019_14/1421891/mcpickle_and_red_vines_743887ef5422c7aa5e1ac20eea5edbef.social_share_1200x630_center.jpg", "performance_score": 1, "domain_rank": 1186, "social": {"facebook": {"likes": 395, "comments": 261, "shares": 140}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "4ecf2e9a6957ffa4c2290c9904b12681c20981da", "url": "https://www.today.com/food/mcdonald-s-red-lobster-hardee-s-prank-april-fools-day-t151313", "ord_in_thread": 0, "author": "", "published": "2019-04-01T03:00:00.000+03:00", "title": "McDonald's, Red Lobster, Dunkin' Donuts prank April Fools' Day foods", "text": "People were really excited about McDonald's new burger — until they found out it was fake It’s April Fools’ Day! But we kinda wish some of these prank foods were real. @McDonaldsUK/Twitter/Red Lobster/Facebook Get the latest from TODAY Sign up for our newsletter SUBSCRIBE April 1, 2019, 2:53 PM GMT / Source: TODAY By Erica Chayes Wida Several big food chains are offering some pretty peculiar deals on April 1. Of course, it's April Fools' Day and folks across the country (and the world) are plotting out how to prank their pals and loved ones today. Popular food brands have also been scheming up some new ideas. While we'd actually love to chow down on a McPickle, it turns out that there are a lot of fakers out there. Here are some of the top food pranks TODAY Food has spotted on April Fools' Day 2019. Starbucks just for dogs — Starbucks Coffee (@Starbucks) April 1, 2019 Oh, how we wish Pupbucks was a real thing! Starbucks' adorable commercial featuring a bunch of furry extras certainly brings out the \"aww!\" factor. Of course, many Starbucks stores do already offer Puppuccinos (basically just whipped cream in a small cup) so a store catering entirely to man's best friend isn't totally off base. Red Lobster's Red Licorice Straws Red Lobster is no stranger to mixing things up in the kitchen. They once ran a special that offered fried lobster drizzled in syrup with a Belgian waffle — and no, that was not a prank. But on Monday, the chain rolled out a surprising \"promotion\" for an eco-friendly straw option. Starting Summer 2019, red licorice straws will be our 1st test for an eco-friendly alternative for plastic straws! Soon, you may even be able to enjoy that drink with a Cheddar Bay Biscuit flavored licorice straw. What do you think about this sweet move? #LicoriceStraw pic.twitter.com/N7AUX8DhjQ — Red Lobster (@redlobster) April 1, 2019 \"Starting Summer 2019, red licorice straws will be our 1st test for an eco-friendly alternative for plastic straws!\" the chain wrote on its social media pages. Some licorice haters were disappointed. But others were excited. \"Might be good in some of the alcoholic drinks,\" an inventive fan wrote. Sipping cola through Red Vines isn't that unusual so even if the chain doesn't offer these edible straws soon, customers could just bring their own. McDonald's milkshake sauce pots McDonald's latest spring special involves one delightfully delicious habit many diners claim to love: dipping the chain's signature salty fries into their sweet shakes. Which country eats the most French fries? (Hint: It's not us) July 13, 2016 00:53 To make fry dipping that much easier, the chain \"introduced\" its first milkshake dipping sauces in four different flavors: vanilla, chocolate, strawberry and Shamrock (in the U.K., the chain joked about offering up a banana dipping sauce). — McDonald's UK (@McDonaldsUK) March 31, 2019 Most of the chain's followers weren't duped by the funny video. However, that hasn't stopped them from begging the chain to make milkshake sauce pots a real thing. I know this is April Fools but that's actually genius. Please make this real! — Kaleb01 (@Kaleb01_) April 1, 2019 Hasbro's Mr. Avo Head Hasbro , known for its iconic games and toys like Monopoly, Transformers and My Little Pony, created a new toy for all of the hipster children in the world. And he looks really delicious. Holy guacamole! We’ve given Mr. Potato Head the sack and we're introducing his new hipster companion, Mr Avo Head! pic.twitter.com/Y9aRITCTd7 — Hasbro (@Hasbro) April 1, 2019 \"Holy guacamole!\" Hasbro's social media peeps exclaimed on Twitter. \"We’ve given Mr. Potato Head the sack and we're introducing his new hipster companion, Mr. Avo Head! Avocado stuffed toys already exist, so this really isn't too much of a stretch, either — even if it isn't real. I bet his favorite music is Guac & Roll 🎵! — Shawn Warford (@Shawnforward13) April 1, 2019 Hardee's Chief Biscuit Officer For anyone obsessed with biscuits ( South Carolina native Craig Melvin is obviously a huge fan ), the fast food chain Hardee's is offering up the opportunity of a lifetime. The chain is \"hiring\" a chief biscuit officer — that's CBO to you. The position will reportedly handle and carefully approve all biscuit business. Join the Hardee’s family! We’re hiring for a Chief Biscuit Officer to oversee anything and everything biscuits at Hardee’s. Please apply at: https://t.co/9rSQ8uS4WP pic.twitter.com/kh4Jx8Fn7k — Hardee's (@Hardees) April 1, 2019 While this very sadly isn't a real position at the company, there really is an application page on the website. A Hardee's spokesperson told TODAY that applying to the position will enter biscuit fiends into the running for a year's worth of free biscuits (and that part's no joke!). McDonald's beautiful McPickle special McDonald's Australia thought it would be funny to launch an April Fools' Day burger for pickle fans. They didn't realize, however, just how many pickle there are in the world and people were very, very upset when they realized they'd been deceived by the chain. ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "erica chayes wida", "sentiment": "none"}], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "dunkin' donuts", "sentiment": "negative"}, {"name": "starbucks coffee", "sentiment": "none"}, {"name": "starbucks", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T11:57:27.001+03:00"}, {"thread": {"uuid": "356928a17c86d7e5d15897062aa43ecf855a704c", "url": "https://www.foxnews.com/food-drink/mcdonalds-customers-who-pepper-sprayed-knocked-over-items-during-chaotic-fight-get-arrested", "site_full": "www.foxnews.com", "site": "foxnews.com", "site_section": "https://www.foxnews.com/food-drink", "site_categories": ["media"], "section_title": "Food &amp; Drink | Fox News", "title": "McDonald’s customers who pepper sprayed, knocked over items during chaotic fight get arrested", "title_full": "McDonald’s customers who pepper sprayed, knocked over items during chaotic fight get arrested | Fox News", "published": "2019-03-31T19:12:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/McDonaldsArchesIstock.jpg", "performance_score": 0, "domain_rank": 185, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "356928a17c86d7e5d15897062aa43ecf855a704c", "url": "https://www.foxnews.com/food-drink/mcdonalds-customers-who-pepper-sprayed-knocked-over-items-during-chaotic-fight-get-arrested", "ord_in_thread": 0, "author": "Alexandra Deabler", "published": "2019-03-31T19:12:00.000+03:00", "title": "McDonald’s customers who pepper sprayed, knocked over items during chaotic fight get arrested", "text": "UPSET MCDONALD&apos;S EMPLOYEE HITS CO-WORKER IN THE FACE WITH A CHEESEBURGER According to officials, the fight started when a 17-year-old girl went behind the counter at the fast food chain and struck an employee, the New York Post reported.\nWARNING: Video contains strong language.\nIn the footage of the fight, customers are seen yelling and throwing objects behind the McDonald’s counter. At one point, another girl, also reportedly 17, climbs onto the counter and begins pepper spraying a security guard and other employees in the face, before seeming to slip off the platform.\nTony Algarin, the security guard at the scene, told Breaking AC that this was his second day assigned to that McDonald’s location.\n“I’ve never been maced before,” said Algarin, 28. “It sucked and it burned but I knew I had to finish my job.”\nThe group continued to cause damage to the story by throwing napkins and knocking over other items before fleeing the scene.\nThe owner of the restaurant, Anthony Mack told the New York Post four or five employees had been hit with pepper spray, but employees refused medical treatment at the time.\nFour people were arrested, including three 17-year-old girls and 21-year-old Marcus Adderly, police said. Those involved are being charged with criminal mischief and disorderly conduct. The three girls were also charged with unlawful possession of a weapon and simple assault.\nAlexandra Deabler is a Lifestyle writer and editor for Fox News. ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://www.facebook.com/AtlanticCity911/videos/424939298273623/?v=424939298273623", "https://nypost.com/2019/04/03/four-arrested-after-wild-pepper-spray-filled-brawl-at-mcdonalds/", "https://www.breakingac.com/2019/03/ac-mcdonalds-fight-caught-on-video/"], "entities": {"persons": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "tony algarin", "sentiment": "none"}, {"name": "anthony mack", "sentiment": "none"}, {"name": "algarin", "sentiment": "none"}], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "new york post", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T21:36:48.006+03:00"}, {"thread": {"uuid": "91b69a6c83ccc754ed337a651bfe8bbfb6dd49aa", "url": "https://patch.com/illinois/plainfield/fleece-blankets-ronald-mcdonald-house", "site_full": "patch.com", "site": "patch.com", "site_section": "https://patch.com/illinois/plainfield", "site_categories": ["media"], "section_title": "Plainfield, IL Patch - Breaking Local News Events Schools Weather &amp; Sports", "title": "Fleece blankets for Ronald McDonald House | Plainfield, IL Patch", "title_full": "Fleece blankets for Ronald McDonald House | Plainfield, IL Patch", "published": "2019-04-01T20:59:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.006, "main_image": "https://cdn20.patchcdn.com/users/22855566/20190401/125929/styles/T800x600/public/processed_images/fleece_blankets_made_for_ronald_mcdonald_house-1554137697-1195.jpg", "performance_score": 0, "domain_rank": 465, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "91b69a6c83ccc754ed337a651bfe8bbfb6dd49aa", "url": "https://patch.com/illinois/plainfield/fleece-blankets-ronald-mcdonald-house", "ord_in_thread": 0, "author": "Pangelus", "published": "2019-04-01T20:59:00.000+03:00", "title": "Fleece blankets for Ronald McDonald House | Plainfield, IL Patch", "text": "This post was contributed by a community member. The views expressed here are the author's own.\nNeighbor Posts Fleece blankets for Ronald McDonald House St. Mary Immaculate Student Body shared blessings with many families to come. By Pangelus, Patch Contributor | Apr 1, 2019 12:59 pm ET {{ replyButtonLabel }} Reply {{ replyCount }} St. Mary Immaculate Parish School made fleece blankets.\nThe fleece blankets made by the student body were delivered to the Ronald McDonald house during spring break. The facility will benefit from the generosity of our students and they are excited to share these blessings with many families to come.\nPictured L to R: 6th Grader Evan, Mrs. Klump, and Mr. Hueg\n#SMISaysYes\nwww.smischool.org\n815-436-3953\nSubscribe Back to the Plainfield Patch The views expressed in this post are the author's own. Want to post on Patch? Register for a user account. More from Plainfield Up next on Plainfield Patch Stolen Laptop GPS Leads Cops To Car Burglar: Plainfield PD 9h Plainfield School Board: Incumbents Win, Newcomer Snags A Spot 1d This Half-Price Seat Cushion Offers Full Booty Support 1d Read more local news from Plainfield\nWhat are Featured Events? Featured Events are paid listings by users and receive priority placement on Patch, on our social pages and in our daily newsletters.\nTo promote your local event on Patch, here. Feature your event on Patch now Featured Events Apr 5 Senior Services of Will County Presents 'Diabetes Care 101' Apr 5 Mini Golf Opening Weekend Apr 6 Get Involved In National Robotics Week! Apr 6 Annual Autism Symposium Apr 6 CANCELLED: Teen Improv Workshop with ISU's Improv Mafia Apr 13 Cornerstone Early Learning Center Open House + Add your event Apr\n3 See More Events Near You > What are Featured Announcements? Featured Announcements are paid posts promoted by Patch community members. To promote your local announcement on Patch, create an account and start posting here. Feature your announcement on Patch now Featured Announcements JOB FAIR April 3 - 4 from 9:00 am -6:00 pm at Joliet Junior College Added by Jillian Aubin Thomas Morris Obituary Added by Thomas Morris Chicago Rush South Soccer Club Tryouts!! Added by Lisa Galt OPEN HOUSE Sunday April 7, 2019 Added by Diane M Lambert + Add your announcement Latest News Nearby Joliet, IL News Wacky Wednesday: Will Co. Jail April 3 Plainfield, IL News Car Burglary Nabbed Plainfield, IL News Plainfield Middle School Honor Rolls Plainfield, IL News Plainfield Blood Drive Plainfield, IL News Plainfield School Board Election Get Tickets Nearby Mamma Mia! Thursday, Apr, 04 at 8:00pm\nMamma Mia! Friday, Apr, 05 at 8:00pm", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["http://www.smischool.org", "https://www.facebook.com/sharer/sharer.php?u=https%3A//patch.com/illinois/plainfield/fleece-blankets-ronald-mcdonald-house", "https://twitter.com/intent/tweet?text=Fleece%20blankets%20for%20Ronald%20McDonald%20House&url=https%3A//patch.com/illinois/plainfield/fleece-blankets-ronald-mcdonald-house", "http://www.reddit.com/submit?url=https%3A//patch.com/illinois/plainfield/fleece-blankets-ronald-mcdonald-house&title=Fleece%20blankets%20for%20Ronald%20McDonald%20House"], "entities": {"persons": [{"name": "neig", "sentiment": "neutral"}, {"name": "ronald mcdonald", "sentiment": "none"}, {"name": "klump", "sentiment": "none"}, {"name": "ful", "sentiment": "none"}, {"name": "hueg", "sentiment": "none"}, {"name": "evan", "sentiment": "none"}], "organizations": [{"name": "ronald mcdonald house", "sentiment": "neutral"}, {"name": "ronald mcdonald house st. mary immaculate student body", "sentiment": "none"}, {"name": "st. mary immaculate parish school", "sentiment": "none"}, {"name": "plainfield pd 9h plainfield school board", "sentiment": "none"}], "locations": [{"name": "plainfield", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-04T06:46:19.025+03:00"}], "totalResults": 30, "moreResultsAvailable": 0, "next": "/filterWebContent?token=6c661f77-9010-47fb-9532-d5fdb563c97a&format=json&ts=1554349579025&q=published%3A%3E1553658014000+published%3A%3C1554172814000+domain_rank%3A%3C10000+site_type%3Anews+language%3Aenglish+title%3A%28%22McDonald%E2%80%99s+Corporation%22+OR+%22McDonals%22+OR+%22McDonald%27s+restaurants%22+OR+%22McDonald%27s+Corporation%22+OR+%22Mcdonald%27s+Corp.%22+OR+%22Mickey+d%22+OR+%22List+of+assets+owned+by+McDonald%27s%22+OR+%22%27s+Corporation%22+OR+%22McDonald%E2%80%99s%22+OR+%22Mc+Donalds%22+OR+%22McDonald%27s+Drive-In%22+OR+%22Speedee%22+OR+%22Micky+Ds%22+OR+%22Maccy+d%27s%22+OR+%22MdDonalds%22+OR+%22Macky+d%22+OR+%22Macky+d%27s%22+OR+%22McDonalds+Restaurants%22+OR+%22Mcdonalds%22+OR+%22Macca%27s%22+OR+%22Maccas%22+OR+%22McDonald%27s+Corp.%22+OR+%22Mcdonald%27s%22+OR+%22Mcdonald%27s+corporation%22+OR+%22Mcdonalds+Corporation%22+OR+%22McDonalds%22+OR+%22We+love+to+see+you+smile%22+OR+%22McDankee%27s%22+OR+%22The+McDonald%27s+Corporation%22+OR+%22McDonalds+Corporation%22+OR+%22Mcdo%22+OR+%22MacDonalds%22+OR+%22Mac+Donalds%22+OR+%22Double+Beef+and+Bacon%22+OR+%22Macdonald%27s%22+OR+%22McDonald%27s+Restaraunt%22+OR+%22McDonalds%27s%22+OR+%22Mc+Donald%27s%22+OR+%22MacDonald%27s%22+OR+%22Mckinley+mac%22+OR+%22McHappy+Day%22+OR+%22MankDonalds%22+OR+%22Criticisms+of+McDonald%27s%22+OR+%22Micky+D%27s%22+OR+%22Mc.donalds%22+OR+%22Aboutmcdonalds.com%22+OR+%22McDonald%27s+Restaurants%22+OR+%22McDonald%27s+Singapore%22+OR+%22MacDonald%E2%80%99s%22+OR+%22McDonalds.com%22+OR+%22MaccyD%27s%22+OR+%22MackyD%27s%22+OR+%22Mcdonalds+Corp%22+OR+%22MCDONALD%27S%22+OR+%22McDonald%27s+Corp%22+OR+%22McDonald%2527s%22+OR+%22Merck+Sharp+%26+Dohme%22+OR+%22Merck+Sharp+and+Dohme%22+OR+%22Rosetta+Biosoftware%22+OR+%22Merck+and+Company%22+OR+%22Intervet%22+OR+%22Merck+%26+Company%22+OR+%22Merck+%26+Company+Incorporated%22+OR+%22Merck+and+Co.+Inc.%22+OR+%22Merck+%26+Co.%2C+Inc.%22+OR+%22Merck+%26+Co%2C+Inc.%22+OR+%22Merck+%26+Co%22+OR+%22Merck+Research+Laboratories%22+OR+%22Merck+and+Co.%22+OR+%22Merck+and+Co.%2C+Inc%22+OR+%22Merck+Sharp+and+Dohme+Research+Laboratories%22+OR+%22Merck+%26+Co.+Inc.%22+OR+%22Frosst%22+OR+%22Merck+Frosst%22+OR+%22Merck+%26+Co+Inc.%22+OR+%22Merck+Sharp+%26+Dohme+Research+Laboratories%22+OR+%22Merck+%26+Co+Inc%22+OR+%22Merck+%26+Co.%2C+Inc%22+OR+%22Merck+%2526+Co.%22+OR+%22Microsoft+Inc.%22+OR+%22MicroSoft+Corporation%22+OR+%22Microsoft+Logo%22+OR+%22Micro-Soft%22+OR+%22Microsoft+Ltd%22+OR+%22Microsoft+Inc%22+OR+%22Mikrosoft%22+OR+%22Microsfot%22+OR+%22Blibbet%22+OR+%22MSoft%22+OR+%22Microsoft+Corp%22+OR+%22Microsft%22%29", "requestsLeft": 959, "warnings": null}