{"posts": [{"thread": {"uuid": "ecff6a4d2519da9deb0c7c351812a709bade4fdc", "url": "https://www.90min.com/posts/6333773-coca-cola-win-naming-rights-for-tottenham-hotspur-stadium?view_source=teams_page&view_medium=[tottenham]", "site_full": "www.90min.com", "site": "90min.com", "site_section": "https://www.90min.com/teams/tottenham?page=51", "site_categories": ["world_soccer", "sports"], "section_title": "Tottenham Hotspur Latest News &amp; Fan Opinion - Tottenham Hotspur Football Club - 90min", "title": "Coca-Cola Win Naming Rights for Tottenham Hotspur Stadium", "title_full": "Coca-Cola Win Naming Rights for Tottenham Hotspur Stadium | 90min", "published": "2019-04-01T09:01:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "GB", "spam_score": 0.011, "main_image": "https://images2.minutemediacdn.com/image/upload/c_fill,w_1200,h_630,f_auto,q_auto,g_auto/shape/cover/sport/tottenham-hotspur-v-southampton-u18-premier-league-5c9e33af2e43160d18000001.jpg", "performance_score": 5, "domain_rank": 2254, "social": {"facebook": {"likes": 3041, "comments": 2753, "shares": 577}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "ecff6a4d2519da9deb0c7c351812a709bade4fdc", "url": "https://www.90min.com/posts/6333773-coca-cola-win-naming-rights-for-tottenham-hotspur-stadium?view_source=teams_page&view_medium=[tottenham]", "ord_in_thread": 0, "author": "Donovan Chandler", "published": "2019-04-01T09:01:00.000+03:00", "title": "Coca-Cola Win Naming Rights for Tottenham Hotspur Stadium", "text": "Soft drinks giant ​Coca-Cola have won the naming rights to the Tottenham Hotspur Stadium, with the 62,000-seater venue's new title to come into effect immediately.\nThe stadium, which is now the biggest club venue in London, is finally set to host its first Premier League game after months of delays.\nFollowing an Under-18s test event, legends match and ​first-team training session , ​Spurs will play their first game at the newly named Coca-Cola Arena on Wednesday night as they take on London rivals ​Crystal Palace .\nIt is reported that Coca-Cola beat out other bidders Heinz and Evian to be awarded the multi-million pound sponsorship deal, which includes several other marketing initiatives in addition to the naming rights.\nA PR representative from Coca-Cola said, via a ​press release : \"We are delighted to announce this partnership with Tottenham Hotspur.\n\"As the most famous bottle in the world, Coca-Cola obviously has a lot of synergy with Spurs. It's a match made in heaven for us.\n\"We look forward to a relatively successful but ultimately disappointing partnership.\"\nAs part of the new sponsorship deal, Tottenham's traditional matchday mascot of a cockerel will be replaced by a giant bottle, while there are reportedly talks about including the bottle insignia on the club's kits for the following season.\nAs part of a corporate responsibility programme, Coca-Cola and Tottenham have committed to installing bottle banks around the state of the art venue for recycling, encouraging fans to 'bottle it!'.\nWhen asked for comment, manager Mauricio Pochettino said: \"How did this get signed off? I mean really. Come on. God, I wish I was at Real Madrid.\"", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://media.gettyimages.com/photos/general-view-inside-the-stadium-prior-to-the-u18-premier-league-picture-id1137957145?b=1&k=6&m=1137957145&s=612x612&w=0&h=9cxvZ5pvN-_Ax6xQdjtTzAabSN_zrJMIJSTlRecUSbI=", "https://media.gettyimages.com/photos/general-view-inside-the-stadium-ahead-of-the-u18-premier-league-picture-id1137946192?b=1&k=6&m=1137946192&s=612x612&w=0&h=F7-uJHGNNpzF7f3qVn4NKYpdTg7FsaVTHyGOEYUuS2U=", "https://media.gettyimages.com/photos/john-guarino-president-of-coca-cola-canada-holds-a-fifa-2015-womens-picture-id468285918?b=1&k=6&m=468285918&s=612x612&w=0&h=xQEh-2v_tAoZV9xgZ_dSF9VL-MnuDXbYqGJSUe1jVZ8=", "https://en.wikipedia.org/wiki/April_Fools%27_Day"], "entities": {"persons": [{"name": "heinz", "sentiment": "none"}], "organizations": [{"name": "coca-cola", "sentiment": "negative"}, {"name": "tottenham", "sentiment": "negative"}, {"name": "coca-cola arena", "sentiment": "none"}, {"name": "tottenham hotspur", "sentiment": "none"}, {"name": "crystal palace", "sentiment": "none"}, {"name": "spurs", "sentiment": "none"}], "locations": [{"name": "tottenham hotspur stadium", "sentiment": "none"}, {"name": "london", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T02:01:13.003+03:00"}, {"thread": {"uuid": "d79bc5c2b90512c8144ac4eb9eeb441ddbb30ee3", "url": "https://sg.style.yahoo.com/old-school-tommy-hilfiger-coca-210300809.html", "site_full": "sg.style.yahoo.com", "site": "yahoo.com", "site_section": "https://sg.style.yahoo.com/rss", "site_categories": ["search_engine", "fashion", "tech", "style_and_fashion"], "section_title": "Yahoo Style Singapore", "title": "I Need an Old-School Tommy Hilfiger Coca-Cola Sweatshirt and I Need It Now", "title_full": "I Need an Old-School Tommy Hilfiger Coca-Cola Sweatshirt and I Need It Now", "published": "2019-04-02T00:03:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://s.yimg.com/uu/api/res/1.2/EX6jvoWsdXn5ZwbIN5Zhmg--~B/aD0xNDY3O3c9MjIwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/esquire_269/9a93ee3c6191b4341dfab721c25e06d7", "performance_score": 0, "domain_rank": 5, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "d79bc5c2b90512c8144ac4eb9eeb441ddbb30ee3", "url": "https://sg.style.yahoo.com/old-school-tommy-hilfiger-coca-210300809.html", "ord_in_thread": 0, "author": "", "published": "2019-04-02T00:03:00.000+03:00", "title": "I Need an Old-School Tommy Hilfiger Coca-Cola Sweatshirt and I Need It Now", "text": "Shopping 1 / 29\nTommy Hilfiger is one of those brands that evolves well -especially since sometimes that means not evolving too much. The label has held strong to its quintessential '90s vibe, even two decades later. And it just works: the simple color-blocking with bright shades, the summer-adjacent feel, the strategic collaborations. It's nostalgic, sure. But what's old is new again, and Tommy pulls from the archives in the right way, playing the hits and leaving the rest in the past\nThat's why I'm particularly enamored of the remake of the 1986 clothing collaboration it did with Coca-Cola. It's just plain good. There's a wide selection of brightly colored crewneck sweatshirts-the standouts of the bunch-along with T-shirts, a jacket, and a rugby shirt. The whole collection is available April 5, but we've got a preview of what's to come. Take a look.", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://goo.gl/YxYRYZ"], "entities": {"persons": [{"name": "tommy hilfiger", "sentiment": "positive"}, {"name": "tommy", "sentiment": "none"}], "organizations": [{"name": "coca-cola", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-02T03:17:16.005+03:00"}, {"thread": {"uuid": "1d6830e97e37e8ddc0a54ff4711f70199993cb2f", "url": "https://www.npr.org/sections/goatsandsoda/2019/01/10/683919100/study-coca-cola-shaped-chinas-efforts-to-fight-obesity", "site_full": "www.npr.org", "site": "npr.org", "site_section": "http://www.bignewsnetwork.com/index.php/nav/rss/e1dd7913e128b66a", "site_categories": ["media", "music", "entertainment"], "section_title": "Latest Fitness News RSS feed – Big News Network", "title": "Study: How Coca-Cola Shaped China's Efforts To Fight Obesity : Goats and Soda", "title_full": "Study: How Coca-Cola Shaped China's Efforts To Fight Obesity : Goats and Soda", "published": "2019-04-01T11:37:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://media.npr.org/assets/img/2019/01/10/gettyimages-89232938_wide-b0cc1c628f6efde92cadd8fd6bd2eaa053cee3e5.jpg?s=1400", "performance_score": 3, "domain_rank": 495, "social": {"facebook": {"likes": 698, "comments": 182, "shares": 348}, "gplus": {"shares": 0}, "pinterest": {"shares": 5}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "1d6830e97e37e8ddc0a54ff4711f70199993cb2f", "url": "https://www.npr.org/sections/goatsandsoda/2019/01/10/683919100/study-coca-cola-shaped-chinas-efforts-to-fight-obesity", "ord_in_thread": 0, "author": "", "published": "2019-04-01T11:37:00.000+03:00", "title": "Study: How Coca-Cola Shaped China's Efforts To Fight Obesity : Goats and Soda", "text": "Students exercise at a weight-loss summer camp in China's Shandong Province. The government promotes physical activity as the solution to a growing obesity problem. Wang Zhide/VCG via Getty Images hide caption toggle caption Wang Zhide/VCG via Getty Images Students exercise at a weight-loss summer camp in China's Shandong Province. The government promotes physical activity as the solution to a growing obesity problem. Wang Zhide/VCG via Getty Images\nThe Coca-Cola company exerted strong influence over the way the Chinese government addressed the country's growing obesity problem, according to a study published Wednesday in the Journal of Public Health Policy and the BMJ .\nStudy author Susan Greenhalgh , a social scientist and China scholar, wanted to uncover the opaque process of science-based policymaking in China. She focused on the government's efforts to address a growing obesity crisis: The percentage of overweight or obese Chinese adults more than doubled over two decades, from 20.5 percent in 1991 to 42.3 percent in 2011.\nGreenhalgh's years-long investigation unraveled the complex personal, institutional and financial connections the soda company cultivated to align Chinese science and policy with the interest in building a market for Coke in China.\n\"I was surprised here at the extent to which Coke was able to penetrate the government,\" said Paulo Serôdio , a postdoctoral researcher at the University of Barcelona who studies how corporations influence science and policy. \"The study gives us an interesting and important insight on the extent to which corporations can influence public policy in other countries where there is less scrutiny.\"\nWorldwide obesity rates have nearly tripled since 1975 to 13 percent. The trend has drawn the attention of public health officials.\nIn the late '90s and early 2000s, a consensus emerged in the public health community that beverages loaded with added sugar, such as soda, are partly to blame. To curb consumption of these drinks, countries have issued public health messages and enacted policies such as soda taxes. As a result, soda consumption is on the decline in many Western countries.\nThat's bad news for soda giants, who want to grow their market. A series of reports from The New York Times in 2015 detailed how, in the U.S., Coca-Cola has tried to downplay the role of diet while supporting and amplifying research that emphasizes the importance of physical activity to bring down obesity rates. Whether their influence extended beyond Western countries into emerging markets such as China was unclear until Greenhalgh's investigation.\nShe found that Coca-Cola promoted this message globally through the International Life Science Institute (ILSI), a research nonprofit set up by Coke executive Alex Malaspina in 1978. ILSI, according to its website, aims to foster collaboration between scientists from industry, government and academia.\nBut critics of the ILSI contend that it acts to further the corporate interests of Coca-Cola. While ILSI is based in Washington, D.C., its influence extends globally through 17 international branches positioned mostly in emerging markets, including China.\nCoca-Cola recognized the untapped potential of the Chinese market in 1978, becoming the first international company to re-enter China in the post-Mao era. Greenhalgh reports that this effort was spearheaded by Malaspina, who traveled to China that year to establish connections with local scientists. There he met Chen Chunming, a politically savvy nutritionist who, according to Greenhalgh, would become the main architect of Chinese obesity science and policy. Some Chinese Grandparents Are Making Their Grandkids Fat\nThe scientific and political climate in China allowed American corporate interests to easily gain a foothold in Chinese science and public policy. Government funding for chronic disease research was virtually nonexistent. With nowhere else to turn, Chinese scientists readily accepted foreign corporate research funding, and according to Greenhalgh, Chinese research culture was not focused on potential conflicts of interest.\nWestern support in science was especially valued because up until recently, \"the Chinese have had this narrative of national scientific backwardness,\" Greenhalgh said. Many welcomed support from this Western organization.\nAfter working on the governmental side of Chinese public health policy for a decade, Chen founded ILSI-China and became its director, with the support of ILSI and Malaspina. Though she was no longer a government official, she retained critical political influence and even continued to operate in the same government building. Chen told Greenhalgh that she promised corporate supporters that ILSI would translate science into public policy.\nUnder Chen's leadership, ILSI-China would come to be the primary entity shaping Chinese obesity science and policy. Greenhalgh learned that this influence began when ILSI-China, at the government's request, drafted guidelines for the prevention and control of obesity. These were published in 2003 as official national policies, but without any indication they were created by the Coke-backed entity.\n\"This firmly established ILSI-China as the key obesity-related science and policymaking organization,\" Greenhalgh said. ILSI-China was well-positioned to align Chinese obesity science and policy with Coca-Cola's emphasis on a lack of physical activity, as opposed to diet, as the major cause of obesity.\nCoca-Cola put its full weight behind this message as public health entities such as the World Health Organization began to draw attention to the obesity epidemic. According to Greenhalgh, Coca-Cola crafted ideas such as \"Energy Balance\" and \"Exercise is Medicine\" to construct a narrative that all foods (including Coca-Cola) are part of a healthy diet as long as they're balanced with physical activity.\nBruce Y. Lee , director of the Global Obesity Prevention Center at Johns Hopkins University, notes that physical inactivity is an obvious contributor to obesity, but so is diet, and \"to emphasize one over the other is a mistake.\"\nIn countries such as the U.S., the message about physical activity was one of a number of research perspectives that influenced policy. But in China, ILSI was the sole voice, Greenhalgh said, and it spread its message mainly by organizing conferences. Between 2004 and 2015, there were six international obesity conferences in China, all organized by ILSI-China.\nSpeakers at these conferences almost exclusively emphasized the importance of physical activity in preventing obesity and did not mention the role of restricting calories or limiting sugary beverages and processed foods. Greenhalgh found that virtually all U.S. speakers were invited because of their ties to ILSI-China and Coca-Cola. Rhona Applebaum, Coca-Cola's chief science and health officer, spoke in 2013, outlining Coke's commitment to preventing obesity in terms of \"energy balance.\"\nScientific conferences can allow researchers to take a step back and see the larger themes and differing perspectives animating their field. But Greenhalgh contends that a Chinese researcher could come away from a conference sponsored by ILSI-China thinking the international scientific consensus was that diet is less important than physical activity in addressing obesity, when research has shown that is decidedly not the case.\nCoca-Cola's influence is perhaps most clear in Chinese public policy initiatives. ILSI-Global set up a Center for Health Promotion in Atlanta aimed partly at promoting physical activity solutions to the obesity crisis. According to Greenhalgh, Malaspina played a key role in organizing this center, and Chen was one of its board members. In 2004 the center unveiled Take 10, a 10-minute kid exercise program promoted by Coca-Cola. Greenhalgh found that shortly afterward, ILSI-Global transferred just more than $50,000 to the Chinese Centers for Disease Control and by the end of the year the organization had rolled out its own childhood obesity program called Happy 10.\nSince The Times' 2015 investigative reporting, Coca-Cola has backed off its advocacy of its ideas about obesity in China. In response to Greenhalgh's study, the company released a statement acknowledging that \"too much sugar isn't good for anyone\" and emphasizing a move toward more transparency in research funding, plus a pledge to not be the main funding source for any research. They also said they have expanded their no-sugar and low-sugar options in China.\nDespite this shift, Coca-Cola's imprint on Chinese obesity policy remains palpable. For example, Greenhalgh analyzed public policy documents related to Healthy China 2030, a Chinese initiative unveiled in 2016 to address chronic disease. She found that most of the specific targets of the initiative relate to increasing physical activity and that goals surrounding nutrition are restricted to limiting salt intake.\nFurther, Coke-backed terms such as \"energy balance,\" \"eating and moving in balance\" and \"exercise is medicine\" are featured prominently in those documents.\n\"That's really shocking because that's the language Coke's been promoting all along,\" Greenhalgh said.\nJonathan Lambert is an intern on NPR's Science Desk. Correction Jan. 10, 2019\nA previous version of this story incorrectly stated that the percentage of Chinese adults who were obese had doubled from 1991 to 2011. In fact, the percentage refer to adults who are overweight or obese.", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://www.bmj.com/content/364/bmj.k5050", "https://www.ncbi.nlm.nih.gov/pubmed/26275960", "https://www.jhsph.edu/faculty/directory/profile/3010/bruce-y-lee", "https://www.who.int/news-room/fact-sheets/detail/obesity-and-overweight", "https://www.ncbi.nlm.nih.gov/pubmed/21383837", "https://well.blogs.nytimes.com/2015/08/09/coca-cola-funds-scientists-who-shift-blame-for-obesity-away-from-bad-diets/", "https://anthropology.fas.harvard.edu/people/susan-greenhalgh", "https://link.springer.com/article/10.1057%2Fs41271-018-00158-x", "http://ilsi.org/", "http://www.ub.edu/school-economics/researchers/serodio-paulo/"], "entities": {"persons": [{"name": "greenhalgh", "sentiment": "none"}, {"name": "wang zhide/vcg", "sentiment": "none"}, {"name": "susan greenhalgh", "sentiment": "none"}], "organizations": [{"name": "getty images", "sentiment": "none"}, {"name": "coca-cola", "sentiment": "none"}, {"name": "journal of public health policy", "sentiment": "none"}, {"name": "bmj", "sentiment": "none"}], "locations": [{"name": "shandong province", "sentiment": "none"}, {"name": "china", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T04:33:08.030+03:00"}, {"thread": {"uuid": "1b1187bf1cf694c706f4c8d2c6890d6599be3d07", "url": "https://www.slideshare.net/wool4wyedg565/textbook-network-security-auditing-cisco-press-networking-technology-book-fullpages", "site_full": "www.slideshare.net", "site": "slideshare.net", "site_section": "http://pt.slideshare.net/rss/latest", "site_categories": ["tech", "non_standard_content", "social"], "section_title": "Recently Uploaded Slideshows", "title": "textbook_$ Network Security Auditing Cisco Press Networking Technology book 'Full_Pages'", "title_full": "textbook_$ Network Security Auditing Cisco Press Networking Technology book 'Full_Pages'", "published": "2019-04-02T05:08:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://cdn.slidesharecdn.com/ss_thumbnails/169d42c1995-190402020847-thumbnail-4.jpg?cb=1554170948", "performance_score": 0, "domain_rank": 160, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "1b1187bf1cf694c706f4c8d2c6890d6599be3d07", "url": "https://www.slideshare.net/wool4wyedg565/textbook-network-security-auditing-cisco-press-networking-technology-book-fullpages", "ord_in_thread": 0, "author": "wool4wyedg565@slideshare.net(wool4wyedg565)", "published": "2019-04-02T05:08:00.000+03:00", "title": "textbook_$ Network Security Auditing Cisco Press Networking Technology book 'Full_Pages'", "text": "Network Security Auditing Cisco Press Networking Technology book Download at => https://happyreadingbooks09o9i.blogspot.com/1587053527 Network Security Auditing Cisco Press Networking Technology book pdf download, Network Security Auditing Cisco Press Networking Technology book audiobook download, Network Security Auditing Cisco Press Networking Technology book read online, Network Security Auditing Cisco Press Networking Technology book epub, Network Security Auditing Cisco Press Networking Technology book pdf full ebook, Network Security Auditing Cisco Press Networking Technology book amazon, Network Security Auditing Cisco Press Networking Technology book audiobook, Network Security Auditing Cisco Press Networking Technology book pdf online, Network Security Auditing Cisco Press Networking Technology book download book online, Network Security Auditing Cisco Press Networking Technology book mobile, Network Security Auditing Cisco Press Networking Technology book pdf free download, download ebook PDF EPUB, book in english language, Download pdf kindle audiobook mp3 ...", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://happyreadingbooks09o9i.blogspot.com/1587053527"], "entities": {"persons": [], "organizations": [{"name": "network security auditing cisco press networking technology", "sentiment": "negative"}], "locations": []}, "rating": null, "crawled": "2019-04-02T05:12:05.006+03:00"}, {"thread": {"uuid": "cc962b3545d611a8a7ee5f8ccf4b57d6745a6bc7", "url": "https://seekingalpha.com/news/3447576-exxon-qatar-jv-market-lng-exported-golden-pass-export-project", "site_full": "seekingalpha.com", "site": "seekingalpha.com", "site_section": "https://seekingalpha.com/market-news/energy", "site_categories": ["investing", "financial_news", "finance", "mutual_funds"], "section_title": "Energy News | Seeking Alpha", "title": "Exxon-Qatar JV to market all LNG exported from Golden Pass export project - Exxon Mobil Corporation (NYSE:XOM)", "title_full": "Exxon-Qatar JV to market all LNG exported from Golden Pass export project - Exxon Mobil Corporation (NYSE:XOM) | Seeking Alpha", "published": "2019-04-01T15:11:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://static3.seekingalpha.com/assets/og_image_192-59bfd51c9fe6af025b2f9f96c807e46f8e2f06c5ae787b15bf1423e6c676d4db.png", "performance_score": 0, "domain_rank": 1432, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "cc962b3545d611a8a7ee5f8ccf4b57d6745a6bc7", "url": "https://seekingalpha.com/news/3447576-exxon-qatar-jv-market-lng-exported-golden-pass-export-project", "ord_in_thread": 0, "author": "Carl Surran", "published": "2019-04-01T15:11:00.000+03:00", "title": "Exxon-Qatar JV to market all LNG exported from Golden Pass export project - Exxon Mobil Corporation (NYSE:XOM)", "text": "Ocean LNG will offtake and market all liquefied natural gas volumes to be produced and exported from the Golden Pass LNG export project in Sabine Pass, Tex., Qatar Petroleum says.\nOcean LNG is an international joint venture marketing company, 70% owned by affiliates of Qatar Petroleum and 30% by Exxon Mobil (NYSE: XOM ).\nGolden Pass LNG was sanctioned in February, and construction is expected to begin soon on the $10B facility which will have capacity to produce 16M mt/year of LNG when operations begin in 2024.​\nClick to subscribe to real-time analytics on XOM\nNow read: Better Dividend Aristocrat: Exxon Mobil Or Chevron? ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://www.lngworldshipping.com/news/view,ocean-lng-to-market-all-lng-exported-from-new-us-terminal_57348.htm"], "entities": {"persons": [], "organizations": [{"name": "ocean lng", "sentiment": "negative"}, {"name": "exxon mobil corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "exxon mobil", "sentiment": "none"}, {"name": "chevron", "sentiment": "none"}, {"name": "qatar petroleum", "sentiment": "none"}], "locations": [{"name": "golden pass", "sentiment": "none"}, {"name": "tex.", "sentiment": "none"}, {"name": "sabine pass", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T09:09:59.010+03:00"}, {"thread": {"uuid": "fd7746b03dba5bc4fc568371cbdc8b6d6b46273c", "url": "https://energy.economictimes.indiatimes.com/news/oil-and-gas/exxonmobil-approves-multi-billion-dollar-investment-in-singapore-complex/68684771", "site_full": "energy.economictimes.indiatimes.com", "site": "indiatimes.com", "site_section": "", "site_categories": ["media", "business", "green_solutions"], "section_title": "", "title": "exxonmobil: Exxonmobil approves multi-billion Dollar investment in Singapore complex, Energy News, ET EnergyWorld", "title_full": "exxonmobil: Exxonmobil approves multi-billion Dollar investment in Singapore complex, Energy News, ET EnergyWorld", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "IN", "spam_score": 0.044, "main_image": "https://etimg.etb2bimg.com/thumb/msid-68684771,imgsize-42211,width-800,height-434,overlay-etenergyworld/exxonmobil-approves-multi-billion-dollar-investment-in-singapore-complex.jpg", "performance_score": 0, "domain_rank": 116, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "fd7746b03dba5bc4fc568371cbdc8b6d6b46273c", "url": "https://energy.economictimes.indiatimes.com/news/oil-and-gas/exxonmobil-approves-multi-billion-dollar-investment-in-singapore-complex/68684771", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "exxonmobil: Exxonmobil approves multi-billion Dollar investment in Singapore complex, Energy News, ET EnergyWorld", "text": "Companies Exxonmobil approves multi-billion Dollar investment in Singapore complex The expansion project is part of a plan to enhance competitiveness of the Singapore facility, which includes the world’s only steam cracker capable of cracking crude oil ETEnergyWorld | April 02, 2019, 13:01 IST Newsletter A A New Delhi: ExxonMobil , the world’s largest publicly traded oil and gas company , today announced it has made a final investment decision on a multi-billion dollar expansion of its integrated manufacturing complex in Singapore to convert fuel oil and other products into higher-value stocks and distillates.The expansion project is part of the company’s plan to enhance the competitiveness of the Singapore facility, which includes the world’s only steam cracker capable of cracking crude oil. The project will increase site downstream and chemical earnings potential, the firm said in a statement, adding engineering, procurement and construction activities have begun and startup is anticipated in 2023.“The demand for high-quality fuels and lubricants will increase as the global economy expands. By using a combination of proprietary catalyst and process technologies, we will increase the site’s competitiveness and help meet growing demand for high-performance lubricants and cleaner fuels,” said Bryan Milton, president of ExxonMobil Fuels & Lubricants Company.The investment is expected to add 20,000 barrels per day of base stocks capacity, which includes EHCTM 50 and EHCTM 120 grades, in addition to a new high-viscosity Group II base stock to meet increasing demand in the Asia-Pacific region, the company said.The expansion is also likely to add the capacity to increase production of cleaner fuels with lower-sulfur content by 48,000 barrels per day, including high-quality marine fuels to enable customers to meet the International Maritime Organization’s 0.50 per cent sulfur requirement. RELATED ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "exxonmobil", "sentiment": "negative"}, {"name": "energyworld companies exxonmobil", "sentiment": "negative"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T14:57:14.000+03:00"}, {"thread": {"uuid": "41add328ad3e0f014b5221f77fa2a45d6741beda", "url": "https://itknowledgeexchange.techtarget.com/itanswers/what-sfp-can-be-used-to-connect-the-cisco-sg500-52p-and-the-catalyst-cw-3850-switches/", "site_full": "itknowledgeexchange.techtarget.com", "site": "techtarget.com", "site_section": "", "site_categories": ["tech", "non_standard_content", "adult"], "section_title": "", "title": "what SFP can be used to connect the Cisco SG500-52P and the catalyst CW 3850 switches - IT Answers", "title_full": "what SFP can be used to connect the Cisco SG500-52P and the catalyst CW 3850 switches - IT Answers", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "http://cdn.ttgtmedia.com/ITKE/images/logos/TTlogo-379x201.png", "performance_score": 0, "domain_rank": 1651, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "41add328ad3e0f014b5221f77fa2a45d6741beda", "url": "https://itknowledgeexchange.techtarget.com/itanswers/what-sfp-can-be-used-to-connect-the-cisco-sg500-52p-and-the-catalyst-cw-3850-switches/", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "what SFP can be used to connect the Cisco SG500-52P and the catalyst CW 3850 switches - IT Answers", "text": "Forgot Password? I agree to TechTarget's Terms of Use , Privacy Policy , and the transfer of my information to the United States for processing to provide me with relevant information as described in our Privacy Policy. I agree to my information being processed by TechTarget and its Partners to contact me via phone, email, or other means regarding information relevant to my professional interests. I may unsubscribe at any time. Reply There was an error processing your information. Please try again later. Thanks. We'll let you know when a new response is added. Send me notifications when members answer or reply to this question. Register Here or login if you are already a member E-mail ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "cisco", "sentiment": "negative"}, {"name": "techtarget", "sentiment": "negative"}], "locations": [{"name": "united states", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T18:34:53.007+03:00"}, {"thread": {"uuid": "c3afb94e256c105a0862b64021f88bc5927a9a86", "url": "https://www.businesswire.com/news/home/20190402005382/en/", "site_full": "www.businesswire.com", "site": "businesswire.com", "site_section": "", "site_categories": ["jewelry_making", "media", "hobbies_and_interests", "finance", "financial_news"], "section_title": "", "title": "ExxonMobil Invests in Singapore Integrated Complex to Upgrade Product Slate to Higher-Value Lube Base Stocks, Distillates | Business & Finance | heraldchronicle.com", "title_full": "ExxonMobil Invests in Singapore Integrated Complex to Upgrade Product Slate to Higher-Value Lube Base Stocks, Distillates | Business & Finance | heraldchronicle.com", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.638, "main_image": "https://bloximages.newyork1.vip.townnews.com/heraldchronicle.com/content/tncms/custom/image/52a8442c-ad3e-11e8-9945-9bec6b675371.jpg?resize=600%2C386", "performance_score": 0, "domain_rank": 5013, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "c3afb94e256c105a0862b64021f88bc5927a9a86", "url": "https://www.businesswire.com/news/home/20190402005382/en/", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "ExxonMobil Invests in Singapore Integrated Complex to Upgrade Product Slate to Higher-Value Lube Base Stocks, Distillates | Business & Finance | heraldchronicle.com", "text": "ExxonMobil Invests in Singapore Integrated Complex to Upgrade Product Slate to Higher-Value Lube Base Stocks, Distillates 9 hrs ago Save\nIRVING, Texas--(BUSINESS WIRE)--Apr 2, 2019-- ExxonMobil said today that it has made a final investment decision on a multi-billion dollar expansion of its integrated manufacturing complex in Singapore to convert fuel oil and other bottom-of-the-barrel crude products into higher-value lube base stocks and distillates.\nThe expansion project is part of the company’s plan to further enhance the competitiveness of the Singapore facility, which includes the world’s only steam cracker capable of cracking crude oil. The project, which leverages proprietary technologies, integration and scale, will significantly increase site downstream and chemical earnings potential. Engineering, procurement and construction activities have begun, and startup is anticipated in 2023.\n“The demand for high-quality fuels and lubricants will increase as the global economy expands,” said Bryan Milton, president of ExxonMobil Fuels & Lubricants Company. “By using a combination of proprietary catalyst and process technologies, we will increase the site’s competitiveness and help meet growing demand for high-performance lubricants and cleaner fuels.”\nThe investment will add 20,000 barrels per day of ExxonMobil Group II base stocks capacity, which includes EHC TM 50 and EHC TM 120 grades, in addition to a new high-viscosity Group II base stock to meet increasing demand in the Asia-Pacific region.\n“The project also applies new chemicals technologies and leverages integration across the crude cracker and refining complex to further enhance the competitiveness of crude cracking,” said Karen McKee, president of ExxonMobil Chemical Company.\nThe expansion will add the capacity to increase production of cleaner fuels with lower-sulfur content by 48,000 barrels per day, including high-quality ExxonMobil Marine fuels to enable customers to meet the International Maritime Organization’s 0.50 percent sulfur requirement.\nThe project represents the latest and most significant in a series of recent ExxonMobil investments in base stock production. Recent ExxonMobil EHC TM Group II base stock investments include a 2015 expansion in Singapore and the startup of a world-scale, enhanced hydrocracker unit in Rotterdam in 2018.\nEngineering, procurement and construction contracts have been awarded to Técnicas Reunidas for the new process units, and Wood Group for interconnecting pipelines and supporting infrastructure facilities. As part of the project, ExxonMobil is working on a long-term commercial agreement with Linde to upgrade residue from the site to hydrogen and synthesis gas.\nAbout ExxonMobil\nExxonMobil, the largest publicly traded international oil and gas company, uses technology and innovation to help meet the world’s growing energy needs. ExxonMobil holds an industry-leading inventory of resources, is one of the largest refiners and marketers of petroleum products, and its chemical company is one of the largest in the world. For more information, visit www.exxonmobil.com or follow us on Twitter www.twitter.com/exxonmobil .\nCautionary Statement : Statements relating to future plans, projections, events or conditions are forward-looking statements. Actual results, including project plans, timing, costs, and production; future earnings potential; integration benefits; efficiencies and competitiveness; and the impact of technology could differ materially due to factors including: changes in oil, gas or petrochemical prices or other market or economic conditions affecting the oil, gas and petrochemical industries, including the scope and duration of economic recessions; timely implementation of project plans; changes in law or government regulation, including tax and environmental requirements; the outcome of commercial negotiations; changes in technical or operating conditions; actions of competitors; future demand growth; and other factors discussed under the heading “Factors Affecting Future Results” in the “Investors” section of our website and in Item 1A of ExxonMobil’s 2016 Form 10-K. We assume no duty to update these statements as of any future date. The term “project” as used in this release does not necessarily have the same meaning as under any government payment transparency reporting requirements.\nView source version on businesswire.com : https://www.businesswire.com/news/home/20190402005382/en/\nCONTACT: ExxonMobil Media Relations\nKEYWORD: UNITED STATES ASIA PACIFIC NORTH AMERICA SINGAPORE TEXAS\nINDUSTRY KEYWORD: ENERGY OIL/GAS MANUFACTURING CHEMICALS/PLASTICS\nSOURCE: Exxon Mobil Corporation ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "higher-value lube bas", "sentiment": "neutral"}, {"name": "bryan milton", "sentiment": "none"}], "organizations": [{"name": "exxonmobil", "sentiment": "neutral"}, {"name": "exxonmobil fuels & lubricants company", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "save irving", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-02T19:22:04.077+03:00"}, {"thread": {"uuid": "40fa576b6c3232b3c4c4e726d600cb3f5063f347", "url": "https://networkengineering.stackexchange.com/questions/58214/ise-command-missing?atw=1", "site_full": "networkengineering.stackexchange.com", "site": "stackexchange.com", "site_section": "", "site_categories": ["non_standard_content", "adult"], "section_title": "", "title": "cisco ise - ISE - Command missing? - Network Engineering Stack Exchange", "title_full": "cisco ise - ISE - Command missing? - Network Engineering Stack Exchange", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.001, "main_image": "https://cdn.sstatic.net/Sites/networkengineering/img/apple-touch-icon@2.png?v=2ae76539f625", "performance_score": 0, "domain_rank": 179, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "40fa576b6c3232b3c4c4e726d600cb3f5063f347", "url": "https://networkengineering.stackexchange.com/questions/58214/ise-command-missing?atw=1", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "cisco ise - ISE - Command missing? - Network Engineering Stack Exchange", "text": "\nThanks for contributing an answer to Network Engineering Stack Exchange! Please be sure to answer the question . Provide details and share your research!\nBut avoid … Asking for help, clarification, or responding to other answers. Making statements based on opinion; back them up with references or personal experience.\nTo learn more, see our tips on writing great answers . draft saved Sign up or log in Sign up using Google Sign up using Email and Password Post as a guest ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "google", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-02T21:01:18.005+03:00"}, {"thread": {"uuid": "25e905ed91202be11536a8852ea82142df8374cf", "url": "https://patch.com/connecticut/bridgeport/cisco-kid", "site_full": "patch.com", "site": "patch.com", "site_section": "https://patch.com/connecticut/bridgeport", "site_categories": ["media"], "section_title": "Bridgeport, CT Patch - Breaking Local News Events Schools Weather &amp; Sports", "title": "The Cisco Kid | Bridgeport, CT", "title_full": "The Cisco Kid | Bridgeport, CT Patch", "published": "2019-03-31T22:28:00.000+03:00", "replies_count": 0, "participants_count": 1, "site_type": "news", "country": "US", "spam_score": 0.001, "main_image": "https://cdn20.patchcdn.com/users/23159742/20190331/022758/styles/T800x600/public/processed_images/600full-duncan-renaldo-1554055910-5181.jpg", "performance_score": 0, "domain_rank": 465, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "25e905ed91202be11536a8852ea82142df8374cf", "url": "https://patch.com/connecticut/bridgeport/cisco-kid", "ord_in_thread": 0, "author": "RICHARD SATTANNI", "published": "2019-03-31T22:28:00.000+03:00", "title": "The Cisco Kid | Bridgeport, CT", "text": "This post was contributed by a community member. The views expressed here are the author's own.\nNeighbor Posts The Cisco Kid THE ROBIN HOOD OF THE OLD WEST By RICHARD SATTANNI, Patch Poster | Mar 31, 2019 2:28 pm ET 0 TITLE-THE CISCO KID\nThis show starred DUNCAN RENALDO as the CISCO KID and LEO CARRILLO as PANCHO.Duncan was born RENAULT RENALDO DUNCAN APRIL 23 1904-DIED SEPTEMBER 3RD 1984.HE was well known as THE CISCO KID.Active years 1928-1980.A big tv star at the time.Along with LEO CARRILLO they did 156 episodes of THE CISCO KID from 1949-1955.IN the earlier times in 1934 DUNCAN RENALDO was arrested by immigration officers for illegal immigration.IN earlier times 1928 he did major films.The CISCO KID ran from 1950-1956 on tv.IT was filmed in color but the series was shown in black and white because this was before color tv existed.TO me THE CISCO KID AND PANCHO were tv heroes when tv was in its'infancy.\nAUTHOR RICHARD SATTANNI\nGet the Bridgeport newsletter", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": ["https://twitter.com/intent/tweet?text=The%20Cisco%20Kid&url=https%3A//patch.com/connecticut/bridgeport/cisco-kid", "https://www.facebook.com/sharer/sharer.php?u=https%3A//patch.com/connecticut/bridgeport/cisco-kid", "https://plus.google.com/share?url=https%3A//patch.com/connecticut/bridgeport/cisco-kid&t=The%20Cisco%20Kid", "http://www.reddit.com/submit?url=https%3A//patch.com/connecticut/bridgeport/cisco-kid&title=The%20Cisco%20Kid"], "entities": {"persons": [{"name": "neig", "sentiment": "neutral"}, {"name": "pancho", "sentiment": "none"}, {"name": "robin", "sentiment": "none"}, {"name": "duncan renaldo", "sentiment": "none"}, {"name": "richard sattanni", "sentiment": "none"}, {"name": "renaldo duncan", "sentiment": "none"}, {"name": "leo carrillo", "sentiment": "none"}], "organizations": [{"name": "cisco", "sentiment": "none"}, {"name": "et", "sentiment": "none"}], "locations": [{"name": "bridgeport", "sentiment": "none"}]}, "rating": null, "crawled": "2019-04-03T08:26:36.066+03:00"}, {"thread": {"uuid": "88d6742805f8aa7dc26664667508c680c7a0f168", "url": "https://www.today.com/food/soda-bottle-collector-old-coca-cola-bottles-may-be-worth-t151350", "site_full": "www.today.com", "site": "today.com", "site_section": "", "site_categories": ["media"], "section_title": "", "title": "Soda bottle collector? Old Coca-Cola bottles may be worth big bucks", "title_full": "Soda bottle collector? Old Coca-Cola bottles may be worth big bucks", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.961, "main_image": "https://media3.s-nbcnews.com/j/newscms/2019_14/1421977/coca-cola-bottle-today-main-190401_3ea14d8bf4545925afbe4a303891d257.social_share_1200x630_center.jpg", "performance_score": 1, "domain_rank": 1186, "social": {"facebook": {"likes": 362, "comments": 300, "shares": 185}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "88d6742805f8aa7dc26664667508c680c7a0f168", "url": "https://www.today.com/food/soda-bottle-collector-old-coca-cola-bottles-may-be-worth-t151350", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "Soda bottle collector? Old Coca-Cola bottles may be worth big bucks", "text": "Trends Hanging on to Coca-Cola collectibles? This vintage bottle is valued at $150,000 Recycling old soda bottles is probably a good idea but double check any vintage Coke containers before saying goodbye. Getty Images Get the latest from TODAY Sign up for our newsletter SUBSCRIBE April 2, 2019, 5:37 PM GMT / Source: TODAY By Erica Chayes Wida Any die-hard collector of vintage goods knows that patience is a virtue. Sure, curating a wall of old keepsakes is a fun past time. But perhaps the most exhilarating part of collecting happens when you realize that the dusty old toy, shoe or even bottle you've been keeping around for decades is worth a lot more than you originally paid for it. Like vintage Pyrex or Tupperware pieces, some old Coca-Cola bottles may be worth their weight in gold — and then some. Recently, a rare Coca-Cola glass bottle from around 1915 was put up for auction with a minimum bid of $50,000. However, the Las Vegas-based auction house Morphy Auctions currently has the bottle valued between $100,000 to $150,000. According to the auction house , this particular model is believed to be a part of the original, unseen sample designs tested by Coca-Cola in the early 1900s. That testing period occurred before the final bottle was selected and produced nationally in April 1917. All other test models are believed to have been destroyed, so this one stamped with its original \"Atlanta\" embossing, with Coca-Cola stamped on the bottom \"heel,\" is rumored to be the only one of its kind in mint condition that exists today. According to the auction house, the very rare item was discovered recently, just days after it had obtained and sorted through \"a Coca-Cola collection acquired from a retired Coca-Cola employee who worked for Chapman Root,\" an old Coca-Cola bottling plant in Indiana. Orange Vanilla Coke is coming! KLG and Hoda try it out Feb. 8, 2019 01:21 While this particular bottle is special in its uniqueness (and high value), it's not the only one that's worth six figures. In a similar prototype was discovered in 2011, and eventually sold for $228,000. While not all vintage soda bottles will help you pocket a small fortune overnight, there are plenty of collectible bottles that are worth more than any drink. According to Country Living , many vintage soda bottles (from the early 1900s through the 1970s) are pretty easy to come across and can sell for $10 to $30, depending on whether they were part of a limited release. A Hutchinson-style bottle (known for its wired stopper) in great condition, which the Coca-Cola Company says were its first bottles manufactured in the mid-1890s through the early 1900s, are harder to find as there were only a few dozen varieties distributed in Alabama, Georgia, Tennessee and Mississippi. These bottles with script letter logos range from $2,500 to $4,000. In 1894, Coca-Cola was sold in bottles for the first time in Vicksburg, MS. Local shop owner Joseph A. Biedenharm used the bottles that he had on hand to bottle soda water, which happened to be Hutchinson blob-top bottles embossed with “Biedenharn Candy Company, Vicksburg, Miss.” pic.twitter.com/aT95jwMgOm — HISTORY (@HISTORY) March 12, 2018 Another type of Coca-Cola bottle to look out for is one with amber-colored glass and straight sides, which the company says was issued right after the Hutchinson model. Love to Know Antiques stated that this type of bottle recently sold for $43 on eBay . Coca-Cola calls these bottles a \"gold mine for collectors\" because there are so many available in many different sizes, colors and markings, that will rake in anywhere from $25 to $400. Related Check your cupboards! Your vintage Pyrex may be worth big bucks Now that it's officially spring-cleaning season , when you're clearing out the attic, double check any old soda bottles before tossing them out. Better yet? Next time you're at a garage sale, don't skip over the glass section. Look out for the manufacturing date stamped on the bottle somewhere — if it's pretty old, don't hesitate to shell out a few bucks for something that may be worth thousands one day. Erica Chayes Wida Erica Chayes Wida is a New York City-area based journalist and food writer obsessed with culture, poetry and travel. Follow her work on Contently . ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [{"name": "erica chayes wida", "sentiment": "none"}], "organizations": [{"name": "coca-cola", "sentiment": "positive"}, {"name": "coke", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-03T11:56:56.069+03:00"}, {"thread": {"uuid": "e0e5453409635aaeb981ca255afdfbf9dfbb86dd", "url": "https://www.cisco.com/c/en/us/solutions/collaboration/webex-calling/index.html", "site_full": "www.cisco.com", "site": "cisco.com", "site_section": "", "site_categories": ["computer_certification", "computer_networking", "tech"], "section_title": "", "title": "Webex Calling - Cloud PBX for enterprise - Cisco", "title_full": "Webex Calling - Cloud PBX for enterprise - Cisco", "published": "2019-04-02T03:00:00.000+03:00", "replies_count": 0, "participants_count": 0, "site_type": "news", "country": "US", "spam_score": 0.0, "main_image": "https://www.cisco.com/web/fw/i/logo-open-graph.gif", "performance_score": 0, "domain_rank": 748, "social": {"facebook": {"likes": 0, "comments": 0, "shares": 0}, "gplus": {"shares": 0}, "pinterest": {"shares": 0}, "linkedin": {"shares": 0}, "stumbledupon": {"shares": 0}, "vk": {"shares": 0}}}, "uuid": "e0e5453409635aaeb981ca255afdfbf9dfbb86dd", "url": "https://www.cisco.com/c/en/us/solutions/collaboration/webex-calling/index.html", "ord_in_thread": 0, "author": "", "published": "2019-04-02T03:00:00.000+03:00", "title": "Webex Calling - Cloud PBX for enterprise - Cisco", "text": "What Webex Calling can do for you Comprehensive PBX features\nWelcome callers with a virtual receptionist and personalized voice mailboxes. Make calls with extension numbers, direct inward dialing (DID) numbers, directory URIs (email-style addresses), or directory-based dialing. A phased approach to cloud migration\nCisco Webex Calling offers synchronized directory and dial plans for mixed cloud and on-premises networks. Enhanced experience for mobile devices\nMake and receive calls with the Webex Calling or Webex Teams app on your desktop and mobile devices. Become more productive with messaging, screen and file sharing, and complete meetings capabilities, now available from anywhere. Easy cloud phone system management\nWebex Calling is easy and intuitive to provision, manage, and set up. The Webex Control Hub provides a simple interface for IT to make changes, and a self-care portal means users can handle basic settings and preferences for themselves. Part of a complete collaboration solution Cisco IP Phone 7800 Series\nAffordable single and multiline models for workers, conference, shared, and lobby areas. Cisco IP Phone 8800 Series\nColor LCD displays, gigabit Ethernet, Wi-Fi, Bluetooth, USB, and HD video calling models. ", "highlightText": "", "highlightTitle": "", "language": "english", "external_links": [], "entities": {"persons": [], "organizations": [{"name": "webex calling", "sentiment": "negative"}, {"name": "cisco", "sentiment": "negative"}, {"name": "webex control hub", "sentiment": "none"}, {"name": "cisco webex", "sentiment": "none"}, {"name": "webex teams", "sentiment": "none"}], "locations": []}, "rating": null, "crawled": "2019-04-04T06:01:40.011+03:00"}], "totalResults": 12, "moreResultsAvailable": 0, "next": "/filterWebContent?token=6c661f77-9010-47fb-9532-d5fdb563c97a&format=json&ts=1554346900011&q=published%3A%3E1553658014000+published%3A%3C1554172814000+domain_rank%3A%3C10000+site_type%3Anews+language%3Aenglish+title%3A%28%22Cisco%22+OR+%22CISCO+Systems%22+OR+%22Cisco+Systems+Incorporated%22+OR+%22Cisco+Systems+Inc%22+OR+%22Cisco+Systems%2C+Inc.%22+OR+%22Network+Magic%22+OR+%22Five+Across%22+OR+%22Greenfield+Networks%22+OR+%22Cisco+IP+Communicator%22+OR+%22Cisco%27s+3+Layered+Model%22+OR+%22Arch+Rock+Corporation%22+OR+%22CoreOptics%22+OR+%22ExtendMedia%22+OR+%22PostOffice+Protocol%22+OR+%22Criticism+of+Cisco+Systems%22+OR+%22Cisco+small+business%22+OR+%22Cisco+Systems%22+OR+%22Co-cola%22+OR+%22Coca-colas%22+OR+%22CocaCola%22+OR+%22Ke+Kou+Ke+Le%22+OR+%22Coke+mini%22+OR+%22Coca-Cola+M5%22+OR+%22History+of+Coca-Cola%22+OR+%22Production+of+Coca-Cola%22+OR+%22Coke-Cola%22+OR+%22Coca-cola%22+OR+%22Coca+-cola%22+OR+%22Coke+bottle%22+OR+%22Passover+Coca-Cola%22+OR+%22Coca-Cola%22+OR+%22Coca+Cola+Canada%22+OR+%22Coca-Cola+Classic%22+OR+%22Cocacola%22+OR+%22Coca+Cola%22+OR+%22Coke+Classic%22+OR+%22Coke%22+OR+%22Coca+cola%22+OR+%22Coca+Cola+Classic%22+OR+%22Coca-Cola+1%22+OR+%22Passover+Coca+Cola%22+OR+%22Great+Plains+Coca+Cola%22+OR+%22Coca-Cola+Australia+Foundation%22+OR+%22Contour+bottle%22+OR+%22Classic+coke%22+OR+%22CocaCola.com%22+OR+%22Cocacola.com%22+OR+%22Coco+cola%22+OR+%22Coke%22+OR+%22Coka+cola%22+OR+%22Classic+Coke%22+OR+%22Coke+bottles%22+OR+%22Large+coke%22+OR+%22Coca+cola+christmas+advert%22+OR+%22Minute+Maid+Lemonade%22+OR+%22Minute+Maid+Light+Lemonade%22+OR+%22Coke+Mini%22+OR+%22Coke%22+OR+%22Coca-Cola+bottle%22+OR+%22Coke+Bottle%22+OR+%22Coca-Cola%22+OR+%22ExxonMobil+Corp.%22+OR+%22ExxonMobil+Corporation%22+OR+%22Exxon+Shipping+Company%22+OR+%22Vistamaxx%22+OR+%22Exxon+Chemical+Company%22+OR+%22Exxon+Corp%22+OR+%22Exxon+Mobil+Corp.%22+OR+%22Exxon+Mobil+Corporation%22+OR+%222011+Yellowstone+River+oil+spill%22+OR+%22Mobil%27s+Flying+Horse%22+OR+%22Exxon+Mobil+Canada+Properties%22+OR+%22Exxon+Corporation%22+OR+%22Exxon+Mobil%22+OR+%22Exxon+Mobile%22+OR+%22Mobil+Corporation%22+OR+%22Exxon-Mobil%22+OR+%22Exxonmobil%22+OR+%22Esso+Corporation%22+OR+%22ExxonMobil+Chemical+Co.%22+OR+%22ExxonMobile%22+OR+%22Exxon-Mobil+Corporation%22+OR+%22ExxonMobil+Oil%22+OR+%22ExxonMobil+Chemical+Company%22+OR+%22ExxonMobil+Chemical%22+OR+%22EXXonmobil%22+OR+%22Exxon+Mobil+merger%22+OR+%22Exxon+mobil%22+OR+%22Exxon-Mobile%22%29", "requestsLeft": 972, "warnings": null}